{
  "name": "Steve Norberg",
  "slug": "steve-norberg",
  "email": "s.norbergh@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127375/1565071",
  "image": "/images/candidates/steve-norberg-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=NORBS--997&election_year=2023",
  "uuid": "NORBS--997",
  "party": "",
  "statement": "**Elected Experience**  \nN/A  \n  \n**Other Professional Experience**\n\nProfessor and Regional Forage Specialist with Washington State University and Franklin County Extension last 12 Years; Teaching/Research Associate at University of Nebraska; 2023 - National Distinguished Service Award by the NACAA; 2015 - Search for Excellence in Crop Production Award  \n  \n**Education**  \nUniversity of Nebraska - Bachelors of Science, Agriculture; University of Nebraska - Master of Science, Agronomy; Oregon State University - Ph.D. Crop Science  \n  \n**Community Service**  \nMentor with Forge Youth Mentoring; Ex-Officio with Washington State Hay Growers Association; Superintendent of Hay Kings Contest at Benton-Franklin County Fair; Active in a local church  \n  \n**Statement**  \nPasco’s future lies with our kids. Our kids deserve the best education possible to prepare them for success. Success is accomplished by teaching them the basics of reading, writing, arithmetic and learning how to become independent lifelong learners. My conservative values and leadership will help guide Pasco schools to ensure a healthy learning atmosphere and result in students that are well prepared for their future. As evidence of my conservative values, I am endorsed by the Franklin County Republican Central Committee. It is critical for parents to be involved with their child’s education and the school should encourage this and not interfere with their relationship or parental rights. I will do my best to wisely use the finances that are available. I have written and managed budgets, people and resources to accomplish research and extension programs, including a national team of eight Professors. My course work in teaching methods and experience in teaching will assist me in my leadership and wisdom to the Pasco School District.",
  "electionyear": "2023",
  "office": "Pasco School Board Pos 1",
  "website": ""
}