{
  "name": "Skip Novakovich",
  "slug": "skip-novakovich",
  "email": "skip@novakovichllc.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127092/1564779",
  "image": "/images/candidates/skip-novakovich-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=NOVAS  336&election_year=2023",
  "uuid": "NOVAS  336",
  "party": "",
  "statement": "**Elected Experience**\n\nServed as a Port of Kennewick Commissioner since 2009, currently President. Possesses a strong background in business/economic development, has a demonstrated history of negotiating mutually beneficial partnerships with private and governmental entities.\n\n**Other Professional Experience**\n\nSkip owned, Esprit, the Tri-Cities largest printing company for 30 years and was honored as Kennewick Man of the Year and Tri-Citian of the Year.\n\n**Education**\n\nGraduate of Whitman College (Economics). Is a Retired Army Lieutenant Colonel. Graduated with honors from US Army Logistical Management College and US Army Command and General Staff College.\n\n**Community Service**\n\nServed on the board of Printing Industries of America and many governmental and nonprofit organizations.\n\n**Statement**\n\nSince 2009, it has been my honor to serve you on the Port of Kennewick Commission. In those fourteen years the Port team has made some astounding progress. It hasn’t always been easy but the significant rewards to our region make it all worthwhile.\n\nI have always believed _together we are better_ and this has been proven by the Port’s partnerships with others. In Benton County, Columbia Gardens Wine and Artesian Village is an extremely successful waterfront destination. The Port provided $500,000 to the City of Kennewick to improve Washington Street connecting it with the riverfront; provided the City of Richland $800,000 for Columbia Park Trail improvements; sold West Richland the racetrack at $1,000,000 under value, allowing them to create economic development. Our largest project remains Vista Field which has the potential of creating 3200 new jobs and adding half a billion dollars to the tax roles. This exciting addition to our area is destined to be world-class.\n\nWith our partnerships we are improving the region’s quality of life and creating economic vitality. I am looking forward to continue serving you in the exciting future of the Port of Kennewick.",
  "electionyear": "2023",
  "office": "Port of Kennewick Commissioner 3",
  "website": ""
}