{
  "name": "Allison Ball",
  "slug": "allison-ball",
  "email": "",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125225/1562868",
  "image": "/images/candidates/allison-ball-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BALLA--826&election_year=2023",
  "uuid": "BALLA--826",
  "party": "",
  "statement": "**Elected Experience**\n\nNo Information Submitted\n\n**Other Professional Experience**\n\nDelta Air Lines Flight Attendant, 27 years\n\n**Education**\n\nColumbia Basin College, Georgia State University\n\n**Community Service**\n\nWashington State Leadership Board, Tres Rios Community Land Trust Board, Tri-Cities Diversity and Inclusion Council Member, Rotary Club of Richland member\n\n**Statement**\n\nI have an unwavering commitment to a future built on progress. Our city stands at a crossroads, where the decisions we make today in Richland will shape the community we leave for our children.\n\nWe must work for a society where every individual, regardless of their social or economic background, has an equal opportunity to succeed. It is not enough to merely speak of equality; we must actively work to dismantle the barriers that stand in its way. We need to move forward, not backward— creating a community that accepts everyone and builds for the future.\n\nI support improving our program of social workers who answer police calls when a police response is not needed. I also support incentives for building more affordable housing. I support efforts to build a facility for better mental health care. Central Richland needs redevelopment. I would also like to see the code enforcement department operating at full complement.\n\nI ask for your support, not just for me, but for the values we hold dear. Together, let us shape a future where justice triumphs over prejudice, where opportunity is accessible to all, and where compassion guides our actions.",
  "electionyear": "2023",
  "office": "Richland City Council Pos 1",
  "website": ""
}