{
  "name": "Vincent Guerrero",
  "slug": "vincent-guerrero",
  "email": "vinnie4652000@yahoo.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127375/1565072",
  "image": "/images/candidates/vincent-guerrero-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=GUERV--221&election_year=2023",
  "uuid": "GUERV--221",
  "party": "",
  "statement": "**Elected Experience**\n\n  \n\nNo information submitted\n\n**Other Professional Experience**\n\nVincent Guerrero was born and raised in Eastern Washington. Raised by parents who are farmers and still are farming. Vincent knows Eastern Washington and how life in the area is different than that of other areas.\n\n**Education**\n\nVincent is married and has two children in Pasco’s public schools. Vincent earned a bachelor’s degree from Central Washington University and has a master’s degree in public administration. Vincent is also a certified public manager.\n\n**Community Service**\n\nVincent has over twenty years’ experience working with local government, is a Meals on Wheels board member, and is a member of Pasco Kiwanis Club.\n\n**Declaration**\n\nVincent was born and raised in Eastern Washington. He knows this area is attractive, and people come to this area to raise their children in a safe place they can call home. Vincent’s parents were born and raised in Texas, moved to Eastern Washington in the 60’s and began their journey together soon after as farmers. \n\nVincent is running for Pasco School Board to help lead the district in a positive and productive manner. The area has seen tremendous growth and change in the last twenty years and a strong person is needed to help lead the district in its vision and goals. Vincent feels that he has a duty and responsibility to the citizens and children of not only district #1 but the whole school district to help guide it in a positive direction. Having a master’s degree in public administration helps with being a good listener, setting goals, creating policies, collaboration, consensus, and working toward a unified vision.\n\nVincent knows that commitment is not just in words but in action. Vincent will work hard to ensure all children receive an opportunity for a quality education.",
  "electionyear": "2023",
  "office": "Pasco School Board Pos 1",
  "website": ""
}