{
  "name": "Gregery Levy",
  "slug": "gregery-levy",
  "email": "LevyforCouncil@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125226/1562870",
  "image": "/images/candidates/gregery-levy-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LEVYG--811&election_year=2023",
  "uuid": "LEVYG--811",
  "party": "",
  "statement": "**Elected Experience:**\n\nElected Chair of City of Richland Code Enforcement Board\n\n**Other Professional Experience:**\n\nTraining Specialist, WRPS; Radiological Control Supervisor, Puget Sound Naval Shipyard; Nuclear Machinist Mate 1st Class, United States Navy\n\n**Education:**\n\nNaval Nuclear Power School\n\n**Community Service:**\n\nServed 5 years on City of Richland Code Enforcement Board, Vice-President of the Board, Rude Mechanicals Theatre Company, 2018-2020, Community Judge, NCFCA Debate Regional Qualifier\n\n**Statement**\n\nThirteen years ago I left a job I didn’t need to leave to move to Richland. Primary among the reasons for that choice was that Richland felt like a better place to raise a family than the Puget Sound Area. There were large parks we could take the kids to on the weekends and smaller neighborhood parks they could easily walk to for an afternoon of enjoying the sunshine. For me, if my schedule prevented me getting to the mountains, then I could always head to the Amon Basin or Chamna Natural Reserve to relax and not hear cars for a little bit.  \n  \nRichland remains a good place to raise a family, but it takes active participation by involved citizens to keep it that way. As someone who grew up in the Puget Sound area I saw a lot of towns rapidly become cities in an uncontrolled, unplanned manner, often outgrowing the families that lived there. Growth and development, especially when properly managed, are required for a city to maintain its vitality. I look forward to helping Richland grow, while also staying a great place to raise a family.",
  "electionyear": "2023",
  "office": "Richland City Council Pos 5",
  "website": ""
}