{
  "name": "Charles Grimm",
  "slug": "charles-grimm",
  "email": "charlesforpasco@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125362/1563027",
  "image": "/images/candidates/charles-grimm-original.jpg",
  "pdc_url": "",
  "uuid": "GRIMC--727",
  "party": "",
  "statement": "**Elected Experience**  \nPrecinct Committee Officer 2020-2024, Republican State Committeeman 2020-2022   \n  \n**Other Professional Experience**  \nI have owned my own business in Franklin County for 16 years; 11 in North Franklin County, and almost 5 years in Pasco and currently employ 20 +/- people while managing a multi-million dollar yearly budget.  \n  \n**Education**  \nNo information submitted  \n  \n**Community Service**  \nI was on a Planning Commission for a decade where I was the Chair for the majority of that time so I understand working on a municipal Comprehensive Plan and advising the City Council on ordinances. Pasco Chamber Board Member, Franklin Co. Sheriff's Citizen Advisory Board, Volunteer Chaplain at the Union Gospel Mission.   \n  \n**Statement**  \n_We need leadership in Pasco_. I believe in servant-style leadership that listens to the people I serve and asks tough questions on their behalf. I am a constitutional conservative that believes in limited government and fiscal responsibility. I have been married for 17 years and have 5 children. I believe family is the bedrock of civilization and I am a staunch supporter of parental rights. \n\n_I want to work with Downtown businesses to revitalize the area_ and ensure the commercial/industrial area stays relevant and represented.\n\n_I want to fix West Pasco traffic_. We have a mess on our hands on the 68 corridor. We need to look at a holistic approach that gets people moving again and not just applying a band-aid here and there.\n\n_I want to develop the Broadmoor area responsibly._ The area is just a little smaller than downtown Seattle with a clean slate and a real opportunity for us to create an appealing urban environment of community and commerce in Pasco.\n\nI am a strong supporter of police and I want to find solutions for homelessness, addiction, and mental illness. \n\nI am grateful for those supporting me and I would be honored to receive your vote.",
  "electionyear": "2023",
  "office": "Pasco City Council Pos 2",
  "website": "https://www.facebook.com/charlesgrimmforpascocitycouncil"
}