{
  "name": "Talesha \"Tali\" Sams",
  "slug": "talesha-tali-sams",
  "uuid": "talesha-tali-sams",
  "party": "",
  "statement_html": "<p><strong>Legal/Judicial Experience\n</strong><br />\nAttorney with Adult Protective Services; Title 11 Guardian Ad Litem; District Court Judge Pro Tem; Prosecutor; Public Defender; Private practice for 20 years; County Bar Association Trustee.\n</p>\n<p><strong>Other Professional Experience\n</strong><br />\nNurse; Respiratory Therapist; Emergency Medical Technician; Ranger/Paratrooper; Combat Veteran; PFLAG President.\n</p>\n<p><strong>Education\n</strong><br />\nLaw degree from Gonzaga University; Bachelor&rsquo;s degree in Arts and Social Sciences from Washington State University; Associate degree in respiratory therapy/nursing and Emergency Medical Technician from Walla Walla Community College.\n</p>\n<p><strong>Community Service\n</strong><br />\nYWCA Domestice Violence Shelter; Benton-Franklin County Legal Aid Society; Various County Bar Associations; Assisting youth, the LGBTQ community, and the public through PFLAG, Pride Foundation, and free legal clinics.\n</p>\n<p><strong>Statement\n</strong><br />\nI have always made it my priority to serve the public and advocate for the disadvantaged. I have practiced in the areas of civil, criminal and administrative law. I have worked in private practice and as a prosecutor in both District and Superior Courts. I have worked for DSHS in protecting vulnerable adults from different forms of abuse and as a Title 11 Guardian Ad Litem. I have volunteered countless hours in legal clinics in the area by assisting individuals in need of legal assistance. I have been a Judge Pro Tem for King County District Court since 2015.\n</p>\n<p>Because of my diverse legal background combined with my many years of community service, I would be a well prepared and effective Judge. I would uphold the law and would not legislate any personal agenda. I feel that a Judge should be knowledgeable and experienced in all matters before them. A Judge should possess humility, a positive demeanor and temperament, and treat all those who come before the bench with respect and fairness regardless of their social or economic backgrounds. A Judge should never put their own interests before those of the court or the public for which they serve.</p>",
  "electionyear": "2020",
  "office": "",
  "website": "",
  "email": "electsams@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/46426",
  "pdc_url": ""
}