{
  "name": "Dave Petersen",
  "slug": "dave-petersen",
  "uuid": "PETED  338",
  "party": "Non Partisan",
  "statement": "**Legal/Judicial Experience**  \nMunicipal Court Judge, City of Pasco; Judge Pro Tem, Benton and Franklin County Superior and District Courts; Owner, Petersen Law Office; Former partner, Cowan, Moore, Stam, Luke, Petersen & Carrier; Former partner, Roach Law Offices; Former Deputy Prosecutor, Franklin County.  \n  \n**Other Professional Experience**  \nFormer tank mechanic/aviation support, U.S. Army and National Guard.  \n  \n**Education**  \nJuris Doctorate, Thurgood Marshall School of Law; BA Business Administration, University of Washington.  \n  \n**Community Service**  \nBoard member, Benton Franklin Legal Aid Society; Volunteer coach, Tri-City Prep Mock Trial Team; Volunteer, Local National Adoption Day; Committee member, United Methodist Church; Former Guardian ad Litem; Former instructor, Reserve Law Enforcement Academy.  \n  \n**Statement**  \n_Integrity. Fairness. Experience._  \n  \nIt is my firm belief that as your next Benton Franklin County Superior Court Judge, I am a steward of your Constitutional Rights. While holding offenders accountable for their crimes, I will ensure that dignity and respect are fundamental principles employed by the court. Regardless of the matters before me, I will bring integrity, fairness, and impartiality to the bench.  \n  \nI am the only candidate with vast experience as a municipal court judge and judge pro tem, in addition to 20+ years of experience in civil, criminal and family law matters, and over ten years of experience as a family law mediator. My extensive experience and rational temperament makes me the most qualified candidate for your next Superior Court Judge.  \n  \nBorn in Kennewick, I have called this community “home” my entire life, only moving away to serve in the U.S. Army and to attend school. My wife and I are life long residents of this community, raising our three daughters in the Tri-Cities. I would be honored to serve as your next Superior Court Judge. I will work hard to earn your support and trust.  I will work even harder to maintain it.",
  "statement_html": "<strong>Legal/Judicial Experience</strong><br />\nMunicipal Court Judge, City of Pasco; Judge Pro Tem, Benton and Franklin County Superior and District Courts; Owner, Petersen Law Office; Former partner, Cowan, Moore, Stam, Luke, Petersen &amp; Carrier; Former partner, Roach Law Offices; Former Deputy Prosecutor, Franklin County.<br />\n<br />\n<strong>Other Professional Experience</strong><br />\nFormer tank mechanic/aviation support, U.S. Army and National Guard.<br />\n<br />\n<strong>Education</strong><br />\nJuris Doctorate, Thurgood Marshall School of Law; BA Business Administration, University of Washington.<br />\n<br />\n<strong>Community Service</strong><br />\nBoard member, Benton Franklin Legal Aid Society; Volunteer coach, Tri-City Prep Mock Trial Team; Volunteer, Local National Adoption Day; Committee member, United Methodist Church; Former Guardian ad Litem; Former instructor, Reserve Law Enforcement Academy.<br />\n<br />\n<strong>Statement</strong><br />\n<em>Integrity. Fairness. Experience.</em><br />\n<br />\nIt is my firm belief that as your next Benton Franklin County Superior Court Judge, I am a steward of your Constitutional Rights.  While holding offenders accountable for their crimes, I will ensure that dignity and respect are fundamental principles employed by the court.  Regardless of the matters before me, I will bring integrity, fairness, and impartiality to the bench.<br />\n<br />\nI am the only candidate with vast experience as a municipal court judge and judge pro tem, in addition to 20+ years of experience in civil, criminal and family law matters, and over ten years of experience as a family law mediator.  My extensive experience and rational temperament makes me the most qualified candidate for your next Superior Court Judge.<br />\n<br />\nBorn in Kennewick, I have called this community &ldquo;home&rdquo; my entire life, only moving away to serve in the U.S. Army and to attend school.  My wife and I are life long residents of this community, raising our three daughters in the Tri-Cities.  I would be honored to serve as your next Superior Court Judge.  I will work hard to earn your support and trust.&nbsp; I will work even harder to maintain it.<br />",
  "electionyear": "2020",
  "office": "Superior Court Judge",
  "website": "http://dave4judge.com",
  "email": "daveforjudge@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/77690",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=PETED  338&election_year=2020",
  "image": "/images/candidates/dave-petersen-original.png"
}