{
  "name": "Mark G. Schoesler",
  "slug": "mark-g-schoesler",
  "uuid": "KLICM--362",
  "party": "Republican",
  "statement_html": "<p><strong>Elected Experience\n</strong><br />\nElected to the Senate in 2004, 2008, and 2016 after serving 12 years in the State House. Elected State Senate Majority Leader for 2015 Legislative Session.\n</p>\n<p><strong>Other Professional Experience\n</strong><br />\nSelf-employed farmer and rancher, raising cattle, wheat, hay, and canola. Member, Ways and Means; Member, Rules; Member, Labor and Commerce; Member, Select Committee on Pension Policy, Washington State Institute for Public Policy.\n</p>\n<p><strong>Education\n</strong><br />\nGraduate, Ritzville High School; Graduate, Spokane Community College (A.A.S., Agribusiness)\n</p>\n<p><strong>Community Service\n</strong><br />\nFormer director, Washington Association of Wheat Growers; Member, Zion Philadelphia Church; Former vice president, Wheatland Communities Fair; Former president, Bronco Boosters; Past President of Washington Friends of Farms and Forests.</p>\n<p><strong>Statement\n</strong><br />\nAs your senator, Mark Schoesler is dedicated to ensuring Eastern Washington&rsquo;s voice is heard in Olympia and has consistently advocated to limit tax increases, prioritize spending on infrastructure, and stand against Seattle policies and politicians.\n</p>\n<p>As Washingtonians grapple with COVID-19, Sen. Schoesler supported emergency measures to keep people safe. Now, he is leading the charge on safely restarting our economy. Schoesler and Republican legislators crafted restart plans to get low-risk workers and small business owners back to their livelihoods.\n</p>\n<p>As Senate Minority Leader, Sen. Schoesler pushed back against extreme Seattle sex-education policies that took local control away from schools. When he was Majority Leader, the percentage of the state budget going to education increased from 46% to 51%, college tuition was cut, and safety improvements have restarted on key highways. He remains focused on agriculture which reflects his background as a fifth-generation farmer in Ritzville. Mark has worked closely with counties, schools, hospitals, universities, and public safety officials to protect the services we depend on.\n</p>\n<p>Sen. Schoesler is a proven compassionate, thoughtful, and effective leader in Olympia, and our district would be best served to retain him in his current leadership role.</p>",
  "electionyear": "2020",
  "office": "State Representative",
  "website": "http://markschoesler.com/",
  "email": "mschoesler@yahoo.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57365/45234",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=KLICM--362&election_year=2020"
}