{
  "name": "Jeff J Smart",
  "slug": "jeff-j-smart",
  "uuid": "SMARJ--352",
  "party": "Republican",
  "statement_html": "<strong>Elected Experience:</strong> Treasurer, Washington Association of Realtors 2020.&nbsp; President, Tri City Association of Realtors 2018.&nbsp;<br />\n<strong><br />\nOther Professional Experience:</strong> Owner and Designated Broker of Smart &ndash; Realtors (a second generation Real Estate brokerage in the Tri Cities) and HomeSmart Elite Brokers.&nbsp;<br />\nCoordinator at Washington State University Tri Cities for many years bringing needed education to place bound adults across the State through distance learning technology.&nbsp;<br />\nSenior Director for DMX Music, an international music broadcasting company.&nbsp; Managing staff and budgets in 6 different continents.&nbsp;&nbsp;<br />\n<strong><br />\nEducation:</strong> Graduate Kamiakin High School.&nbsp; Graduate Washington State University in Pullman (BA, Broadcast Communications, Minor in Political Science).<br />\n<br />\n<strong>Community Service:</strong> KCHelp, TROT, Catholic Family and Child Services<br />\n&nbsp;<br />\n<strong>Statement:</strong> Jeff J Smart is running to be your Benton County Commissioner.<br />\n<br />\nThe citizens of Benton County need transparency from their elected leaders.&nbsp; They deserve to know where their hard-earned tax money is being spent.&nbsp; The public safety tax needs to be explained to members of the county who are funding the account.&nbsp; New, elevated property tax revenue needs to be examined and explained to the property owners as to why the values on their property were substantially increased.&nbsp; If possible, that decision needs to be reversed or taxes need to be lowered to an appropriate level.&nbsp; Work needs to be done with the State to expand urban growth boundaries which would bring more land into the county, expanding the availability of affordable housing, thus opening up the market across in all price points. A mental health facility that can serve the needs of youth and adults needs to be brought to the community and be available to not just those who have insurance, but also those that do not and those that can pay out of pocket for services.&nbsp;<br />\n<br />\nAs your next county Commissioner, I promise to be accessible, transparent, and responsive to the public that I serve.&nbsp;&nbsp;<br />",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "",
  "email": "jeff@2020smartvote.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/45321",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=SMARJ--352&election_year=2020"
}