{
  "facebook": "https://www.facebook.com/RepBradKlippert/",
  "party": "Non Partisan",
  "name": "Brad Klippert",
  "slug": "brad-klippert",
  "statement": "**Elected Experience  \n**State Representative. Committees: Public Safety, Judiciary, Early Learning, Veterans Affairs/Military Operations. Caucuses: Aviation, Railroad, Heritage, Wildland Fire, Recreation.\n\n**Other Professional Experience  \n**Benton and Pierce County Sheriff's Deputy. Colonel/Commander Washington State Guard, 30 years military service, deployed 3 times, Army Helicopter Pilot. Licensed Minister, Paramedic Firefighter, and Volunteer Firefighter.\n\n**Education  \n**Bachelors’ Degree: Behavioral Science and Biblical Studies. Masters’ Degree in Teaching. Certified as a teacher in Washington State in 1997. Nationally certified Paramedic, EMT, Pierce County Fire District Firefighting Academy.\n\n**Community Service  \n**School Resource Officer/Sheriff's Deputy, Soldier, Legislator, Teacher, Minister, community service volunteer, engineer/conductor J&S Express Horse Heaven Hills Kiwanis Club Railroad.\n\n**Statement  \n**Public Safety, Constitutional Rights, Strong Military, Education, Secure Borders, Legal Immigration. \"One Nation Under God, In God We Trust!\" Free Enterprise/Free market, business and agricultural growth/prosperity, family wage jobs. Too many Governor proclamations and regulations have stifled/strangled prosperity for employers/employees. Limit Governor proclamations, bureaucracy and regulations. Fiscally responsible and accountable government. Pro-nuclear energy. Hydro-electric dams Vital, Hydro-electric power Renewable. Excellent, affordable health care balanced with public safety and fiscal responsibility: not socialized medicine.\n\nMutual goals: prosperity, security, responsibility, accountability, education, health care. Working together we can achieve/exceed our mutual goals!",
  "twitter": "https://twitter.com/BradKlippert",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=866#/candidates/60476/1532994",
  "lettersyes": "[Brad Klippert’s endorsement page](https://www.bradklippert.net/copy-of-endorsements-1)",
  "website": "http://bradklippert.net",
  "image": "/images/candidates/brad-klippert.jpeg",
  "uuid": "KLIPB  336",
  "office": "State Representative",
  "email": "brad@bradklippert.net",
  "engagement": "- ✅ tricitiesvote.com A/B 🎉\n- ✅ [NWPB/LWV Debate](https://www.nwpb.org/2020/10/01/icymi-watch-night-two-of-the-benton-franklin-counties-debate/)\n- ✅ [Vote for Business forum](https://www.youtube.com/watch?v=jbwV7COcGEk&feature=emb_logo)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=KLIPB  336&election_year=2020"
}