{
  "name": "Perry Dozier",
  "slug": "perry-dozier",
  "uuid": "DOZIP  361",
  "party": "Republican",
  "statement": "**Elected Experience**  \nWalla Walla County Commissioner 2009-2016 Chairman 3 years, Budget Committee 5 years; Washington; Association of Wheat Growers, Past President; Washington State Barley Commissioner; Northwest Grain Growers Board of Directors, Past President  \n  \n**Other Professional Experience**  \nOwner/Operator dryland and irrigated farming operation ; Planning Commissioner  \nGreater Behavioral Health Board; Aging and Long Term Care Board, WorkSource Walla Walla Board, Workforce Development Council, Snake River Salmon Recovery Board, Valley Transit Board, Walla Walla Watershed Partnership Board. Walla Walla Fair Interim Manager  \n  \n**Education**  \nWhitman College BA Economics  \n  \n**Community Service**  \nWashington Association of Wheat Growers, Presbyterian Church, Walla Walla County GOP, Waitsburg Historical Society, Fort Walla Walla Museum  \n  \n**Statement**  \nPerry Dozier, a life-long resident of Legislative District 16 and married for 39 years with two grown sons, is committed to creating a better future for our communities.  \n  \nPerry’s political experience spans 20 years and includes testifying before the United States Senate regarding road, river and rail transportation as well as the United States House Agriculture Committee on farm bill policies.  \n  \nPerry’s diverse professional experiences and leadership roles, both locally and statewide, bring an in-depth perspective to representing the people of District 16. _“As a former County Commissioner responsible for preparing the county budget, I have experienced first-hand how laws from Olympia impact our local communities. I have dealt with an economy in recession. I know how to work with elected officials to reach a favorable outcome.”_ Perry’s leadership experience, communication skills, and fiscal knowledge will be beneficial in Olympia representing our ideals and way of life in Eastern Washington.  \n  \nPerry is an advocate for K-12, vocational-tech and higher education. He will work to limit taxes and regulation on businesses which will allow job creation. Perry will promote personal property and water rights including conservation of natural resources. He will work to protect your 2nd amendment rights.",
  "electionyear": "2020",
  "office": "State Senator",
  "website": "http://www.dozierforsenate.com",
  "email": "dozierforsenate@outlook.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57346/68150",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=DOZIP  361&election_year=2020",
  "image": "/images/candidates/perry-dozier-original.png"
}