{
  "party": "",
  "name": "Doug McKinley",
  "slug": "doug-mckinley",
  "donors": "Reported raised $35,153.95",
  "pdc": "https://www.fec.gov/data/candidate/H6WA04141/?cycle=2020",
  "statement": "**Elected Experience**  \nBenton County Democratic Party State Committeeman, 2016  \n  \n**Other Professional Experience**  \nI have been an attorney for almost 30 years, working to protect for the rights of working people in the state and federal courts. I have taken on all kinds of cases, big and small, always putting my client's needs first. I have also spent more than 10 years teaching business law and corporate finance at Washington State University, Tri-Cities.  \n  \n**Education**  \nBachelor of Science, University of Utah, 1987; Masters of Business Administration, University of Utah, 1989; Juris Doctorate, Willamette University, 1991.  \n  \n**Community Service**  \n14 years Board Member, City of Richland, Board of Adjustment.  \n  \n**Statement**  \nIn 1929 our nation was plunged into an unprecedented economic depression under a Republican president, Herbert Hoover, who did nothing to end Americans' suffering. In 1932, Americans overwhelmingly elected Franklin Roosevelt to the White House. President Roosevelt promised bold plans to put Americans back to work, and he followed through on those plans. Roosevelt put thousands to work building the dams on the Columbia River that still power Central Washington's economy. Roosevelt also put Social Security in place, providing millions of seniors a dependable income that continues to this day.  \n  \nRepublicans called those programs “socialism,” but the American people saw them for what they were; putting the needs of people first. Today, we face a new economic crisis that again calls for big, bold actions by the federal government. But just as they did in 1932, Dan Newhouse and Donald Trump are calling these actions “socialism.” They were wrong in 1932, they are wrong today.  \n  \nWe need to put Americans back to work, and we need to create the right incentives so that American workers get a bigger piece of the economic pie that they create. We need a basic level of health-care for every American that is affordable, and that isn't tied to a job. We need to make college affordable. We need immigration reform that keeps families together, with a pathway to citizenship for hard-working, tax-paying, law-abiding immigrants. We need to transition to clean energy.\n\nWe have a choice. We can continue to follow Dan Newhouse and Donald Trump down the same path that, today and in 1929, led to massive unemployment and a crippled economy, or we can choose a new path. Please support me with your vote to put Americans back to work so we can build a better, more prosperous America.",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=866#/candidates/60262/1532734",
  "lettersyes": "[Jack Edwards](https://www.tri-cityherald.com/opinion/letters-to-the-editor/article244616532.html?utm_campaign=Tri-Cities%20Daily&utm_medium=email&utm_source=Revue%20newsletter), [Lillian “Randy” Slovic](https://www.tri-cityherald.com/opinion/letters-to-the-editor/article246569093.html)",
  "website": "https://dougmckinley2020.com/",
  "image": "/images/candidates/doug-mckinley-original.png",
  "uuid": "MCKINLEY",
  "office": "",
  "email": "doug@mckinleylaw.com",
  "articles": "[Tri-City Herald Editorial Board interview (at the top of the article)](https://www.tri-cityherald.com/opinion/editorials/article246436145.html), [Newhouse faces familiar foe in McKinley](https://www.spokesman.com/stories/2020/sep/24/newhouse-faces-familiar-foe-in-mckinley-for-4th-co/)",
  "engagement": "- ✅ tricitiesvote.com\n- ✅ [Vote for Business](https://www.youtube.com/watch?v=hFKAlIYClhg&feature=emb_logo)\n- ✅ [Power 99.1 voter education (July 24)](https://www.facebook.com/Power99.1/videos/2749652061936441)",
  "pdc_url": ""
}