{
  "name": "Sharon Brown",
  "slug": "sharon-brown",
  "website": "http://sharonbrownforjudge.com",
  "email": "lchilders2b@charter.net",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=866#/candidates/60303/1532762",
  "image": "/images/candidates/sharon-brown.jpeg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BROWS  337&election_year=2020",
  "uuid": "BROWS  337",
  "party": "Non Partisan",
  "statement": "**Legal/Judicial Experience**  \nWA State Senate since 2013. (elected) Currently Senate Deputy Republican Leader,  \nPreviously Senate Vice-President Pro Tem, Member Statute and Laws Committee, Ranking member -Ways and Means Committee; Attorney, private practice-mergers, acquisitions, small business.  \n  \n**Other Professional Experience**  \nMayor Pro-Tem, City of Kennewick 2010 (elected to City Council)  \n  \n**Education**  \nJ.D. University of New Hampshire School of Law, Franklin Pierce Center for Intellectual Property, Certificate -Straus Institute for Dispute Resolution, Pepperdine University School of Law, BA Drew University  \n  \n**Community Service**  \nBoys and Girls Club Board; WSU Tri Cities Advisory Board; Visit Tri-Cities Board;  \nVolunteer for Domestic Violence Survivors, Anti-Human Trafficking, Suicide Prevention  \n  \n**Statement**  \nAs a business lawyer, a City Council member and Mayor Pro Tem, and finally as your State Senator for the past eight years, I have developed a broad and unique skill set to make me an outstanding judge. Since 2013 I have been creating, revising and establishing policy to become law, thus I understand the true meaning of the law, and how it should be applied. Additionally, as a trained mediator, I learned to be absolutely neutral with no bias towards one side or the other. My background as a business attorney facilitated my arguments against a proposed banking tax law that would create a burden for Washington’s small businesses. The law was ultimately struck down by the ruling of a Superior Court Judge. My judicial philosophy is to follow the law as written and to give the taxpayers a good return on their investment by having a strong work ethic. Through my eight years in the Legislature I have a rare 100% attendance record and have never missed a single vote. I pledge to dedicate that same level of effort as a Superior Court Judge for Benton and Franklin counties. I would be honored to receive your vote.",
  "electionyear": "2020",
  "office": "Superior Court Judge"
}