{
  "party": "Republican",
  "name": "Matt Boehnke",
  "slug": "matt-boehnke",
  "statement": "**Elected Experience**  \nState Legislator 2018-Present; Assistant Ranking on the Innovation, Technology & Economic Development Committee; Kennewick City Council 2016-2018  \n  \n  \n**Other Professional Experience**  \nCollege Professor, retired US Army Senior Officer; Owner Bravocon IT Services, Energy Northwest Cyber Security PM, USACE Contracting Officer  \n  \n**Education**  \nKamiakin High School, BA, Government, Eastern Washington University; MS, Aeronautical Science, Embry-Riddle Aeronautical University, Military education through Command & General Staff College.  \n  \n**Community Service**  \nAmerican Legion, Bethlehem Lutheran Church, Columbia Basin Veterans Coalition, National Rifle Association, Sunrise Rotarian, Tri-City Americans Billet Family, Veterans of Foreign Wars, Washington Education Association  \n  \n**Statement**  \nRep. Matt Boehnke is already a leader in Olympia, recognized for his expertise in technology and cyber security by both parties. Matt’s also the sort of leader who listens, works well with others, and he has a servant’s heart. In short, Matt is the kind of leader we need more of in government.  \n  \nWith our vote, Matt can continue working to promote higher education locally and statewide, because education and research create good jobs. Matt also wants to limit the size of government, especially the bureaucracy that stifles job growth. Matt’s approach to COVID-19 is to safely reopen our economy.",
  "twitter": "https://twitter.com/boehnke4house",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=866#/candidates/60477/1532996",
  "lettersyes": "[Matt Boehnke’s endorsement page](https://www.electmattboehnke.us/endorsements.html)",
  "website": "http://www.electmattboehnke.us",
  "image": "/images/candidates/matt-boehnke.jpeg",
  "uuid": "BOEHM  336",
  "office": "State Representative",
  "email": "voteboehnke4house@gmail.com",
  "articles": "- [Matt Boehnke faces challenger Larry Stanley, who’s focused on economic class disparity](https://www.tri-cityherald.com/news/politics-government/election/article246303600.html?)",
  "engagement": "- ❌ tricitiesvote.com A/B\n- ✅ [Vote for Business forum](https://www.youtube.com/watch?v=KLdDrL28hVw&feature=emb_logo)\n",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BOEHM  336&election_year=2020"
}