{
  "name": "Matt Beaton",
  "slug": "matt-beaton",
  "uuid": "BEATM  301",
  "party": "Republican",
  "statement": "**Elected Experience**  \nFranklin County Auditor: Past 10 Years.\n\n**Other Professional Experience**  \nSage Appraisal Services Inc. Owned and operated. Completed over a billion dollars in valuation services in the Tri-Cities region appraising single family homes, mixed-use, land and small commercial properties.\n\n**Education**  \nBA in Business Administration, University of Washington: Certified Real Estate Appraiser Washington State 25 years; Real Estate Broker, Washington State Inactive 30 years.\n\n**Community Service  \n**Washington Coalition for Open Government: Board Member Pasco Kiwanis: Satellite Member, Lourdes Foundation Board: Past Member, Central Washington Catholic Foundation Board: Member, Relief Member: Pasco resident: 25 years. Married to Lisa for 22 years, 4 children, two still in Pasco Schools.\n\n**Statement**  \n“These are the times that try men’s souls” Those words were written by Thomas Paine in a pamphlet titled “Common Sense”. Its purpose was to inform and inspire the people to action during a trying time in our history when change was badly needed.\n\nI am Matt Beaton and I need your vote to deliver change in Franklin County. We need new leadership to improve county relationships, internally and with outside agencies. The past 10 years, I have been leading in Franklin County as your Elected County Auditor. In that time, the Auditor team has uncovered fraud, balanced budgets and have collaborated to improve accountability and transparency countywide.\n\nAs your County Commissioner I will listen, balance competing interest and build collaborative relationships internally and with other agencies. I am committed to the small government efficiency of Bi-County programs, desire to rebuild others and seek new ones. As local businesses work to recover from the economic shutdown, our County government will come alongside, assist and guide overwhelmed citizens that are just trying to build a home, create a business or just survive.\n\nAs your Commissioner I will continue to _earn_ your trust and work to deliver the government you deserve.",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "http://",
  "email": "mattbeaton@msn.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29027/45070",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BEATM  301&election_year=2020",
  "image": "/images/candidates/matt-beaton-original.png"
}