{
  "name": "Terry Ryan Cissne",
  "slug": "terry-ryan-cissne",
  "uuid": "terry-ryan-cissne",
  "party": "",
  "statement_html": "<p><strong>Elected Experience\n</strong><br />\nNo elected experience.\n</p>\n<p><strong>Other Professional Experience\n</strong><br />\nI have been self-employed my entire life with lots of ups and downs.  I am a very optimistic person.\n</p>\n<p><strong>Education</strong><br />\nI attended Big Bend Community College and Washington State University.\n</p>\n<p><strong>Community Service</strong>\n<br />\nI have volunteered as a youth football, basketball, wrestling, and baseball coach throughout the last several years.  I am the father of 5 amazing children.  Being a good husband and father has been my #1 priority. Thank you for your vote.\n</p>\n<p><strong>Statement\n</strong><br />\nMy name is Terry Cissne, and I am running for District 2 Franklin County Commissioner.  I have been a resident in Franklin County for 21 years.\n</p>\n<p>I married my High School sweetheart, Diana, who has been working for the Pasco School District since 2000. We are blessed with 5 very active and healthy children.  Our daughter Samantha 20, our sons Riley 18, Tayten 12, and Cooper 10, and daughter Paige 7.\n</p>\n<p>I am committed to Franklin County and have a fundamentally sound agricultural background and feel that I share similar aspirations with the people who reside within our district. I know that with my commitment and knowledge I can continue the work that best helps our district sustain its progress while continuing to grow. I am a voice for, &ldquo;smart growth and lower taxes&rdquo;.  I will stand up for what is right.  I will get results for the people I represent.  I am not a politician, I just want the tax money we all pay to go to what we as voters intended. &ldquo;Not robbing Peter to pay Paul.&rdquo;  I humbly and respectfully ask for your vote as Commissioner of Franklin County District 2. Thank you for your support!</p>",
  "electionyear": "2020",
  "office": "",
  "website": "",
  "email": "terrycissne@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29028/72042",
  "pdc_url": "",
  "image": "/images/candidates/terry-ryan-cissne-original.png",
  "pdc_filed": false
}