{
  "name": "Donnie Landsman",
  "slug": "donnie-landsman",
  "uuid": "LANDD  352",
  "party": "Republican",
  "statement_html": "<strong>Elected Experience:</strong> District 6105 Precinct Committee Officer, 2015-Present<br />\n<strong><br />\nOther Professional Experience: </strong>National Association of Parliamentarians- Present; BCRP By-Law Chairman 2017-18; BCRP Legislative District Chair 2015-16; ABATE of Washington Legislative Affairs Officer 2008-14.&nbsp; Candidate for Richland City Council 2015.&nbsp; Certified Airline Ramp and Operations Control Supervisor/Manager 1985-2005; Compliance Control Officer 2010-2014, Project Manager 2005-present.<br />\n<br />\n<strong>Education:</strong> Hanford High School 1981; International Air Academy 1985.<br />\n<br />\n<strong>Community Service:</strong> Bikers Collecting Coats; EPCC Teddy Bear Run; Olympia Toy Run; Food Drives; Volunteer Little League Coach; Youth Soccer Coach; 27 years Umpire<br />\n<br />\n<strong>Statement:</strong>&nbsp; Thank you for taking time to read my statement.&nbsp; Most importantly,&nbsp; I am asking that you take a few extra minutes to visit Donnie4Commmisioner.com before you mark your ballot.&nbsp; Especially in this election, I believe you owe it to yourself to know my latest position on issues.&nbsp;<br />\n<br />\nTransparency, Accountability and Leadership are all traits that we want from our elected officials.&nbsp; I believe that the County Commissioner District 1 representation has grown stagnant and is not in touch with the common citizen.&nbsp; As a whole, the commission no longer is representative of those that placed them in office.&nbsp; Decisions are being made without feasibility studies, cost analysis or public comment.&nbsp; In many cases, the issues are hidden in the agenda to be voted on openly and secretively at the same time.&nbsp; Effectively, the citizen has been marginalized.&nbsp;<br />\n<br />\nI entered this race because I am not a politician.&nbsp; I am an American Worker who believes we deserve better than career politicians running our county.&nbsp; Your vote is all that is needed to break the mold of a slick operator in a nice suit, or a long time elected official that has lost touch with the people.&nbsp;<br />\nIt Is time for change!<br />\n<div>&nbsp;</div>",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "Donnie4Commissioner.com",
  "email": "",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/44870",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LANDD  352&election_year=2020"
}