{
  "party": "Republican",
  "name": "Brad Peck",
  "slug": "brad-peck",
  "statement": "**Elected Experience**  \nFranklin County Commissioner 2009 to present; elected Chairman of the Board multiple times.  \n  \n**Other Professional Experience**  \nRetired U.S. Air Force officer. Desert Storm (Gulf War) veteran. Advisor to Air Force Chief of Staff (Pentagon). Squadron Commander. Served in multiple Middle East countries, the Pentagon, and throughout the U.S.  Managed multi-million dollar budgets leading teams of nearly 400 people. Multiple military awards and decorations. Five years experience working in nuclear power generation.  \n  \n**Education**  \nMaster of Science, Eastern Washington University.  Bachelor of Arts, Central Washington University. Extensive formal management and leadership training.  \n  \n**Community Service**  \nServe on more than 20 local and state Boards of Directors, and community committees.   \n  \n**Statement**  \nAs a highly experienced County Commissioner – and the only candidate with any Commissioner experience - I want to lead us through the present pandemic and major budget challenges in the coming years. I was honored to provide that same leadership during the 2011-2012 recession that we survived without raising taxes or eliminating essential services.  \n  \nContinuing my service will also avoid a new, inexperienced Board with a mere 24 months of total combined experience; making it one of the least experienced in the state.  \n  \nMy network of professional contacts extends to all 39 counties and numerous local and state agencies. Those cooperative relationships greatly strengthen our voice with the state legislature and improve our access to state and federal funding, which reduces local taxes.  \n  \nI strongly support quality education with schools funded by the entire community, without placing an unfair share on selected people or businesses.   \n  \nI believe in limited government, low taxes, individual accountability, and the premise that government’s primary responsibility is to help citizens succeed in their chosen endeavors, not regulate and tax those endeavors!  \n  \nMy wife Debra and I love Franklin County and spent the past 16 years faithfully restoring the Moore Mansion in Pasco.",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29027/42764",
  "website": "",
  "image": "/images/candidates/brad-peck.jpeg",
  "uuid": "PECKL  301",
  "office": "County Commissioner",
  "email": "lbp1958@gmail.com",
  "engagement": "- ✅ [League of Women Voters [questionnaire](https://vote411.org/ballot/whatever)\n- ❌ [League of Women Voters forum](https://youtube.com/something)\n- ❌ [Tumbleweird / Tri-Cities Daily questionnaire](https://tumbleweird.org/something)\n- ❌ [Power 99 candidate forum](http://youtube.com/something)\n- ✅ [Regional Chamber questionnaire](http://tcrchamber.com/whatever)\n\nTHIS IS TEST DATA AND MUST BE REPLACED",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=PECKL  301&election_year=2020"
}