{
  "party": "Democrat",
  "name": "Justin Raffa",
  "slug": "justin-raffa",
  "statement": "**Elected Experience**  \nChair, Richland Arts Commission, 2015-17  \nFirst Vice-Chair, Washington State Arts Commission, 2019-present   \n   \n**Other Professional Experience**  \nFormer experience: music substitute teacher with Richland School District, Minister of Music at All Saints' Episcopal Church in Richland, Orchestra Manager of the Mid-Columbia Symphony  \n  \nCurrent experience: Artistic Director of the Mid-Columbia Mastersingers, Chorusmaster of the Yakima Symphony Orchestra   \n **Education**  \nMaster of Music: The University of Arizona  \nBachelor of Music in Music Education: Westminster Choir College of Rider University, Princeton, NJ   \n  \n**Community Service**  \nFormer board service: Columbia Basin Badger Club, Richland Rotary Club, Arts Center Task Force  \nCurrent board service: Leadership Tri-Cities, Visit Tri-Cities, Northwest Region of American Choral Directors Association   \n   \n**Statement**  \nFor two decades, I've served as a leader in my industry with roles including departmental oversight, budget creation and management, and accountability to public stakeholders: all valuable experience for elected officials. With thoughtfulness, compassion, and integrity, I am ready to govern Benton County's efforts. As commissioner, I will endeavor to responsibly manage taxpayer dollars, dutifully administer the Public Safety Sales Tax while maintaining funding for our successful drug, mental health, and veterans' courts, increase public comment at meetings, employ solid governing principles in accordance with procedures, build bridges with neighboring jurisdictions for mutual development, and advocate for Hanford commuter safety.  \nJustin is a proud graduate of the Leadership Tri-Cities program Class XIX and successfully completed levels I, II, and III of the Rotary Leadership Institute. He served as a citizen participant on the Vista Vision Task Force with the Port of Kennewick regarding the redevelopment of Vista Field and on the Brand Implementation Leadership Team with Visit Tri-Cities, Tri-City Regional Chamber of Commerce, and TRIDEC. Justin has enjoyed emceeing fundraising galas for numerous local charitable organizations, including the Domestic Violence Services of Benton & Franklin Counties. He is a founding member of the Tri-City Civility Caucus.",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/76373",
  "lettersyes": "[Dorothy Gilmour](https://www.tri-cityherald.com/opinion/letters-to-the-editor/article244533892.html),",
  "website": "http://www.justinraffa.com",
  "image": "/images/candidates/justinraffa.jpg",
  "uuid": "RAFFJ--352",
  "office": "County Commissioner",
  "email": "info@justinraffa.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=RAFFJ--352&election_year=2020"
}