{
  "name": "Joe Lusignan",
  "slug": "joe-lusignan",
  "uuid": "LUSIJ--336",
  "party": "Republican",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience  \n**  \nYoung Marines Deputy Director 2014-2020; Benton County Sheriff’s Department (Retired) 1992-2014; United States Marine Corps 1983-1990.  \n  \n**Education  \n**  \nBachelor of Science in Liberal Arts from Excelsior College, New York  \n  \n**Community Service  \n**  \nPasco-Kennewick Rotary; 20 years as an adult volunteer for the Young Marines; River View High School Booster Club; Riverview High School Classroom Volunteer Instructor; National Young Marines Board of Directors; Washington Council of Police & Sheriffs Executive Board of Directors; 2nd Harvest Board of Directors; Volunteer Youth Soccer Coach; American Legion; Veteran of Foreign Wars; Fraternal Order of Police.  \n  \n**Statement  \n**  \nMy entire life has been dedicated to service and volunteerism with a focus on programs that strengthen the lives of our youth, serve, and honor our veterans, and enhance public safety efforts. I will serve Benton County full-time and provide the collaborative leadership that is needed to support our fast-growing community.  \nAs your Benton County Commissioner, I will continue my focus on public safety, youth, and our veterans. Specific priority areas will be: better stewardship and accountability of your Public Safety Sales Tax dollars – revenue critical to continuing the local fight against crime and criminal gang activity; improved transparency and accountability for Commission meetings and decision processes; strengthening partnerships with community stakeholders and other local government leadership; and supporting efforts that will improve our emergency mental health and drug addiction programs.   \nBenton County deserves a full-time leader. Not only am I 100% committed to the position, I will lead with integrity, transparency, and accountability. I will be available to the community and will work hard for you and with you.  \nThank you for your support!  \n  \n**Contact  \n**  \nWebsite: www.go4joe.us; email: jlusignan@usa.com; Facebook: Joe Lusignan for Benton Co Commissioner",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "http://",
  "email": "jlusignan@usa.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27187/45360",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LUSIJ--336&election_year=2020",
  "image": "/images/candidates/joe-lusignan-original.png"
}