{
  "name": "Will McKay",
  "slug": "will-mc-kay",
  "uuid": "MCKAW  337",
  "party": "Republican",
  "statement_html": "BIO:<br />\n<br />\nWill McKay moved from a dairy farm in Meridian, Idaho in 1996 and has lived in Benton County ever since. Will was heavily involved in school sports, leadership, scouting and church.&nbsp;<br />\n<br />\nWill graduated from BYU-Idaho in 2006 with a Bachelors in Construction Management and a Minor in Business Management. Since 2006, Will has been building and managing construction projects in the Tri-Cities, even starting his own business in 2013, W. McKay Construction.<br />\n<br />\nWill is married to his beautiful wife of 15 years, with 4 children who are students in the Kennewick school district.<br />\n<div>&nbsp;</div>\n<p>Statement:<br />\n<br />\nAs a business owner and long-time Benton County resident, I offer change to constituents by prioritizing economic prosperity, safety, and transparency.<br />\n<br />\nFirst, there needs to be better budgeting and fiscal responsibility in our county. I plan to leverage my background to bring efficiency and productivity to county operations. In particular, my experience in construction management uniquely positions me to bring more housing and economic opportunities to Benton County by working with the cities to progress our urban growth development initiatives. We must run this county as a successful business so all residents benefit.&nbsp;<br />\n<br />\nNow more than ever, resident safety is crucial. By better allocating the public safety tax, we can refocus on the current needs in the community. Our first responders deserve our best efforts.<br />\n<br />\nFinally, I value transparency for citizens and the surrounding cities and counties. I believe you are entitled to financial clarity so you always know how your contributions improve and protect your way of life. Similarly, I promise to be a responsive and dependable Commissioner with a door wide open to residents and their concerns.&nbsp;<br />\n<br />\nIf elected, I will bring economic prosperity, safety, and transparency to Benton County.</p>\n<div>&nbsp;</div>",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "",
  "email": "Will@wmckayconstruction.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27187/44815",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MCKAW  337&election_year=2020"
}