{
  "facebook": "https://www.facebook.com/Jennforthe9th",
  "party": "",
  "name": "Jenn Goulet",
  "slug": "jenn-goulet",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nOwner of Betwixt LLC performing contract instructional design services for Microsoft; former training specialist at HAMMER Federal Training Center; former technical writer for Department of Energy environmental cleanup efforts on the Hanford site; and member of the Board of Directors, Planned Parenthood of Greater Washington and North Idaho and of Planned Parenthood Advocates of Greater Washington and North Idaho  \n  \n**Education**  \nBachelor of Applied Science in Applied Management from Columbia Basin College; Associate of Arts in General Fine Arts from College of DuPage  \n  \n**Community Service**  \nCofounder and former President, Tri-City Freethinkers; former member of the Program and Marketing Committees, Columbia Basin Badger Club  \n  \n**Statement**  \nWe continue to face hardships across the nation and around the world. While some of us have fared better in Washington State than in other states, many of us are still struggling to make ends meet; many are afraid of what the future holds. We have felt the burden in our region; unemployed individuals; businesses that are shut down; businesses that are dealing with dramatically new ways of operating to keep their doors open. I lost work during April and May. As head of household, it was frightening!  \n  \nI’ve faced many financial hardships. I know what it is to struggle. I know what it is to be the recipient of help, and I wouldn’t be where I am today without it—a strong, successful woman ready to fight for others who need assistance. People and small businesses need help now more than ever before. Small businesses are the backbone of our community. I will fight for you to get a larger slice of the pie when it comes to state aid. I will fight for the unemployed and the essential workers. We’re all in this together. Honor me with your vote; I’ll fight to ensure no one gets left behind.",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57365/78297",
  "pdc_filed": false,
  "website": "http://www.jennforthe9th.com",
  "image": "/images/candidates/jenn-goulet.jpeg",
  "uuid": "jenn-goulet",
  "office": "",
  "email": "",
  "pdc_url": ""
}