{
  "facebook": "https://www.facebook.com/ElectMichaelAlvarez/",
  "party": "Republican",
  "name": "Michael Alvarez",
  "slug": "michael-alvarez",
  "statement": "**Elected Experience:**  \nRichland City Councilman, Review and approve a $250 million dollar plus city budget, Council Liaison Planning Commission, Economic Development, Code Enforcement, and much more.      \n  \n**Other Professional Experience:**  \nU.S. Marine Corp. Veteran, Business Owner mortgage company 25 years, Faculty, Master Instructor teaching Finance, Advanced Business Management, Consumer Protection and Code of Ethics to professional organizations throughout Washington.  Finance Officer U.S. Coast Guard Auxiliary Flotilla 85, VP funding development Boy Scouts of America Blue Mountain Council, Past President and Treasurer TCAR.          \n  \n**Education:**  \nBachelor of Business Administration NMSU       \n  \n**Community Service:**   \nCommissioner for Richland Parks and Recreation Commission, Fund Raiser Safe Harbor, National Child Identification Program, Community Service Award winner.      \n  \n**Statement:**  \nGovernments first duty is to protect the people, not run their lives.  Ronald Reagan      \n  \nBenton County will be facing some very difficult Economic and Financial challenges due to Covid19.  I am the only candidate that has the Education and Extensive Financial and Business Experience needed to help ensure that taxpayers money is being used and leveraged in the best possible way so that wasteful spending does not occur and taxes are not increased unnecessarily.     \n  \nA full review of the Public Safety Tax fund is critical.  I pledge to collaborate with city officials within the county to better utilize these funds to improve our public safety as the county continues to grow.  Since being elected to office I have a proven track record of saving taxpayers millions of dollars in taxes.  I’m a strong advocate for our youth, families, senior citizens, and veterans. I will continue to listen to the needs and concerns of our citizens.  My pledge is to be Present, Accountable, and Transparent to all citizens of Benton County.       \n  \nI have been married 31 years to my wife Gina, have two children, both graduates of Richland High and WSU!  We have called Benton County home for 28 years.",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/45558",
  "lettersyes": "[Michael Alvarez’s endorsement page](http://www.votemike.com/my-endorsments.html)",
  "website": "http://www.VoteMike.com",
  "image": "/images/candidates/michael-alvarez.jpeg",
  "uuid": "ALVAM  352",
  "office": "County Commissioner",
  "email": "mike@votemike.com",
  "engagement": "- ✅ [LWV Q&A](https://onyourballot.vote411.org/race-detail.do?id=22148902)\n- ✅ [LWV forum](https://www.youtube.com/watch?v=Ka2SQGd-hM0&list=PL6pHcbVJ2q0HU2oIXL8rpnUZz-1E2nEOh&index=7)\n- ❌ Tumbleweird Q&A\n- ❌ Power 99 forum\n- ✅ [TCRC Q&A](https://www.tricityregionalchamber.com/voteforbusiness.html#written)\n- ✅ [TCRC video](\nhttps://youtu.be/ZhAOhAZ1fTg)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=ALVAM  352&election_year=2020"
}