{
  "name": "Kim Lehrman",
  "slug": "kim-lehrman",
  "uuid": "LEHRK--302",
  "party": "Democrat",
  "statement_html": "<strong>Elected Experience</strong><br />\nNo information submitted.<br />\n<br />\n<strong>Other Professional Experience</strong><br />\n<p style=\"margin-top:0in;margin-right:0in;margin-bottom:12.0pt;margin-left:\n0in;background:white;\"><span style=\"color: #222222;\">Agriculture Educator and FFA\nAdvisor, 2000-2013. Taught Agriculture Science, Horticulture, Floriculture and\nWelding. Award recipient as Ag. Educator at building, district and state\nlevels. Started Chiawana High School's FFA Chapter and Floral Shop 2009. Custom\nswathing, baling, and hay stacking 1984-2002.</span></p>\n<strong>Education</strong><br />\n<p style=\"margin-top:0in;margin-right:0in;margin-bottom:12.0pt;margin-left:\n0in;background:white;\"><span style=\"color: #222222;\">Kamiakin High graduate.\nBachelors Degree, General Agriculture Science with a teaching certificate,\nMinor in Public Relations Washington State University-Pullman, 2000. Masters in\nEducational Leadership, Washington State University-Tri-Cities, 2006.</span></p>\n<strong>Community Service</strong><br />\n<p style=\"margin-top:0in;margin-right:0in;margin-bottom:12.0pt;margin-left:\n0in;background:white;\"><span style=\"color: #222222;\">Coached youth soccer and\nbasketball for 10 seasons, PTO member and ATP Parent Chair, Pro-bond and Levy\ncampaign member; Title 1 School Conference representative; PSD Community\nBuilders; iMPACT! Compassion Center mentor.</span></p>\n<strong>Statement</strong><br />\nIn an era of divisive politics, it&rsquo;s important to focus on the cooperative spirit and common-sense values that make Franklin County a wonderful place. I&rsquo;m running because my strengths are listening and building bridges over divides. I learned these values while growing up on our family&rsquo;s alfalfa farm.<br />\n<br />\nAs commissioner, I&rsquo;ll focus on transparency, collaboration, and innovation. Families are struggling more than ever with mental health during COVID-19. The county commission, working with the Sheriff's Office, should be offering greater crisis support services including an App where individuals can report unsafe situations and additional mental health services in partnership with Benton County. We need economic relief for small businesses and a shared smart urban growth criteria with our local city governments. This isn&rsquo;t the time to rely on broken relationships between commissioners and local residents, and economic and health policy experts. We need collaboration to create innovative ideas and partnerships to save our county. This means engaging with our agriculturists, business owners, and residents about what families and businesses need to recover and thrive.<br />\n<br />\nAs a former agriculture educator/FFA Advisor, proud mother, and active community member, I&rsquo;ll be a commissioner who <em>leads through listening</em>. Vote Kim Lehrman!<br />",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "www.electkimlehrman.com",
  "email": "electkimlehrman@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29027/44823",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LEHRK--302&election_year=2020"
}