{
  "name": "Shawn P. Sant",
  "slug": "shawn-p-sant",
  "uuid": "SANTS  301",
  "party": "Non Partisan",
  "statement": "**Legal/Judicial Experience**  \nFranklin County Prosecuting Attorney (2011-Present); President, Washington Association of Prosecuting Attorneys (2020); Associate Attorney, Mendoza Law Office (2006-2010); Public Defender in Benton, Franklin, and Grant Counties (2007-2010); Deputy Prosecuting Attorney, Franklin County (2004-2006)\n\n**Other Professional Experience**  \nVehicle Operations Specialist, US Air Force; Police Officer, Prosser PD; Reserve Police Officer, Richland PD  \n  \n**Education**  \nUniversity of Idaho, College of Law (J.D.); Chapman University (B.A. Criminal Justice); Community College of the Air Force (A.A.S. Transportation); Columbia Basin College (A.A.S. Criminal Justice)  \n  \n**Community Service**  \nPasco Kiwanis Club; Tri-Cities Hispanic Chamber of Commerce; Boy Scouts Merit Badge Counselor; Mock Interviews at local high schools  \n  \n**Statement**  \nThe criminal justice system touches each of us personally, even if we never set foot in a courtroom. Protecting the rights of all people requires judges with broad, hands-on experience who are committed to the fair and impartial application of our laws. My commitment to those principles comes from a dedicated career seeking justice for all, and spending countless hours with families of murder victims, parents who have lost children to crime, drugs, or suicide, and others impacted by various civil and criminal challenges.\n\nAs a veteran, I recognize the important role of veteran and other therapeutic courts. These courts and mental health services support people experiencing crisis and promote safer communities.\n\nAs the Franklin County Prosecuting Attorney, I lead one of the largest legal departments in our community. I have evaluated thousands of civil and criminal legal matters over my 22 years as prosecutor, public defender, and police officer. My significant trial experience, both prosecuting and defending, makes me the ideal candidate for judge.\n\nI hope I have earned your trust to do the right thing even when it may be difficult. I will continue to lead with honor and integrity as your next Superior Court Judge!",
  "electionyear": "2020",
  "office": "Superior Court Judge",
  "website": "http://www.santforjudge.com",
  "email": "shawn@santforjudge.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/44824",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=SANTS  301&election_year=2020",
  "image": "/images/candidates/shawn-p-sant.jpeg"
}