{
  "name": "Joe Schmick",
  "slug": "joe-schmick",
  "uuid": "LUSIJ--336",
  "party": "Republican",
  "statement": "**Elected Experience**  \n\nServed the 9th District since December 2007\n\n**Other Professional Experience**  \nWashington Farm Bureau Board of Directors, Washington Barley Commission, Washington Agriculture and Forestry Education Foundation Class 14  \n  \n**Education**  \nBA in Accounting and minor in Economics from EWU  \n  \n**Community Service**  \nFood bank volunteer.  Coached Little League for nine years  \n  \n**Statement**  \nAs a former second-generation farmer and small business owner, Joe Schmick understands the importance of hard work, dedication, perseverance  and takes these values to Olympia.  He continues to focus on four key areas.  Jobs-small businesses need to have a pathway forward to survive Covid-19.  Healthcare-we need to protect the patient and control the increasing costs of healthcare.  Education-a good education is vital to providing a ready workforce and creating individual opportunites.  Protecting property rights-we can enhance the enviroment while respecting and protecting property rights at the same time.",
  "statement_html": "<strong>Elected Experience</strong><br />\n<p>Served the 9th District since December 2007</p>\n<strong>Other Professional Experience</strong><br />\nWashington Farm Bureau Board of Directors, Washington Barley Commission, Washington Agriculture and Forestry Education Foundation Class 14<br />\n<br />\n<strong>Education</strong><br />\nBA in Accounting and minor in Economics from EWU<br />\n<br />\n<strong>Community Service</strong><br />\nFood bank volunteer.&nbsp; Coached Little League for nine years<br />\n<br />\n<strong>Statement</strong><br />\nAs a former second-generation farmer and small business owner, Joe Schmick understands the importance of hard work, dedication, perseverance&nbsp; and takes these values to Olympia.&nbsp; He continues to focus on four key areas.&nbsp; Jobs-small businesses need to have a pathway forward to survive Covid-19.&nbsp; Healthcare-we need to protect the patient and control the increasing costs of healthcare.&nbsp; Education-a good education is vital to providing a ready workforce and creating individual opportunites.&nbsp; Protecting property rights-we can enhance the enviroment while respecting and protecting property rights at the same time. &nbsp;",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "http://www.joeschmick.com",
  "email": "",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57340/44940",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LUSIJ--336&election_year=2020",
  "image": "/images/candidates/joe-schmick-original.png"
}