{
  "facebook": "https://www.facebook.com/electjeromedelvin/",
  "party": "Republican",
  "name": "Jerome Delvin",
  "slug": "jerome-delvin",
  "statement": "Jerome Delvin is running for re-election as Benton County Commissioner. He has served as a Republican member of the Washington State Senate, where he has represented Benton County as part of the 8th District since his appointment in 2004. Prior to that, Delvin served in the Washington State House of Representatives from 1994 to 2004. Delvin served for over 30 years as a police officer, first with the U.S. Army and then with the Richland Police Department. He earned his AS in Criminal Justice and an AA in Literature from Columbia Basin College. Delvin is married to his wife, Josie. \n\nRepublican Jerome Delvin believes that Benton County is a great place to live, work and play, but by working together, we can make it even better. Benton County faces many of the same challenges that Jerome Delvin has dealt with successfully at the state level – on issues such as water, agriculture, energy, and land use. As a member of the state legislature for more than 18 years, Delvin has used his experience and proven leadership abilities to find solutions to these challenges both locally and state-wide. As your county commissioner, Jerome Delvin’s priorities will be supporting county services vital to the citizens through a balanced and sustainable budget. He will also continue to develop and promote a friendly business climate, which is necessary for continued job growth. And like you, Delvin believes that it is crucial that government at all levels respect the rights of property owners and keep property taxes as low as possible. As a lifelong resident of Benton County, Delvin knows the issues important to our area. He shares our values. Working for you, he will continue to make a difference as a county commissioner. Vote Jerome Delvin for Benton County Commissioner.",
  "electionyear": "2020",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=866#/candidates/60197/1532617",
  "lettersyes": "[BE Beldin](https://www.tri-cityherald.com/opinion/letters-to-the-editor/article244453512.html), [W. Kent Madsen](https://www.tri-cityherald.com/opinion/letters-to-the-editor/article244318887.html), [Shirley Simmons](https://www.tri-cityherald.com/opinion/letters-to-the-editor/article246514450.html), [Jerome Delvin’s endorsement page](https://jeromedelvin.com/endorsements/)",
  "website": "https://jeromedelvin.com/",
  "image": "/images/candidates/jerome-delvin.jpeg",
  "uuid": "DELVJ  352",
  "office": "County Commissioner",
  "email": "",
  "articles": "[Tri-City Herald Editorial Board interview (at the top of the article)](https://www.tri-cityherald.com/opinion/editorials/article246491405.html)",
  "engagement": "* ✅ tricitiesvote.com\n* ✅ [LWV Q&A](https://onyourballot.vote411.org/race-detail.do?id=22148902)\n* ✅ [LWV forum](https://www.youtube.com/watch?v=Ka2SQGd-hM0&list=PL6pHcbVJ2q0HU2oIXL8rpnUZz-1E2nEOh&index=7)\n* ❌ TW primary Q&A\n* ✳️ [Power 99 forum](https://www.facebook.com/watch/live/?v=2749652061936441&ref=watch_permalink) \n* ✅ [TCRC Q&A](https://www.tricityregionalchamber.com/voteforbusiness.html#written)\n* ✅ [TCRC video](https://youtu.be/ZhAOhAZ1fTg)\n* ✅ [LWV Debate](https://www.nwpb.org/2020/09/30/icymi-watch-night-one-of-the-benton-franklin-counties-debate/)\n* ✅ [Vote for Business](https://www.youtube.com/watch?v=7nMTtnTrNpU&feature=emb_logo)\n* ✅ [Tri-City Herald voter guide](https://www.tri-cityherald.com/news/politics-government/election/voter-guide)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=DELVJ  352&election_year=2020"
}