{
  "name": "Ana Ruiz Peralta",
  "slug": "ana-ruiz-peralta",
  "uuid": "PERAA--301",
  "party": "Democrat",
  "statement_html": "<p><strong>Elected Experience\n</strong><br />\nNo information submitted.\n</p>\n<p><strong>Other Professional Experience</strong>\n<br />\nInterpreter &amp; QI Monitor - Pacific Interpreters 1999 -2012, New York Life Agent 2012- 2018,  Tri-Cities Community Health - Current Board Chair 2012 &ndash; Present, DPDA Board Member 2014-2016, Negotiator for City of Pasco- Colima Friendship Agreement, Somos Pasco Economic Development Strategic Vision- Executive Committee member 2016, Commissioner - Washington State Commission on Hispanic Affairs 2013- 2015,  Graduate of Leadership Tri-Cities Class XVIII, Tri-Cities Regional Chamber of Commerce -Young ATHENA Award Recipient 2016.\n</p>\n<p><strong>Education</strong>\n<br />\nNo information submitted.\n</p>\n<p><strong>Community Service\n</strong><br />\nCo-Founder/Creator Pasco Taco Crawl, Former Mid-Columbia Mastersingers Board Member, Former Columbia Basin Badger Club Board Member, Former United Way Board Member, Former Tri-Cities Regional Chamber Board Member.\n</p>\n<p><strong>Candidate Statement\n</strong><br />\nI&rsquo;m Ana Ruiz Peralta and I&rsquo;m asking for your vote to be your next Franklin County Commissioner. Franklin County has been the fastest growing county in the State of Washington for the last 20 consecutive years. My goals are to improve our overwhelmed and underfunded bi-county public health system as well as our juvenile justice system.\n</p>\n<p>I&rsquo;m running for Franklin County Commissioner because I believe It&rsquo;s the Moment for decisive leadership that&rsquo;s focused on smart growth policies that protect locally owned farms and I will work to create infrastructure for efficient internet connectivity for the county.\n</p>\n<p>I&rsquo;m proud to be raising my three amazing children in Franklin County. It is an attractive and welcoming community to everyone. I chose to live in here because of the quality of the education system in place and the economic growth opportunities.\n</p>\n<p>I will be an inclusive servant-leader to Franklin County as I work on the expansion and access to Franklin County Commissioner meetings and I will advocate to provide interpretation services at said meetings. Lastly, I will work to improve relationships with the Benton County Commissioners through cooperation and collaboration on key bi-county issues that impact all residents.</p>",
  "electionyear": "2020",
  "office": "County Commissioner",
  "website": "electanaruiz.com",
  "email": "Communications@electanaruiz.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29028/42717",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=PERAA--301&election_year=2020"
}