{
  "party": "",
  "name": "Kurt H Maier",
  "slug": "kurt-h-maier",
  "statement": "**Biography**\n\nI am a United States Army veteran, a husband, a father of two, and I come from a military family (on both sides). I am a manager and supercomputing engineer; in the past I have been a systems administrator, an electrician, and an automotive technician. I've lived all over the country and settled in Richland in 2016. I have served on the Richland Public Library Board of Trustees since 2017 and am currently serving as its Chair.\n\n**Statement**\n\n  I believe in government service, and I believe that the 'service' part of that concept has been forgotten by too many. My approach to elected office is to listen to my neighbors and manage based on what people want from their city. I've never been a member of a political party, I believe in living within my means, and I believe in the values that made America the greatest country on Earth. I want Richland to be a place where anyone who shares those values can build a successful life.\n\nI believe that Richland is a wonderful city, and I think it deserves leadership that listens. If elected to City Council, I would take the same approach to leadership that I use at work -- find out directly from the source what people need to succeed, and work hard to make sure they get it. I believe that Richland deserves a city council focused on governing Richland; not on political party games, not on getting elected to higher offices, not on using the office as a platform to tell people what to think. If you agree, I look forward to working for you.\n\nWebsite: https://americanimperium.com Email: khm@americanimperium.com",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66312/1540565",
  "website": "https://americanimperium.com",
  "image": "/images/candidates/kurt-h-maier-original.png",
  "uuid": "MAIEK--354",
  "office": "City Council",
  "email": "khm@americanimperium.com",
  "pdc_url": ""
}