{
  "party": "",
  "name": "Steve Simmons",
  "slug": "steve-simmons",
  "statement": "**Elected Experience**  \nFranklin County Republican Precinct Committee Officer.\n\n**Other Professional Experience**  \nAvionics Technician; Electrician; Electrical/Mechanical Maintenance Planner.\n\n**Education**  \nKamiakin High School Graduate; Advanced Avionics & Electronics Trade School Graduate; NECA/IBEW Local 112 Inside Electrician Apprenticeship Graduate; Working toward a Bachelors in Project Management at Columbia Basin College.\n\n**Community Service  \n**Volunteer in various capacities at church; Coach children's sports teams; Volunteer at Second Harvest.\n\n**Statement  \n**I’m Steve Simmons. Raised in Kennewick our family has lived in Pasco for 13 years. Next year all four of our children will attend school in the Pasco School District, one of which is a special needs student. I have a vested interest in the educational success of our district. I attended trade schools to become an electrician and believe in educational pathways such as apprenticeships, technical career training, and college. This past year has highlighted the need for elected officials who represent us using facts, ethics, principles, and morals. I’m tired of standing on the sidelines while our children's future is decided for us. Ideology, trends, and virtue signaling tend to be more important than the bottom line - to provide basic education and guide career pathways according to the interests and desires of each of our children and their unique personalities, traits, and talents. As an elected school board member I pledge to be knowledgeable on the issues and use unbiased opinions, mature judgment, and my conscience in making rational decisions towards accomplishing the goals and upholding the laws of our district for the benefit of all faculty, parents, and students. For more information please go to stevesimmons4pascoschools.com.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68478/1542783",
  "website": "",
  "image": "/images/candidates/steve-simmons-original.png",
  "uuid": "SIMMS--301",
  "office": "Pasco School Board Pos 4",
  "email": "",
  "pdc_url": ""
}