{
  "party": "",
  "name": "Amy Phillips",
  "slug": "amy-phillips",
  "statement": "**Elected Experience**  \nPasco School Board of Directors: 2013-Present; Pasco School Board of Directors President: 2019-Present; Pasco School Board of Directors Vice President: 2017-2019.\n\n**Other Professional Experience**  \nSubstitute teacher and Long Term Sub: 2016-Present; Stay-at-home mom: 1996-Present; Small business owner and manager: 2015-Present; Acted as General Contractor for 5 houses: 2009-2015; Homeschool educator: 2011-2012, 2020-2021.\n\n**Education**  \nCollege: B.A. in Mathematics Education from Brigham Young University; High School: Connell High School.\n\n**Community Service**  \nVolunteered in the schools and ATP member at several schools: 2005-20015; Foster Parent to 13 children: 2002-2016; School Board Member: 2013-Present; Team Pasco Member: 2015-Present; \"JustServe\" representative for Franklin County: 2020-Present.\n\n**Statement  \n ** _Every_ student should meet their full potential. The 8 years I’ve served on the board have been spent supporting a college-ready culture while offering increasing numbers of pathways to career and technical education to successfully propel our students into their futures.\n\nChanges in our district that have been driven and supported by myself and our board include:\n\n_Student_ Achievement: Strategic plans with measurable outcomes; State of the School reviews at each school; Superior hiring practices; Academic excellence through effective professional learning committees; Policies to ensure regular curriculum review and replacement; Dual Language Program expansion enabling every child to graduate bi-lingual if desired; More nurses and counselors to support the whole child.\n\n_Transparency_: Accountability for levy dollars; Data dashboard for academic transparency; Tightening the budget and removing excesses.\n\n_Community Voice_: Community Forums; More opportunity to speak at board meetings; Live board meetings; Personal responses to every e-mail. This past year, 7 of our schools were recognized by Washington State for academic growth and excellence. My education background and my role as a parent of both special needs and highly capable students further enables me to insure excellence in our schools.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68477/1542784",
  "website": "",
  "image": "/images/candidates/amy-phillips-original.png",
  "uuid": "PHILA  301",
  "office": "Pasco School Board Pos 5",
  "email": "craignamy@hotmail.com",
  "engagement": "✅ [General Election Forum](https://youtu.be/ZjUR0Tqc1rs?t=2344)\n\n✅ [Vote 411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=24921413)\n\n✅ [Tri-City Herald Editorial Board Interview](https://www.tri-cityherald.com/latest-news/article254281883.html/video-embed)",
  "pdc_url": ""
}