{
  "party": "",
  "name": "Marianne Boring",
  "slug": "marianne-boring",
  "statement": "**Elected Experience**  \nChair, Vice Chair – Richland Planning Commission and Board of Adjustment  \n  \n  \n**Other Professional Experience**  \nRichland City Council - appointed 2020; Project Management, Land Use Planning and Commercial Leasing - 30+ years; Small Business Owner  \n  \n**Education**  \nUC Riverside, Land Use/Environmental Planning Certificate; Riverside Community College, Associates Degree; Fashion Institute of Design and Merchandising, Interior Design; Previous Certifications: Project Management, Concrete, Soil  \n  \n**Community Service**  \nRichland Board of Adjustment - 19+ years; Richland Planning Commission - 14+ years; _Charter Member_: 25+KiwaniansWhoCare; _Board Member_: Benton County Mosquito Control; _Volunteer_: Water Follies; 5th Grade Pacific Science Center overnight field trip; _Council Liaison_: Arts Commission, Code Enforcement Board, Benton County Solid Waste  \n  \n**Statement**  \nLeadership means shelving personal agendas, listening to everyone, and representing _all_ of Richland. During my many years of service on the City Planning Commission and Board of Adjustment, I learned to bridge divides to ensure that everyone has a seat at the table, and that’s how I will continue to lead while serving as your representative on the Richland City Council.  \n  \nI will continue to advocate for ensuring access to open spaces, promoting our vision for healthy and vibrant mixed-use developments for downtown and central Richland, prioritizing fiscal responsibility, proactively focusing on our economic recovery and supporting our community.  \n  \nI will work to ensure Richland is a resilient, dynamic, and a safe city of belonging with a common-sense mission for the future, that is both responsible and aimed at creating a thriving community.  \n  \nI am devoted to making our City a better place to live and work and I would be honored to earn your vote!",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66313/1540559",
  "website": "",
  "image": "/images/candidates/marianne-boring-original.png",
  "uuid": "BORIM--517",
  "office": "Richland City Council Pos 2",
  "email": "boring4richland@gmail.com",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/D3jq_TdcBB8?t=874)\n\n✅ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=24925480)\n\n✅ [Vote For Business Forum](https://youtu.be/gaN649mAp60?t=169)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BORIM--517&election_year=2021"
}