{
  "name": "Gabe Galbraith",
  "slug": "gabe-galbraith",
  "email": "gabe.galbraith@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68358/1540590",
  "image": "/images/candidates/gabe-galbraith-original.png",
  "pdc_url": "",
  "uuid": "GALBG--338",
  "party": "",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nUS Marine Corps, 2003-2007, (honorable discharge, disabled veteran); Retail Store Management, 2007-2014; Amazon Group Manager, 2014 – 2017; Kennewick School District Emergency Substitute Teacher, 2016-2018; Mission Support Alliance, 2018-2020; VA Claims Insider, 2020; Lourdes Health, 2021.  \n  \n**Education**  \nKamiakin HS, Kennewick, WA 2001; Strayer University with a B.A. in Accounting, 2007; Ashford University with an MBA focused on Human Resource Management, 2014; Grand Canyon University with a Masters in Elementary Education (Non-License), 2018.  \n  \n**Community Service**  \nCoached daughter in youth sports, team treasurer for soccer team, and actively involved in service opportunities through church and kids classrooms.  \n  \n**Statement**  \nThis past year, I have witnessed my kids struggle to learn because online instruction is not adequate. I have witnessed my wife, a KSD teacher, trying to teach students online, hybrid, and in class with ever changing guidelines!  \n  \nLike many of you, I have been frustrated with decisions our local leaders have made. Decisions that seemed made more in personal convictions, rather than what the science told us and with student and community support.  \n  \nI believe in open and honest communication between everyone involved in our children’s education including the teachers, parents, community, and school board.  \n  \nOur kids are the single greatest asset in the school district. The board has a responsibility to ensure a quality education for each student. This means making tough decisions, challenging the status quo, and collaborating with the right stakeholders while keeping the best interest of students in mind.  \n  \nExcept for a few years, I have been a lifelong Kennewick resident. I am eager to utilize my experiences as a community member, parent, and teacher’s spouse to provided invaluable insight and new perspectives to the school board.  \n  \nFor more information, please visit https://gabegalbraith.org/ or Facebook @gabe4ksd.",
  "electionyear": "2021",
  "office": "",
  "website": "https://gabegalbraith.org/"
}