{
  "party": "",
  "name": "Ken Stoker",
  "slug": "ken-stoker",
  "statement": "**Elected Experience**  \nI served four years on the West Richland City Council  \n  \n**Other Professional Experience**  \nPNNL: Six years as an Information Systems Analyst  \nMaster Data Center: Seventeen years as Database Technical Implementation Specialist  \n  \n**Education**  \nWSU graduate: Bachelor’s degree in Business Management, Information Systems, minor in Asian Studies with language studies in Japanese and Chinese.  \n  \n**Community Service**  \nCoaching  \nRichland Grid Kids Football (Assistant): 2008-09  \nGreater Richland Little League: 2005-06, 2008  \nTri-Cities Girls Fastpitch Softball Association: 2007-2019  \n  \nAmerican Cancer Society–Relay for Life Committee  \nBenton/Franklin County Advocacy Chair: 2001-2006  \nFranklin County Online Chair: 2007-2013  \n  \nBoy Scouts of America  \nScoutmaster: 2002-2006  \nVarsity Scout Advisor: 2010-2012  \nMerit Badge Counselor  \nEagle Scout: 1990  \n  \n**Statement**  \n\nI consider myself a “Constitutional Originalist” in philosophy when considering the proper role of government. I stand behind the principles that this country was founded on and am a true student of our Founding Fathers and their philosophies. It has been my honor to have served you previously as one of your City Council members.  \n  \nI believe in government that restricts itself to protecting the rights of every individual, including property rights. During my previous term, I fought for these rights throughout the city municipal code.  \n  \nI am an advocate for allowing our citizens more capacity to participate in our city government. When first elected, Councilman Smart and myself took a stance on having first and second readings of agenda items to give the citizens time to understand and provide input on those topics. We advocated for extending more time during public comment for citizens to be able to fully express their thoughts to the council. Recently, discussions have highlighted how some members of your council prefer to think of themselves and their time rather than be keenly interested in hearing what citizens have to say and this disturbs me.\n\nI would be honored to serve again.  \n  \nhttps://electstoker4wrcouncil.org/  \nhttps://www.facebook.com/KStoker4WRCityCouncil  \nvote4.kstoker@charter.net",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66317/1540529",
  "website": "https://electstoker4wrcouncil.org/",
  "image": "/images/candidates/ken-stoker-original.png",
  "uuid": "STOKK  353",
  "office": "City Council",
  "email": "ur.man@charter.net",
  "pdc_url": ""
}