{
  "party": "",
  "name": "Blanche Barajas",
  "slug": "blanche-barajas",
  "statement": "**Elected Experience**  \nMayor Pro-Tem Blanche Barajas was elected to serve the Pasco City Council starting January 2018 and elected Mayor Pro-Tem in 2020.\n\n**Other Professional Experience**  \nShe currently works for a Not-for-Profit managed care organization and helps those that lack health services.\n\n**Education**  \nBlanche holds a bachelor’s degree in Business Administration and an Associate in Applied Science in Criminal Justice.\n\n**Community Service**  \nBlanche Barajas has served as a volunteer, mentor and board member with different organizations throughout the Tri Cities.\n\n**Statement**  \nAs a Pasco resident and current elected official I am proud to continue serving as a city council member representing not only District 1, but also all of Pasco residents. I am regularly seen volunteering with community-base and faith-based organizations throughout the Tri Cities. As a volunteer for Pasco Areas Safe Community Organization-a group formed by PPD Citizen Academy alumni, I was one of the founders for P.A.S.C.O Hope Pantry. In 2018 I was awarded the Public Servant of the Year award and selected as 1 of 4 Inspiring Latinos for 2018 hosted by Tri Cities Latino Community Network. In my capacity as city council I am proud to say I was part of the workgroup that started the Inclusivity, Diversity and Equity Commission. I work in and for this community and always available to help where and when I can and my volunteer history reflects a small caption of that. I respectfully ask for your continued support to serve and advance our great community.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66435/1542788",
  "website": "",
  "image": "/images/candidates/blanche-barajas-original.png",
  "uuid": "BARAB  301",
  "office": "Pasco City Council Pos 1",
  "email": "barajasforpascod1@gmail.com",
  "pdc_url": ""
}