{
  "party": "",
  "name": "Jason Lohr",
  "slug": "jason-lohr",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nI am an Electrician and a member of IBEW Local 112 in Kennewick.   \n  \n**Education**  \nMMI-Phoenix Certified Early and Late Model Harley Davidson Technician, IBEW Local 112 Inside Wireman Apprenticeship, in the process of earning my degree in Applied Science from Columbia Basin College. Completed the Kennewick Citizens’ Academy training.   \n  \n**Community Service**  \nI serve on IBEW Local 112’s RENEW youth outreach and community service committee, Political Action Committee, and as a delegate to the Washington State Labor Council.  \n  \n**Statement**  \nWe need local government focused on local issues. Kennewick is growing rapidly, and we need housing to accommodate our growth. We need good local jobs that afford working people rewarding and healthy lives, and enough income to pay the bills and spend with our local businesses. As the world evolves around us, we must invest in the infrastructure that will sustain economic development and meet our community's needs—today and tomorrow.  \nAs your City Councilperson, I will work to ensure that all city building projects operate under local workforce agreements. I will vote to invest in the rebuilding and maintenance of our roads, parks, schools, and utilities. I will work to spur new housing construction that is affordable at all income levels.  \nI will get the job done. I’m ready to roll up my sleeves and get to work—for more jobs, increased wages, and a reduced burden on taxpayers. We’ll build toward a future with more reliable, more sustainable, and lower-cost utilities, happier and healthier children, and increased investment from businesses in our community.  \nI’ve made a career in construction. Together, we will build a community where our friends and families thrive. Let’s build a better Kennewick together.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66324/1540547",
  "website": "http://www.jasonlohrforkennewick.com",
  "image": "/images/candidates/jason-lohr-original.png",
  "uuid": "LOHRJ--336",
  "office": "Kennewick City Council Pos 3",
  "email": "jasonlohr86@gmail.com",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/bMNFwKgZC40?t=1142)\n\n✅ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=24925422)\n\n✅ [Vote For Business Forum](https://youtu.be/Qts5VFbagaI?t=154)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LOHRJ--336&election_year=2021"
}