{
  "name": "John E. Smart",
  "slug": "john-e-smart",
  "email": "jsmart400@aol.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66318/1540527",
  "image": "/images/candidates/john-e-smart-original.png",
  "pdc_url": "",
  "uuid": "SMARJ  353",
  "party": "",
  "statement": "**Elected Experience:** John will complete his sixth year as a member of the West Richland City Council in December 2021.\n\n**Professional Experience:** Senior Research Engineer with over 19 years of project management experience.\n\n**Education:** Bachelor's degree from WSU\n\n**Community Service:** John has served over 14 years as Activity Director and Unit Leader for American Heritage Girls Troup WA3130 scouting organization.  John has been a participant in the Veterans Day Parade; past helper with the Walk for Life, and earned his Eagle Scout Award in 1980.\n\n**Candidate Statement:** Please visit SMART4WR.org - Thank you for electing me to serve on the West Richland city council.  I am committed to continue representing conservative fiscal policy that protects our taxpayers now and into the future.  I will promote open communication, full disclosure of reasoning, and will encourage the council to listen carefully to the opinions and expressions of our residents.  I am not a closet socialist - but rather a defender of our constitution and our God given rights.  Business growth in West Richland is critical - but we need to preserve the unique rural character and our \"low density\" environment for which we are known.  When asked what I want our town to look like - I say I want it to look like Freedom!  Having built and lived in a West Richland home for 26 years, my wife, three children, and I truly appreciate the peaceful quality of life that our city has to offer.  Fiscal responsibility, well planned growth, sensible ordinances, and the preservation of our residential/rural lifestyle will help West Richland prosper and remain this region's most preferred place to call home.  Please visit SMART4WR.org.",
  "electionyear": "2021",
  "office": "",
  "website": ""
}