{
  "party": "",
  "name": "Steven Davis",
  "slug": "steven-davis",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nAssistant Director of Transit Operations for Ben Franklin Transit. Experience with Federal, State, and Local revenue sources, The Americans with Disabilities Act, and Title VI, The Civil Rights Act.  \n  \n**Education**  \nGraduated from Columbia Basin College with an Associates of Science Degree. Currently pursuing a B.A. in Business Management.  \n  \n**Community Service**  \nAdvisory Board Member and supporter of the Richland School District Work Base Learning Program, community event volunteer and supporter for the Special Olympics and ARC of the Tri-Cities.  \n  \n**Statement**  \n\nFor the past 7 years, I’ve had the privilege of living in West Richland with my wife and 3 children. Like many of us in the community, my family was drawn to the serene surroundings of the city.\n\nMy fondness for our community has led me to want to serve as a councilmember where I hope to continue to better our city. The ongoing water problem is a source of much contention. What started as a conversation with neighbors has become a call for action. The cause of the foul water smell and discoloring needs to be permanently addressed. I’m passionate about resolving the water concerns as well as continuing the economic growth and development, creating additional outdoor entertainment, revitalizing downtown, investing in future infrastructure, and supporting emergency services/personnel and educational facilities.  \n  \nMy candidacy will represent a shared voice, a collaboration of the community working together. My leadership experience, commitment to progress, and investment in our community makes me the ideal candidate. I look forward to working with the other city councilmembers, and the members of our community, to continue to make West Richland the most admired city in the Columbia Basin.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66318/1540528",
  "website": "",
  "image": "/images/candidates/steven-davis-original.png",
  "uuid": "DAVIS--161",
  "office": "West Richland City Council Pos 1",
  "email": "davis.sr12@gmail.com",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/3tJNKJ6-Zoo?t=1969)\n\n❌ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=25059144)\n\n✅ [Vote For Business Forum](https://youtu.be/TyKWS_55Q98?t=170)",
  "pdc_url": ""
}