{
  "party": "",
  "name": "Micah Valentine",
  "slug": "micah-valentine",
  "statement": "**Elected Experience**  \n\nThis will be my first elected position. \n\nI'm excited to serve the community!\n\n  \n  \n**Other Professional Experience**  \nEagle Scout, Varsity Scout Coach, Scoutmaster, Cubmaster; LDS Mission in El Salvador, Sales and Marketing Manager Pro Roofing NW Inc.; National Director of Client Acquisition for Social Rocketship; Washington State Area Rep for Complete Merchant Solutions; Owner Ascend, LLC; Owner Ramp, LLC  \n  \n**Education**  \nElma HS, Elma, WA 1997; Clark College; Southern Virginia University B.A. Business Management & Spanish  \n  \n**Community Service**  \nCoach Soccer: Southridge HS, Elma HS, Leota MS, Lake Washington Premier FC, 3 Rivers SC, actively engaged in many youth programs for the community and church.  \n  \n**Statement**  \n\nVote Valentine! - Giving a voice to kids, parents, and teachers who want full time-in person learning.\n\nWe live in the greatest country in the world.  Our country is wonderfully unique.  We are under attack and anti-American ideas are infiltrating our schools.  Ideas such as the new Sex-Ed bill (R-90) and Critical Race Theory aim to destroy our core family values.\n\nI have 4 daughters in the KSD; Elementary, Middle, and High Schools.  I will fight for and promote core learning (reading, writing, and arithmetic).  No Mask Mandates!  Critical Race Theory and dangerous sex education should never be taught in our schools.  Our kids should be playing sports and seeing each other’s faces. \n\nOur school board’s current policies do not represent the majority of local families.  We need strong leadership, a balanced perspective, and the bravery to fight for things we believe in. Our kids should have never lost a year of school.  The damage from the solution was far greater than the virus. We have some crucial bonds, levies, and referendums coming up.  Do you trust current leadership?  Do you trust their decision making again? If not, Vote Valentine!\n\nVisit: [www.micahvalentine.us](https://gcc02.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.micahvalentine.us%2F&data=04%7C01%7Ccandidateinfo%40co.benton.wa.us%7C2edeb240697643bda29a08d9206b460a%7Cc05d225d762f47cbab948fdea11b5ad7%7C0%7C0%7C637576467398757588%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=INfBIukyOeTWdpcaefUp3KW9J8k1doOcMCPGzX2Qj8g%3D&reserved=0)",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68357/1540588",
  "website": "http://www.micahvalentine.us",
  "image": "/images/candidates/micah-valentine-original.png",
  "uuid": "VALEM--338",
  "office": "School Board",
  "email": "",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=VALEM--338&election_year=2021"
}