{
  "name": "Rick Jansons",
  "slug": "rick-jansons",
  "email": "rickjansons@msn.com",
  "pamphlet_url": "https://voter.votewa.gov/GenericVoterGuide.aspx?e=871&c=03#/candidates/68366/1540599",
  "image": "/images/candidates/rick-jansons-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=JANSR%20%20352&election_year=2021",
  "uuid": "JANSR  352",
  "party": "",
  "statement": "**Elected Experience**\n\nRichland School Board 2001 to present. President of State School Directors Association.\n\n**Other Professional Experience**\n\nUS Navy Submarine Service Veteran, 22 years local business owner, and 36 years nuclear industry bargaining unit, supervisory and management experience.\n\n**Education**\n\nBA: Elementary and Special Education; US Navy Nuclear Power School and other military training; Western Washington University Emergency Management Cert., and nationally certified Radiation Protection Technologist.\n\n**Community Service**\n\nParent volunteer in schools, Leadership Tri-Cities Past-President, Washington Agriculture and Forestry Foundation leadership, Richland Public Facilities District Past-Board Member, Richland Rotary, Hanford Advisory Board leadership and active in his church.\n\nRick is married with 5 children and 5 grandchildren.\n\n**Statement**\n\nI am asking for your vote to help me continue to work to guide and improve our district. My mission is to ensure each child has the best education possible to reach their goals and dreams. My goal is to remove barriers, whatever they may be, that stand in the way of our students’ success.\n\nMy decisions have always been based on what’s best for students. I value community, high standards for our staff and students, equitable treatment for our students, and fiscal responsibility. I support family choice about their children’s education, and local decisions about curriculum. I will continue to work to ensure local control of schools, effective results, and accountability of your tax dollars! I will continue to fight against state and federal mandates that take away your voice in our schools! I will respectfully work with you and listen to you in providing the best education possible for our students.\n\nOur district led the way in safely re-opening our schools after the state shutdown. Let’s continue to work to improve our schools, and do what’s best for each and every one of our students.\n\nThank you for your consideration.",
  "electionyear": "2021",
  "office": "",
  "website": ""
}