{
  "name": "Theresa Richardson",
  "slug": "theresa-richardson",
  "email": "RICHARDSON4RICHLAND@GMAIL.COM",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66313/1540558",
  "image": "/images/candidates/theresa-richardson-original.png",
  "statement": "**Elected Experience**  \n2020 Richland City Council open seat finalist  \n  \n**Other Professional Experience**  \nHabitat for Humanity, CEO 2004-2012; 2017-2019; Development Solutions, Owner 1996-2004; Liberty Christian School, Development Director 1993-1996; Washington State University, writing lab instructor 1992; Turner Broadcasting, foreign correspondent Goodwill Games 1991  \n  \n**Education**  \nWashington State University, BA English/Business 1992; Cum laude - Commencement distinguished speaker; Certified Development Professional   \n  \n**Community Service**  \nCity of Richland, Economic Development Council 2020-present; New Heights Church, Vision Team 2021-present; Previous advisory boards or volunteer for the following:  CASA Guardian Ad Litum for abused and neglected children; Columbia Basin Non-Profit Association; Boys & Gils Club; Regional Chamber of Commerce; Union Gospel Mission; Habitat for Humanity  \n  \n**Statement**  \nThe City of Richland is growing.  As an elected city council member, my professional background, leadership, and life experience will reinforce a thoughtful strategic economic plan for residential and commercial development. Similarly, I will be a strong advocate for greater support and promotion or Richland’s thriving arts, culture, and recreation communities.    \nMy position will always center around four guiding principles of Business Vitality; Public Safety; Fiduciary Responsibility; and Sustainable Growth protecting Richland’s natural beauty.    \nAs a seasoned professional in this community, I have had the great privilege of working alongside so many talented, diverse, and innovative thought-leaders of all walks of life.  It’s with their confidence and support I have been able to successfully implement government policy, forge private-public partnerships and create, maintain and grow enduring relationships.    \nMarried 45 years, my husband David and I have a profound appreciation for this community and its unique natural beauty and culture.  Together we have three grown sons with families of their own who also call Richland home.    \nIn this season of my life, I have the time, energy and unique perspective to continue giving back to the community.  \nI would be honored to serve as a member of the Richland City Council!",
  "website": "http://RICHARDSON4RICHLAND.COM",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=RICHT--352&election_year=2021",
  "uuid": "RICHT--352",
  "party": "",
  "electionyear": "2021",
  "office": "City Council Member"
}