{
  "party": "",
  "name": "Craig Maloney",
  "slug": "craig-maloney",
  "statement": "**Elected Experience**  \nPasco City Councilmember 2018-present, Mayor Pro-tem 2018-2019.  \n  \n**Other Professional Experience**  \nSmall Business Owner in Downtown Pasco, Project Manager.  \n  \n**Education**  \nBachelor’s Degree in Applied Math from the University of Washington. Leadership Tri-Cities, Class 18. Pasco Police Citizens Academy.  \n  \n**Community Service**  \nCo-founded the Pasco Taco Crawl, raising over $30,000 for the Boys and Girls Clubs since 2016, increasing sales at local Hispanic businesses, and bringing more than 3,000 people to explore Downtown Pasco. Served on many boards and committees including: “Somos Pasco” greater Pasco area economic vision steering committee and Council liaison to the Pasco Public Facilities District, working to bring a water park to Pasco.  \n  \n**Statement  \n**I have had the honor and privilege of serving Pasco District 6 for the last 4 years. Pasco is more resilient than ever because your City Council has done the hard work necessary to achieve our dream of a thriving, vibrant city.\n\nThe pandemic has hurt many people in Pasco, and I will continue to push my fellow councilmembers to prioritize helping people and businesses harmed by COVID.\n\nOur housing market is booming because Pasco is an amazing place to live, and I will keep working to implement smart city planning to make it easier to live and work in Pasco. Our economy is growing because we support our businesses. Pasco is on the verge of an economic boom to match our housing boom because your City Council invested in our infrastructure, business systems and quality of life.\n\nOur diverse community demands continued focus on equity. I supported the creation of our Inclusion, Diversity and Equity Commission and our Arts and Culture Commission. I will continue to work to ensure no one is left out or left behind. I’m ready to keep serving on city council and helping Pasco thrive.\n\nPlease visit MaloneyForPasco.com to learn more!",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66438/1542792",
  "website": "http://www.maloneyforpasco.com",
  "image": "/images/candidates/craig-maloney-original.png",
  "uuid": "MALOC  301",
  "office": "City Council",
  "email": "craig@maloneyforpasco.com",
  "pdc_url": ""
}