{
  "party": "",
  "name": "Bill McKay",
  "slug": "bill-mckay",
  "statement": "**Elected Experience**  \n\n2017 – Elected to Kennewick City Council.\n\n2015 - Washington Self-Storage Association Board.\n\n  \n  \n**Other Professional Experience**  \nBuilt and own 27th Ave. Self-Storage. Raised on and operated family dairy farm. Cost Accountant at IBP, Commercial Lender for several banks. Appointed by Idaho Governor to Idaho Dairy Products Commission and Idaho Beef Council. Bill and his wife were national chair couple of National Milk Producers Young Cooperators.  \n  \n**Education**  \n\nAccounting degree - Boise State University, 1994.\n\nFarm Crops degree - BYU-I, 1980.   \n\n  \n  \n**Community Service**  \nTri-City Prep High School Board, scout master, AAU Basketball coach, YMCA board member, various positions in church.  \n  \n**Statement**  \nI have and will continue to ensure that every tax dollar is spent responsibly and that taxes are held to a minimum. City government's primary responsibility is to provide essential infrastructure with streets, water and sewer services, and safety through police and fire. The city should work to manage and encourage growth, not stifle it. The budget should reflect these priorities. Funding essential services must be budgeting and priority issues, not taxation issues.  \n  \nI will continue to call for Planning and Public Works regulations to be evaluated and streamlined so small businesses can grow without being over-regulated.  \n  \nI will continue to fully fund law enforcement. The city should continue to support legal immigration and oppose illegal immigration, which improves public safety.  \n  \nI want more transparency in city government, and enthusiastically support having open labor negotiations.  \n  \nI am one of two City Councilmen who has taken the risk of investing his own money to build a brick-and-mortar business in Kennewick. It was a big career risk, but I went ahead and built a successful business. As a result, my experience of going through the commercial building permit process, several times, is very valuable to being on City Council. Facebook.com/votebillmckay",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66308/1540548",
  "website": "",
  "image": "/images/candidates/bill-mckay-original.png",
  "uuid": "MCKAW  337",
  "office": "Kennewick City Council Pos 4",
  "email": "Votebillmckay@gmail.com",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/bMNFwKgZC40?t=1653)\n\n❌ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=24925424)\n\n❌ [Vote For Business Forum](https://youtu.be/A5KMicZa1Hs?t=157)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MCKAW  337&election_year=2021"
}