{
  "party": "",
  "name": "Don Britain",
  "slug": "don-britain",
  "statement": "**Elected Experience:** Elected to Kennewick City Council in 2009, elected by Council as Mayor since 2018.\n\n**Education:** Kamiakin High School 1979.  Columbia Basin College 1981.  Advanced Certificate of Municipal Leadership (CML) from the Association of Washington Cities.\n\n**Community Service:** Former Kennewick reserve police officer, Hanford Area Economic Investment Fund Committee, Kennewick Budget/Administrative Committee, Kennewick Economic Development Committee, Interview Committee, TRIDEC Board of Directors, Chair of Tri Cities Nations Parks Committee, Past President Association of Washington Cities, Firemen's Pension Board, LEOFF Disability Board, former Historic Downtown Kennewick Partnership board member, Girl Scouts/Boy Scouts, Polar Plunge.\n\n**Other Professional Experience:** Past President of the Association of Washington Cities (AWC)\n\n**Statement:** I am honored by your trust and faith shown me over the past 12 years as I served as your Kennewick City Councilmember and as Mayor.  I want to continue serving you and continue my work to make Kennewick a great place to live and raise a family.\n\nThe Covid pandemic and shutdown mandates imposed by the Governor were serious challenges requiring proven leadership.  I provided that leadership, creating safe and innovative ways for businesses to safely open and return our community to normal.  A personal challenge for me was being diagnosed with throat cancer and completing two major surgeries in 2020, yet I never stopped serving you as Mayor.  I am now blessed to be cancer free.\n\nYou elected me to serve you, and that is exactly what I have done.  I do not answer to special interest groups.  I listen, then make sound decisions that will benefit all people in Kennewick, regardless of race, gender, age, or party affiliation.  Currently 5 of your 7 Kennewick councilmembers have less than 4 years of experience.  My years of experienced leadership is needed now more than ever.  I humbly ask for your vote.\n\n509-430-4178\n\nBritain4council@gmail.com\n\nFacebook- Don Britain Kennewick City Council",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66322/1540543",
  "website": "",
  "image": "/images/candidates/don-britain-original.png",
  "uuid": "BRITD  336",
  "office": "Kennewick City Council Pos 1",
  "email": "Britain4council@gmail.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BRITD  336&election_year=2021"
}