{
  "party": "",
  "name": "Misipati Semi Bird",
  "slug": "misipati-semi-bird",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nFounder and Executive Director of Team Concepts Training & Consulting, practices as a Behavioral Scientist and practitioner of organizational psychology.  \nAssociate Director of Professional Development and Community Education at WSU.  \nFormer Federal Director of Training and Leadership Development at U.S. Department of Energy.  \nSpecial Forces Intelligence and Operations, and Special Forces Engineer at U.S Army Special Forces Regiment.  \n  \n  \n**Education**  \nBS, Business Administration, Columbia Southern University, Summa Cum Laude  \nMS, Human Resource Development, Villanova University, Magna Cum Laude  \nHonor Society of Phi Kappa Phi  \n  \n  \n**Community Service**  \nJunior Achievement volunteer K-12  \nWSU Executive in Residence  \nAlternative Education classroom volunteer  \nWashington State Migrant Council  \n  \n  \n**Statement**  \nM. Semi Bird began his life’s journey in the ghetto of the inner-city, born to a single mom before the passing of the civil rights act. He was raised to avoid victim behaviors and to embrace accountability, by taking deliberate actions toward personal excellence. He has lived his life by these values and has experienced the American dream.  \nSemi has had a lifetime of service, to both his nation, and his community. Semi is a doer who brings years of proven leadership, and experience in maximizing organizational and human performance as a successful business consultant. He is certified as a Professional in Human Resources (PHR), Performance Consultant, Emotional Intelligence, Personality Type Traits, Mediation, and LEAN methodology practitioner. Semi is a former U.S. Marine and Army Special Forces Green Beret who received several of our nation’s highest honors for heroism and “Demonstrated Leadership Under Extreme Conditions.” He has the personal courage to stand strong for students and parents. Semi is the right person, at the right time, with the right experience to lead the Richland School District through the extreme conditions brought about by COVID-19 and into a new future of Leadership, Accountability, and Collaboration.  \nFamilies First in Education!",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68368/1540601",
  "website": "http://www.semibird.us",
  "image": "/images/candidates/misipati-semi-bird-original.png",
  "uuid": "BIRDM--352",
  "office": "School Board",
  "email": "semi@semibird.us",
  "pdc_url": ""
}