{
  "party": "",
  "name": "Ken Short",
  "slug": "ken-short",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nContracts, Hanford (current); Legislative Assistant, Washington State Senate; Account Manager, Sermo Digital  \n  \n**Education**  \nColumbia Basin College (Associate of Arts), Washington State University (Bachelor’s Degree), Seattle University (MBA, Finance)  \n  \n**Community Service**  \nKennewick Planning Commission, Junior Achievement  \n  \n**Statement**  \nKennewick needs new, bold leadership. As your councilmember, Ken Short won’t just warm a seat, he’ll get to work solving our challenges. Ken knows innovative planning, small government, and low taxes will grow our economy and create a thriving community. He’ll use his background in finance to secure a balanced budget, increase government transparency and accessibility, and ensure our first responders have the resources they need to keep us safe.  \n  \nAs a Planning Commissioner, Ken has been working hard to create sustainable growth and champion responsible development. He is committed to maintaining the culture and character that makes Kennewick a great place to live.  \n  \nKen will keep taxes low and eliminate red tape to help small businesses grow and create jobs. He will advocate for greater investments in our parks, waterfronts, and revitalizing Downtown to improve our quality of life while helping to attract and retain a talented workforce.  \n  \n_“As a former Legislative Assistant in Olympia, I have seen first-hand what happens when politicians let reckless partisanship get in the way of solutions. I’m ready to roll up my sleeves to find commonsense solutions and get results for you.”_ – Ken Short",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66308/1540549",
  "website": "http://KenShort.org",
  "image": "/images/candidates/ken-short-original.png",
  "uuid": "SHORK--336",
  "office": "Kennewick City Council Pos 4",
  "email": "hello@kenshort.org",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/bMNFwKgZC40?t=1653)\n\n❌ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=24925424)\n\n✅ [Vote For Business Forum](https://youtu.be/A5KMicZa1Hs?t=157)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=SHORK--336&election_year=2021"
}