{
  "party": "",
  "name": "Erin Steinert",
  "slug": "erin-steinert",
  "statement": "**Elected Experience**  \nNo Information Submitted  \n  \n**Other Professional Experience**  \nOutreach Educator, Discovery Center of Springfield (2003-2006)  \nAstronomy Expert, James S. McDonnell Planetarium at the Saint Louis Science Center (2006-2009)  \nMath & Reading Tutor, Kumon North America (2006-2007)  \nScience Educator, LIGO Hanford Observatory (2009-2012)  \nMath Tutor, Sylvan Learning Center (2011-2015)  \n1st-2nd grade Co-Teacher, Children’s Garden Montessori (2012-2013)  \nPlanetarium Outreach Specialist, Bechtel National Planetarium at Columbia Basin College (2013-2019)  \nDirector, Planetarium & Observatory, Bechtel National Planetarium at Columbia Basin College (2019-present)  \n  \n**Education**  \nBA with Honors, Math and Physics/Global Studies minor, Drury University  \n  \n**Community Service**  \nMember, IDEA Committee, Pacific Planetarium Association (2020-2021)  \nBoard Member, Hands In for Hands On (HiHo) Tri-Cities (2015-2017)  \n  \n**Statement**  \nAs candidate for Kennewick School Board Director, I will strive for effective, science-based curriculum, open communication between the Board and our community, and creating an environment where our youngsters can grow and flourish.  \nWorking in education for over 17 years has made me very aware of and familiar with school curricula, state learning standards, and the needs of our students, their families, and their educators. Since relocating to Kennewick 11+ years ago, I have hosted, taught, and tutored thousands of children in all areas of science and the arts. Providing effective instruction in multiple disciplines and encouraging cross-curriculum activities and discussions is important to creating well-rounded members of society.  \nAccessibility and transparency are keys to success; I believe giving everyone equitable access to both the actions and intents of the Board, as well as the tools needed to thrive and prosper in the classroom, is paramount to community and scholastic achievement. Preparing the next generation for an ever-evolving world means instilling a thirst for knowledge, honing critical-thinking skills, and teaching kindness and empathy.  \nI truly want what is best for our students, teachers, families, and the entirety of our wonderful community. Please vote Erin Steinert for School Board. Thank you.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68358/1540591",
  "website": "http://www.Erin4KSD.com",
  "image": "/images/candidates/erin-steinert-original.png",
  "uuid": "STEIE--138",
  "office": "Kennewick School Board Pos 2",
  "email": "Erin4KSD@gmail.com",
  "pdc_url": ""
}