{
  "name": "Michael Alvarez",
  "slug": "michael-alvarez",
  "email": "mike@votemike.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66312/1540564",
  "image": "/images/candidates/michael-alvarez-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=ALVAM  352&election_year=2021",
  "uuid": "ALVAM  352",
  "party": "",
  "statement": "**Elected Experience**  \nRichland City Councilman, Review and Manage a $275 million dollar plus city budget, Council Liaison Planning Commission, Economic Development, Code Enforcement, and much more.  \n  \n**Other Professional Experience**  \nU.S. Marine Corp. Veteran, Business Owner mortgage company 25 years, Faculty, Master Instructor teaching Finance, Advanced Business Management, Consumer Protection and Code of Ethics to professional organizations throughout Washington. Finance Officer U.S. Coast Guard Auxiliary, VP funding development Boy Scouts of America Blue Mountain Council, Past President and Treasurer TCAR.  \n  \n**Education**  \nBachelor of Business Administration NMSU  \n  \n**Community Service**  \n_Community Service Award Winner_, Commissioner for Richland Parks and Recreation Commission, Fund Raiser Safe Harbor, National Child Identification Program.  \n  \n**Statement**  \n\nI will continue to use my Skills and Experience to improve the _Quality of Life_ for our senior citizens, youth, families, and veterans. I am the only candidate that has the education and Extensive Financial and Business Experience needed to help ensure that your taxpayer money is being used in the best possible way so that wasteful spending does not occur, and taxes are not increased unnecessarily. I have a proven record of saving taxpayer’s 1000’s of dollars in taxes annually. I support our Police and Fire Fighters making sure they have the proper tools to ensure _Exceptional Public Safety_. I will continue to work hard on city council to maintain and improve our parks, trails, and sport fields that we all love in Richland! I have fostered strong relationships with the Richland business community and support _Smart Economic Development_. I will continue to listen to the needs and concerns of our citizens. My pledge to you is to be Present, Accountable, and Transparent to all citizens of Richland.\n\nI have been married 31 years to my wife Gina, have two children, both graduates of Richland High and WSU! We have called Richland home for almost 30 years.\n\nmike@votemike.com  \nwww.VoteMike.com",
  "electionyear": "2021",
  "office": "City Council Member",
  "website": "http://www.VoteMike.com"
}