{
  "party": "",
  "name": "Danica Garcia",
  "slug": "danica-garcia",
  "statement": "**Elected Experience**  \nPTO Vice-President, Columbia River Pony Club Joint-District Commissioner.  \n  \n  \n**Other Professional Experience**  \nTeacher, curriculum developer, a mother of two children in Richland School District. Taught at WSU Tri-Cities and Columbia Basin College, Richland and Pasco substitute teacher, State English as a Second Language committee representative.  \n  \n**Education**  \nGraduate, Kamiakin High School; Graduate, Western Washington University, Advanced Spanish Language and Culture Studies, University of Alicante, Spain;  \nM.A. in Applied Linguistics/ESL Education, University of Massachusetts, Boston  \n  \n  \n**Community Service**  \nDestination Imagination coach, District Committee parent representative, Orchard Elementary Instructional Leadership team, Christ the King Sunday school assistant, CBC and Westside Preschools parent helper, Soroptimist Three Rivers International member.  \n  \n**Statement**  \n\nThis past year has been tough. Despite the best efforts of our district to reinvent schooling, many students and families are struggling. Moving forward, we need policies and programs that support all students' academic achievement and social-emotional wellbeing. Strategies like creating after-school academic intervention programs and better supporting English Language learners are crucial. Equally critical is increasing social and emotional aid for students by increasing in-building counseling, extending anti-bullying outreach, providing school-level support for families in need, and expanding partnerships with community agencies.  \n  \nEvolving as a district requires greater innovation, transparency, and fiscal responsibility. We must communicate openly, genuinely listen to our stakeholders (families, staff, and community members) and ensure all voices are represented. Schools need to be fully funded and taxpayer dollars carefully utilized to provide needed student learning opportunities. Richland has needs yet to be addressed so we must manage tax-payer dollars to maximize benefit for all students.  \n  \nDoing what’s always been done won’t work; We must evolve and collaborate for students to recover and thrive. Our kids’ future depends on it. I pledge to work tirelessly for all our students. Vote Danica Garcia for RSD Director, Pos. 1 for a brighter future for all our kids.\n\nelectdanicagarcia@gmail.com",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68367/1540598",
  "website": "http://votedanicagarcia.com",
  "image": "/images/candidates/danica-garcia-original.png",
  "uuid": "GARCD--352",
  "office": "School Board",
  "email": "electdanicagarcia@gmail.com",
  "pdc_url": ""
}