{
  "party": "",
  "name": "Kate Moran",
  "slug": "kate-moran",
  "statement": "**Elected Experience**  \nCouncilmember - City of West Richland  \n  \n**Other Professional Experience**  \nBoard Member - Benton Franklin Council of Government; Board Member - Benton Franklin Economic Development District; Founding Member - Pasco Bilingual Toastmasters Club; Nuclear Facilities Specialist - Pacific Northwest National Laboratory; Nuclear Reactor Operator - US Navy  \n  \n**Education**  \nCertificate of Municipal Leadership - Association of Washington Cities; Citizen's Academy - West Richland Police Department; B.S. Nuclear Engineering Technology - Excelsior College  \n  \n**Community Service**  \nPresident - West Richland Community Care Foundation; Programming Committee - Columbia Basin Badger Club; Former Chair - West Richland Planning Commission; Former Board Member - West Richland Police Department Community Advisory Board  \n  \n**Statement**  \nThank you, West Richland, for choosing me to represent you on City Council. Since I’ve been elected, we've accomplished several goals of mine: posting videos from Council meetings online; expanding the public comments section during meetings; and strengthening city zoning requirements. Now it's time to plan for the future. I’m asking for your vote to elect me as your Mayor.  \n  \nCouncil is discussing a ballot initiative to decide whether the advantages of a Manager-Council form of government make sense for West Richland. We have professionals managing all our city departments. It's time for a professional manager to guide our city. Our rapidly-expanding community deserves a Manager-Council form of government.  \n  \nTo get the balanced, diversified development that West Richland needs to generate a healthier tax base, I'll improve collaborative planning and cooperative decision making with other municipalities, regional associations, especially TRIDEC.  \n  \nWe must treat established neighborhoods fairly when allocating the costs of infrastructure. The current higher per-acre tax rates for those neighborhoods require thoughtful solutions. I'll work to build an economically-diverse, resilient, and stronger West Richland, where we build up and protect the future of all our neighborhoods.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66320/1540535",
  "website": "http://www.KateForWestRichland.com",
  "image": "/images/candidates/kate-moran-original.png",
  "uuid": "MORAK  353",
  "office": "West Richland Mayor",
  "email": "kateforwestrichland@gmail.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MORAK  353&election_year=2021"
}