{
  "name": "Richard Bloom",
  "slug": "richard-bloom",
  "email": "bloomrw@outlook.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66319/1540533",
  "image": "/images/candidates/richard-bloom-original.png",
  "pdc_url": "",
  "uuid": "BLOOR  353",
  "party": "",
  "statement": "**Elected Experience**  \nWest Richland City Council since 2010.  \n  \n**Other Professional Experience**  \nNavy veteran, with 40 year experience working for DOE contractors on the Hanford and Rocky Flats sites as an environmental professional.  \n  \n**Education**  \nMS in physics from Louisiana State University and a BS in physics from Loyola University of the South, New Orleans.  \n  \n**Community Service**  \nI currently serve on the board of Ben Franklin Transit (BFT), the Benton County Mosquito Control Board, the Benton County Solid Waste Advisory Committee, the Yakima Basin Fish and Wildlife Recovery Board, Hanford Communities and the Hanford Advisory Board (HAB) representing West Richland.  \n  \n**Statement**  \n\nYou, the voter, have given me the opportunity to serve our community through involvement in Council decisions and the many boards that directly impact the quality of life in our community. I come prepared to Council meeting with the citizens best interest in mind. I have questioned Council decisions on several occasions. I engage with the many interest groups dealing with Hanford cleanup, trying to bring science and reality into the process, keeping the best interest of our community in mind as we strive for an effective cleanup. I have encouraged many improvements that impact you directly.\n\nA new entertainment venue for residents is being developed at the old racetrack.\n\nBFT has brought a virtual bus stop to your front door via the new Connect Service. Download the VIA app and take a ride!\n\nMosquito Control will be using a drone rather than a helicopter this year for applications\n\nThe conservation district will be removing a proliferation of Star Grass from the Yakima River\n\nAs a voter you should be looking for a candidate who is informed, motivated, and willing to commit the time and effort required for the position. For this reason, I ask for your vote.\n\nThank You",
  "electionyear": "2021",
  "office": "",
  "website": "http://www.facebook.com/BloomForWRCouncil"
}