{
  "party": "",
  "name": "Steve Christensen",
  "slug": "steve-christensen",
  "statement": "**Elected Experience  \n**Eight years - Pasco School District Board of Directors.  \n  \n**Other Professional Experience**  \nOver 30 years experience as a mechanical engineer; small business owner; licensed mechanical engineer in Washington; fluent in the Spanish language; Leadership Tri-Cities Class XXII.  \n  \n**Education**  \nGraduate of Royal High School, Royal City, Washington; Bachelor of Science degree from Brigham Young University, Provo, Utah.  \n  \n**Community Service**  \nServed as church leader in local congregation; many years working with church youth groups; served as Scoutmaster; Chairman of White Bluffs District, Boy Scouts of America; Pasco Youth Football board of directors.  \n  \n**Statement**  \nEducation is vital to our success both as a community and as a country. For the past 8 years I have served on the Pasco school board, working together with district leadership to determine the best educational vision and priorities for the success of our children. This past year has been especially challenging, but we are moving forward again. I am committed to taking the lessons we have learned from this experience and building on them to make our education system even better.  \n  \nI believe we need a strong public education system that serves all of our children – one that will prepare them to make good decisions. Our students not only need education in reading, writing, math and science, but civics and social studies as well. This will require board members, district administration and the community working together to make sure our education system in Pasco is effective.\n\nI am asking for your support to return me to the board. It is my goal to continue to work on needed improvements while highlighting and building on the many good things that are happening in our school district.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68476/1542782",
  "website": "",
  "image": "/images/candidates/steve-christensen-original.png",
  "uuid": "CHRIS  301",
  "office": "School Board",
  "email": "steve4psdposition3@gmail.com",
  "pdc_url": ""
}