{
  "name": "Bryan Meehan-Verhei",
  "slug": "bryan-meehan-verhei",
  "email": "bverhei@hotmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61244/1538246",
  "image": "/images/candidates/bryan-meehan-verhei-original.png",
  "statement": "**Elected Experience**  \nBoard member of Blue Mountain Heart To Heart. Actively focusing on finding additional housing solutions for clients.  \n  \n**Other Professional Experience**  \nBryan has worked as a retail worker, in management, as a registrar in the healthcare system and owns a successful real estate business.    \n  \n**Education**  \nBachelor’s Degree In Government with a Minor in Business Management from Eastern Washington University in Cheney Washington.  \n  \n**Community Service**  \nBryan has participated in numerous workdays in the community. These workdays included painting the homes of Kennewick residents, working for organizations to help reclaim their yard space, and participating in the organization and execution of multiple food and supply drives.  \n  \n**Statement**  \nBryan Meehan-Verhei is running for city council to bring his people first approach to local government and believes care for our residents should come first. Bryan prioritizes affordable housing with common sense zoning for multifamily housing, allowances for small or “tiny” home communities, as well as a strategic growth plan that will identify and address future growth needs. Mr. Meehan-Verhei also supports promoting community access that will ensure that all Kennewick residents can access local services and businesses by committing to increased and improved infrastructure, including improving public transportation and pedestrian travel options. Bryan is committed to working with local health and safety officials to achieve a safer, healthier Kennewick by supporting harm reduction strategies. In addition to a housing first approach that addresses the growing homelessness in our region, Bryan supports programs that would give local law enforcement access to alternatives other than jailing when appropriate. Mr. Meehan-Verhei is a clear choice for common sense leadership that puts the needs of the community first.",
  "website": "",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MEEHB--336&election_year=2021",
  "uuid": "MEEHB--336",
  "party": "",
  "electionyear": "2021",
  "office": "City Council Member"
}