{
  "party": "",
  "name": "Gail Brown",
  "slug": "gail-brown",
  "statement": "**Elected Experience**  \nMy name is Gail Brown. I am asking the citizens of West Richland to reelect me to the city council. When the city officially incorporated in 1960, I was one of the 1,347 citizens that lived here. I enjoyed my childhood, lived, worked, and raised three children here. It is these things that gives me the passion and commitment to continue to serve our city as your councilmember. I have a vested interest in seeing our city move forward in a positive, citizen driven manner.  \n  \n**Other Professional Experience**  \nNo Information Submitted  \n  \n**Education**  \n\nColumbia Basin College\n\n  \n  \n**Community Service**  \n24 years as your councilmember  \n  \n**Statement**  \nPositive developments and steady growth have increased the city’s population to over 15,000. The city’s campus is complete and construction on the, citizen approved, police facility is on track to finish this year.  \nGrowth has positives and negatives. It is important that as elected officials we understand this and move forward with lessons learned. Now is the time to solidify policies and do long term planning, not just for new construction and infrastructure but, providing opportunities for our established neighborhoods as our city moves forward. Let’s work together to make sure they stay vital and family friendly. I place a high priority on goals such as plans to reduce risk of blight and crime, and plans to improve, assist and cleanup areas our city has under-served in the past.  \nLet’s put parks back on the priority list and add our senior citizen’s input to the planning process. Let’s create a citizen’s group to give a third-party view on our city’s property and asset management to ensure transparency. I will continue to work my hardest to ensure that our city is ready to move forward into the best future possible.  \n  \nGail4westrichland@gmail.com  \nReelect Gail Brown West Richland Council | Facebook",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66321/1540532",
  "website": "",
  "image": "/images/candidates/gail-brown-original.png",
  "uuid": "BROWG  353",
  "office": "City Council",
  "email": "GAIL4WESTRICHLAND@GMAIL.COM",
  "pdc_url": ""
}