{
  "party": "",
  "name": "John Trumbo",
  "slug": "john-trumbo",
  "statement": "**Elected Experience:** Kennewick Council member, Ward 3.  Elected in 2013.  Unopposed in 2017.\n\n**Other Professional Experience:** Newspaper reporter in California and Washington.  Retired in 2021.  Served on Ben Franklin Transit Board, Community Action Committee, Hanford Advisory Board, Kennewick School FOCUS, Kennewick City Block Grant Advisory Committee.\n\n**Education:** Graduate Las Lomas High School, Walnut Creek, Calif.; AA degree 1968 Sierra Community College, Rocklin, Calif.; Chico State College, Chico, Calif.; BS Journalism 1971, San Luis Obispo, Calif.\n\n**Community Service:** Member South Hills Church; active Ye Ole Car Club and Columbia Basin Model A Club; supports Tri-Cities Union Gospel Mission, Therapeutic riding of Tri-Cities (TROT), modern Living Services (disabled adults housing).\n\n**Statement:** I have served 8 years on the Kennewick Council, delivering on a promise to hold government accountable.  As a retired investigative reporter, I know how to ask tough questions and follow the money, ensuring that taxpayer dollars are spent wisely.  Police, fire, roads, and water systems are my top priorities.  I am independent, and have never sought campaign support from a labor union, or special interest group based outside Kennewick.\n\nI have lived in Ward 3 as a homeowner for 20 years.  I am married, have two adopted daughters from China, one of whom is developmentally challenged, and have served on 5 short-term mission trips, domestically and overseas through South Hills Church.  I have engaged in my community by supporting Christian service outreach, and helping those in need, _without expecting anything in return._ I have no political ambitions.\n\nI stand for our Constitution in our democratic republic, one nation under God, for liberty, and justice for all.  I believe no one, regardless of origin, religion, wealth or residence, has less or more _value_ than another.  I want Kennewick to be the best it can be through compassionate, conservative leadership.  Reach me at johntnews@gmail.com or 509-366-2241.  Or follow me on facebook/TrumboforKennewick.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66324/1540546",
  "website": "",
  "image": "/images/candidates/john-trumbo-original.png",
  "uuid": "TRUMJ  337",
  "office": "Kennewick City Council Pos 3",
  "email": "johntnews@gmail.com",
  "pdc_url": ""
}