{
  "name": "Ben Griggs",
  "slug": "ben-griggs",
  "email": "ben@bengriggs.us",
  "pamphlet_url": "https://voter.votewa.gov/GenericVoterGuide.aspx?e=871&c=03#/candidates/68366/1540599",
  "image": "/images/candidates/ben-griggs-original.png",
  "pdc_url": "http://www.pdc.wa.gov/sos/rd.aspx?id=U1533770GRI",
  "uuid": "GRIGB--352",
  "party": "",
  "statement": "**Elected Experience**\n\nHOA Board Vice President, ASCE BYU Student Chapter President\n\n**Other Professional Experience**\n\nRegistered Professional Engineer in Washington and Utah, Certified Project Management Professional, Project Manager at PNNL, Project Engineer at Cloward H2O, Director of Engineering at GeoStrut, Project Engineer at Tetra Tech\n\n**Education**\n\nBS in Civil and Environmental Engineering, Brigham Young University, 2006\n\nMS in Civil and Environmental Engineering, Brigham Young University, 2009\n\n**Community Service**\n\nScoutmaster, church youth volunteer, youth sports coach\n\n**Statement**\n\nOver the past 18 months I have watched my children and other students in our community struggle. They have grappled with isolated learning, missed out on friends, band, sports, clubs, and so many important experiences. Through it all, it has become clearer than ever that the Richland School District needs new ideas, priorities, and leadership. It’s time for our district to refocus and start putting students first!\n\nAs a professional engineer, project manager, husband, and father of five who will attend our district for years to come, I am uniquely qualified and motivated to help our district meet the needs of our students. My years of experience objectively analyzing information, managing large budgets, collaborating with people from all walks of life, overseeing complex projects, and utilizing data to develop elegant solutions to difficult problems have provided me with the expertise needed to successfully tackle the demanding challenges that our school district faces.\n\nI am fully committed to our students and to our community. I will use my education, passion, and experience to partner with students, parents, and district staff to build a better future for our children! Vote Ben Griggs and put our students first!",
  "electionyear": "2021",
  "office": "",
  "website": "https://www.bengriggs.us/"
}