{
  "name": "Brent Gerry",
  "slug": "brent-gerry",
  "email": "",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66320/1540534",
  "image": "/images/candidates/brent-gerry-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=GERRB  353&election_year=2021",
  "uuid": "GERRB  353",
  "party": "",
  "statement": "**Elected Experience**  \nWest Richland City Council Member from 2010 through 2013.  \nWest Richland Mayor/CEO from 2014 to present.  \n  \n  \n**Other Professional Experience**  \nOwner of Richland AutoCare Center,  \nEnergy Communities Alliance Vice-Chairman, Hanford Communities Administrative Board Chairman, TRIDEC Board Member, METRO Drug Task Force Board Member, Benton County Emergency Services Board Member, Police Information Network (BIPIN) Board Member.  \n  \n  \n**Education**  \nOlympic College. National Center for Dispute Settlement with Arbitration /Mediation Certification. Firestone Automotive Management Certification.  \n  \n**Community Service**  \nVolunteer at community events including National Night Out, Harvest Festival, and Hogs and Dogs. Mentor young people through employment opportunities. Support Boy Scout trainings and badge programs.  \n  \n**Statement**  \nAs a successful small business owner for over 31 years, I have brought business sense solutions to West Richland’s city government. As mayor since 2014, I have committed to enhancing our public safety efforts to keep West Richland one of the safest and best places to raise a family. In partnership with the Richland School District, overcrowding at our schools was erased with the addition of a middle school and elementary school. Our community is known for its financial security, stability through balanced budgets, and strong financial practices including paying off over $1.2 million in infrastructure loans early. Under my leadership, we brought in $9.5 million in state and federal grants to enhance our city, while securing $26 million for the future widening of Van Giesen from the post office to Red Mountain Road. Economic development is coming to West Richland through community partnerships at the Belmont Business District, the Red Mountain Center, and through Van Giesen revitalization. Responsive and transparent government is the foundation of my administration and your comments and suggestions to shape our city have always been welcomed and appreciated. Please like me on Facebook and visit my web site at brentgerryformayor.com.",
  "electionyear": "2021",
  "office": "Mayor",
  "website": ""
}