{
  "name": "Heather Cleary",
  "slug": "heather-cleary",
  "email": "cleary.home@charter.net",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61278/1533621",
  "image": "/images/candidates/heather-cleary-original.png",
  "statement": "**Elected Experience**  \nI have proudly served as a board member of the Richland School Board for the past 16 years (2005-present)  \n  \n**Other Professional Experience**  \nMy career was in the television broadcasting field (1978-1991)  \n  \n**Education**  \nGraduated from Montana State University B.S. Film and Television  \n  \n**Community Service**  \nOnce our family moved to Richland 30 years ago, I began volunteering in RSD classrooms and with an educational program called Destination Imagination that teaches creative problem solving to students. I never envisioned running for elected office. My interest grew from helping in classrooms and district committees and became a labor of love.\n\n**Statement**  \n\nRSD has faced unprecedented challenges since March 2020 once the Covid-19 pandemic began. Through it all, RSD has remained focused on student needs, while complying with requirements imposed by the state, governor and BFHD.\n\nRSD created Pacific Crest Online Academy within weeks, and expanded the Homelink Program to meet student demand. RSD was among the first school districts in Washington state to fully re-open schools Monday-Friday this spring, and offered vaccination clinics. Exciting summer school offerings are being provided to all student to help them regain skills. I remain optimistic that our schools will begin normal operations in August 2021.\n\nThroughout the pandemic our board has patiently listened to the public. Historically our board has given constituents the opportunity to voice opinions. We practice thoughtful governance and it's how we would like to be treated ourselves.\n\nI have long felt that our community is only as good as the quality of schools we provide, and I feel the same today as when I began my school board tenure. We must remain optimistic that life will soon return to normal and we will once again provide a rich educational experience that our community expects from the Richland School District.",
  "website": "",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}