{
  "party": "",
  "name": "Ginger Wireman",
  "slug": "ginger-wireman",
  "statement": "**Elected Experience**  \nVP Meadows East Homeowners Association 2018 to present  \n  \n  \n**Other Professional Experience**  \nCommunications & Outreach WA Dept. of Ecology, Nuclear Waste Program (Hanford), Water Quality Agent, WSU Cooperative Extension, Benton Co., Adjunct Faculty (1999-2002) WSU-TC  \n  \n  \n**Education**  \nMS Environmental Studies, & BA Communications, California State University Fullerton,  \n  \n  \n**Community Service**  \nFuturewise, WA - board of directors; Tres Rios Community Land Trust, founder; Flatten The Curve TC admin; RHS Instrumental Music Boosters 2009-2017 fundraising lead; Carmichael MS Science Fair chair; Badger Mt. Kids of Steel fundraising chair; Tapteal Greenway founding board; Mid-Columbia Earth Day & Earth Month, Organizer; Celebration of Science; Sustainable TC, Mid-Columbia Science Fair, Save The Reach  \n  \n**Statement**  \nI’m Ginger Wireman. My mom moved us to Richland in 1977. It was a community where a mom could raise her daughter to grow up secure. I loved the pioneering spirit of Richland. I loved my walkable neighborhood, knowing my neighbors, and supporting local shops. I loved my Richland Bomber experience. I loved Richland so much that after college I returned and raised my own family here.  \n  \nFor too long, Richland’s council has made bad decisions favoring large (mostly outside) developers over the needs of the families and local businesses who built Richland up from the desert.  \n  \nThings families need to thrive, and the ability to make ends meet, have been replaced by big-box stores, grinding commutes on dangerous roads, and the costliest housing market (and highest utility fees) in Central Washington. Richland has become a city too many young families can no longer afford.  \n  \nI want a Richland where my children return to raise their children. I want a Richland we can all feel safe to call home. If elected to council, I’ll fight for family values over developers, and prioritize our Richland community over someone else’s quick buck. Vote for me, Ginger Wireman, because Richland deserves better!",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66316/1540563",
  "website": "http://Wireman4Richland.com",
  "image": "/images/candidates/ginger-wireman-original.png",
  "uuid": "WIREE  352",
  "office": "Richland City Council Pos 4",
  "email": "wireman4richland@gmail.com",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/D3jq_TdcBB8?t=2310)\n\n✅ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=25059140)\n\n✅ [Vote For Business Forum](https://youtu.be/nrr6V3FrdV0?t=162)\n\n✅ [Tri-City Herald Editorial Board Interview](https://www.tri-cityherald.com/latest-news/article254586037.html/video-embed)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=WIREE  352&election_year=2021"
}