{
  "party": "",
  "name": "Leo Perales",
  "slug": "leo-perales",
  "statement": "**Elected Experience**  \nPark Middle School ASB President, 2000-2001.  \n  \n**Other Professional Experience**  \n10 years of leadership experience. Code Safety Professional, 2007-Present, Hanford Nuclear Reservation and Large Industrial/Commercial Public and Private Projects.  \n  \n**Education**  \nHeritage University-2012, Graduated Summa Cum Laude with a Bachelor of Arts in Criminal Justice. Columbia Basin College-2008 graduate. Kamiakin High School-2005 graduate.  \n  \n**Community Service**  \nTri-Cities Community Work Group on Community Policing, Tri-Cities Special Investigations Unit(SIU), Community Representative, Pasco Fiery Foods Festival Volunteer,  Vice Chair-Kennewick Housing Authority; Vice Chair-Benton County Planning Commission, Kennewick Improvement Board, Washington State Partnership Council on Juvenile Justice’s Racial & Ethnic Disparities Committee, Benton-Franklin Juvenile Justice Truancy Board.   \n  \n**Statement**  \nI’m running for Pasco City Council because I believe it’s time for a new generation of leadership. I’m a Pasco native whose watched Pasco grow and prosper. It is important we retain our value of community and put families first. Public safety is one of my priorities as it greatly impacts our quality of life. I believe the city should support our Police and Fire Fighters because they put their lives on the line every day to keep our families safe. As your representative I will work to ensure that we have well-funded fire and emergency medical services because after this pandemic, we know how vital they are to our community. I believe the City should support growth and not stifle it with unreasonable regulations and fees. As your councilman, I will make certain that we always maintain our small town roots. I believe in fiscal responsibility and will work tirelessly so that when I look you in the eye, I can tell you that we spent your tax dollars wisely. Pasco needs someone in city hall that will listen to its residents needs and concerns. With a servants heart I request your vote. Elect the right leader-vote Leo Perales.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66436/1542789",
  "website": "",
  "image": "/images/candidates/leo-perales-original.png",
  "uuid": "PERAL  337",
  "office": "City Council",
  "email": "leoaperales@gmail.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=PERAL  337&election_year=2021"
}