{
  "party": "",
  "name": "Elizabeth Vann-Clark",
  "slug": "elizabeth-vann-clark",
  "statement": "**Elected Experience**  \nNo Information Submitted  \n  \n**Other Professional Experience**  \nTechnical Writer/Editor; Mathematics educator; Math Curriculum Action Team, Standards Based Assessment Committee, and teaching lead for the Advanced Algebra with Applications PLC for Pasco School District; Washington State OSPI contractor for Collection of Evidence and End of Course Exam Committees; and McGraw-Hill contractor for Smarter Balance Item Review for Bias Committee.  \n  \n**Education**  \nMaster of Mathematics Education from Western Governors University, Bachelor of Education from Washington State University, and Mathematics teaching certification from Antioch University.  \n  \n**Community Service**  \nSageFenCon President, Tri-Cities Women’s March 2021 volunteer, PFLAG volunteer, and 20 years of experience in leadership and other volunteer roles with the Pacific Northwest literature conventions.  \n  \n**Statement**  \nAn experienced math educator, mother, and public servant, Elizabeth Vann-Clark recognizes all students as individuals with their own development, rights, and needs. Elizabeth understands educational law, state standards, and the process in which educational policies and decisions are made. She is an advocate for curriculum and policies that respect individual student development and our diverse community.  \nElizabeth will take a stand against unfunded, mandated state testing. Her position comes from years of experience working at the local, state, and national level with assessment development and scoring. State testing doesn’t respect children's development, takes from educational time, and interferes with local decision making.  \nShe is a strong supporter of alternative learning environments. From home schooling to in-building schools and versions in between, Elizabeth believes that families should have options available to make the best educational decisions for their children and family.  \nElizabeth believes that there's a great deal our school boards can do to advocate for our children and our teachers, districts, and community can find common ground through common goals. Though our children have different educational needs, a student first, experienced school board is something they all deserve, and we should all work towards that together.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68368/1540602",
  "website": "http://electvannclark.com",
  "image": "/images/candidates/elizabeth-liz-vann-clark-original.png",
  "uuid": "VANNE--352",
  "office": "",
  "email": "info@electvannclark.com",
  "pdc_url": ""
}