{
  "party": "",
  "name": "May Hays",
  "slug": "may-hays",
  "statement": "**Elected Experience**  \nCurrently, I have no city council experience. I am looking forward to it!  \n  \n  \n**Other Professional Experience**  \nMy full-time job is working with Benton REA as a Community Relations Operations Specialist working with West Richland Area Chamber of Commerce as their Executive Director, local business owner of The Mayfield Gathering Place and Gardens and founder of Operation We Care Tri-Cities.  \n  \n  \n  \n**Education**  \nAssociates of Arts Degree, Columbia Basin College  \nPasco High School Diploma  \n  \n  \n  \n**Community Service**  \nFounder of Operation We Care-Tri-Cities, Combat Veterans International, Operation Candy Cane, Holiday Family Outreach, VA Regional Site Veterans Day Parade, Hogs & Dogs and  \nCool Desert Nights.  \n  \n  \n  \n**Statement**  \nMay Hays has been a part of the West Richland community for over these last 25 years. She is a local business owner and runs the West Richland Area Chamber of Commerce and is very community minded. May is incredibly grateful to have worked on so many projects and events for the betterment of West Richland. She is a very forward-thinking individual that will work tirelessly to contribute to improve and keep the City of West Richland moving forward in a positive manner.  \n  \nMay has a desire to bring businesses, citizens and the city moving together in a more cohesive way. She will continue to work on expanding programs to support our Veterans, Police Department, Fire District, Seniors and much, much more. May holds herself to high standards and dedication to the City of West Richland to help in the effects to prosper and grow.  \n  \nMay feels her extensive Leadership skills, years of experience and her Hometown Pride will make her an excellent choice for City Council position #3!  \n  \nMay Hays humbly requests your vote for Position #3",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66321/1540531",
  "website": "",
  "image": "/images/candidates/may-hays-original.png",
  "uuid": "HAYSM--637",
  "office": "City Council",
  "email": "",
  "pdc_url": ""
}