{
  "name": "Gary Bullert",
  "slug": "gary-bullert",
  "email": "gbullert6@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61271/1534321",
  "image": "/images/candidates/gary-bullert-original.png",
  "statement": "**Elected Experience**  \nFaculty Senate, CBC  \n  \n**Other Professional Experience**  \n\nTaught the 6th Grade (Watts), Blanchet High School, CBC (27 years), Seattle University, Seattle Pacific University, WSU Tri-Cities.  Bradley Scholar (The Heritage Foundation).  \nVisiting Scholar: University of Washington, Catholic University, Stanford University Senior Policy Research Analyst (Education), Washington State Senate  \nBooks: _The Politics of John Dewey, The Hunthausen File, The Disputed Legacy of Sidney Hook._   \nMonographs: _Restructuring Education: Building New Roots._\n\n  \n  \n**Education**  \nStanford University, B.A.(Philosophy), Claremont Graduate School, M.A., PhD. (Government)  \n  \n**Community Service**  \nDistrict Coordinator, State Judge (We the People: Citizens and the Constitution program), youth basketball coach (St. Joseph's School), Judge - American Legion's High School Constitution Speech competition.  \n  \n**Statement**  \n\nPresident Biden initiated a campaign to fundamentally change America by exorcizing \"systemic racism.\" Billions of dollars are designated to transform the entire process of public education through critical race theory ensconced in social-media learning. In Washington, districts \"must align with the social-emotional learning standards and benchmarks adopted by the (OSPI) under RCW.28A.300.478.\" Districts are mandated to implement a curricular screening agenda. The announced objective is to \"eliminate bias.\" Is post-modern Marxism unbiased? Governor Inslee signed a bill requiring all state employees to undergo critical race theory sensitivity sessions. Earlier, Seattle Public School teachers were pressured to confess their \"whiteness\" and repent by promulgating \"anti-racism.\" In addition to being sexualized at an early age, should school children be manipulated to feel guilty about their own skin color.\n\nI repudiate enlisting the public schools to advance a political agenda. This undermines the academic process and further alienates and polarizes the community. My campaign will highlight stronger sanctions against teacher strikes, reestablish Board authority, promote critical thinking by examining both sides of an issue, and prioritizing in-class instructions (see position papers).\n\nContact:  \nLink: https://www.facebook.com/KAPPKVEW/videos/10155688640019746  \nE-mail: gbullert6@gmail.com  \nPhone: (509) 627-6146",
  "website": "",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}