{
  "name": "Chauné Fitzgerald",
  "slug": "chaune-fitzgerald",
  "email": "CHAUNEFITZ@GMAIL.COM",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61248/1537487",
  "image": "/images/candidates/chaune-fitzgerald-original.png",
  "statement": "**Elected Experience**  \nNo Information Submitted  \n  \n**Other Professional Experience**  \nBusiness Development Executive and owner with over 25 years of experience.  \n  \n**Education**  \nMaster of Science in Business/Organizational Leadership Management – MBA  \nBachelor of Science-Health Care Management - Southern Illinois University  \n  \n  \n  \n**Community Service**  \nCommunity advocacy positions I currently hold include Tri-City Regional Chamber of Commerce-Board Member, Commissioner on African American Affairs, Women of Wisdom Tri-Cities (WOW Tri-Cities)-CEO, MyTri 2030 Inclusion Council-Member, Tri-Cities WA Chapter of The Links Inc.-Vice President. I also facilitate Own Your Business as the program leader providing business start-ups for entrepreneurs, in addition to serving on the board of Women Helping Women Tri-Cities. Receiving the 2020 CBC MLK Jr. Spirit Award.   \n  \n**Statement**  \nI am a strong believer in giving back and serving the community where I live, work, and play. For over a decade, I have served the underrepresented and at-risk citizens of Tri-Cities by implementing change towards economic development and social justice. My husband is a Nuclear Engineer Manager at Hanford, we have children who have graduated from and are currently enrolled in the Richland School District. Richland is our home.  \nDepending on the lens you’re looking through, Richland does not face any challenges. However, the city’s narrow focus on development results in social inequity and disparities of wealth, adequate health care, youth and senior services, public safety, affordable housing, and environmental policies.  \nI will bring a new perspective to our city council with my vision and voice. I will examine taxes, budgets, and enforcement measures carefully, for inclusivity. I will lead with my experience and share innovative solutions regarding economic development, transportation, and infrastructure. I will strive to build more businesses, community facilities, and affordable homes. I will actually have input on all major issues. With your vote, I will work to protect equity and quality of life for all. Vote Chaune’ Fitzgerald for City Council Position 1.",
  "website": "http://Chaunefitzgerald.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=FITZC--352&election_year=2021",
  "uuid": "FITZC--352",
  "party": "",
  "electionyear": "2021",
  "office": "City Council Member"
}