{
  "party": "",
  "name": "Theresa L Morrell",
  "slug": "theresa-l-morrell",
  "statement": "**Elected Experience**  \nI have no formal experience, but plenty of community involvement.  \n  \n**Other Professional Experience**  \nI retired from Superior Courts and West Richland Police Department. I am a past facilitator for Parenting with Dignity classes, created Volunteers in Police Service program, past DARE instructor, Drug Task Force detective, board member for Special Olympics, Child Abuse Protocols, Kid's Haven, Traffic Safety Commission, and Crime Stoppers.   \n  \n**Education**  \nSeveral thousand hours of police training plus police Crime Prevention, DARE and basic drug academies.  \n  \n**Community Service**  \nParenting with Dignity class, Scout programs, WR Easter Egg hunts, Veteran's Parades, Moving Wall, Harvest Festivals, National Nite Out and more.   \n  \n**Statement**  \n\nI firmly believe that a community makes a city stronger. I think there should be a healthy balance between business and the population so the community itself isn't carrying the tax burden. We live in a beautiful, peaceful, safe and growing family focused community.\n\nI will be an advocate for all members of our community with honesty, transparency, and integrity. My only agenda is the community. I back our Police department. I am an active NRA member.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/66317/1540530",
  "website": "http://theresamorrellforcitycouncil.com",
  "image": "/images/candidates/theresa-l-morrell-original.png",
  "uuid": "MORRT--353",
  "office": "West Richland City Council Pos 2",
  "email": "",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/3tJNKJ6-Zoo?t=2580)\n\n❌ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=25059146)\n\n✅ [Vote For Business Forum](https://youtu.be/f3-UNX9tvQQ?t=181)\n\n✅ [Tri-City Herald Editorial Board Interview](https://www.tri-cityherald.com/latest-news/article254857627.html/video-embed)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MORRT--353&election_year=2021"
}