{
  "name": "Nikki Torres",
  "slug": "nikki-torres",
  "email": "NikkiTorres4Pasco@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/63786/1537785",
  "image": "/images/candidates/nikki-torres-original.png",
  "statement": "**Elected Experience**  \nAs a first-time candidate, I’ll bring an experienced collaborative voice to the city council.  \n  \n**Other Professional Experience**  \nPast President of Tri-Cities Hispanic Chamber, member of Association of Washington Business Grassroots Alliance, a past Board Member of Tri-Cities Community Health, Visit Tri-Cities, and the Kennewick Police Department Foundation. Past appointment to Childcare Collaborative Task Force.  \n  \n**Education**  \nI earned a Master of Business Administration from University of Phoenix and inducted into the National Society for Leadership and Success, an Honor Society.  \n  \n**Community Service**  \nI have served on numerous committees such as Latino Heritage Mural, Dia De Los Muertos Scholarship Fun Run, and classroom volunteer for Junior Achievement.  \n  \n**Statement**  \nMy name is Nikki Torres; I am running to be your next Pasco City Councilmember for District 3.  \nI am running because our city, which was hit hard by the COVID-19 Pandemic, needs leadership to put it on a path to full recovery. This requires an experienced collaborator who will support smart growth, address affordable housing through permitting and zoning, and promote policies that will entice new businesses and manufacturing to our city. Currently, I serve as a Strategic Partnerships Manager for Western Governors University. Prior to this, I worked with small businesses. In all, I have over 20 years of service to our community.  \n  \nI believe that my work in our community and my professional experience makes me the best person for the Pasco City Council Position 3. Within our community we know that Pasco is a confident member of the Tri-Cities and moving forward as a leader. I will help our city recover from the pandemic and build a stronger economy that works for everyone in our community. I respectfully ask for your vote. Thank you to the community leaders that have endorsed my campaign: Saul Martinez, Mayor of Pasco, and Matt Watkins, Past Mayor of Pasco.",
  "website": "http://www.nikkitorresforpasco.com",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}