{
  "party": "",
  "name": "Michelle Andres",
  "slug": "michelle-andres",
  "statement": "**Elected Experience**  \nFirst time Candidate.\n\n**Other Professional Experience**  \nMiddle School Teacher 7th/8th Grade, Rogue River, OR; College Admissions Counselor - Sterling College, KS; Workforce Investment Act Representative—Career Path Services, Spokane, WA; TV/Radio Broadcast- Administrative and Promotions Positions, KXLY - Spokane, WA; American Heart Association Training Network Account Representative- OR, WA, AK, MT, ID.\n\n**Education**  \nBA in Communications with Marketing Emphasis Whitworth University.\n\n**Community Service**  \nFranklin County Civil Service Commission; DECA Volunteer Judge Chiawana High School.\n\n**Statement**  \nI believe our students need to return to in-person education as much as possible but this time with local control by parents and students over school choices and school funding.\n\nStudents were not given a choice in Pasco last year whereas other districts were. The Washington Achievement Council reported high school students failing to earn grades up 42% over last year.\n\nIn 2020, the CDC compared 2019 and reports mental health related visits to the E.R. increased 24% in ages 5-ll and 31% ages 12-17.\n\nGreater numbers of families and students are leaving public schools which means lower enrollment, less funding, less for students. It’s time for local driven choices by parents and students to fund and drive their future and its time school boards to clear the way for trades and higher educational opportunities.\n\nOn-line education may be a better choice for some students but far too many of these decisions are being made for you while you foot the bill. Shouldn’t it be your choice, your school? As your next School Board member I believe it is. I’m Michelle Andres and I ask for your vote. Thank you.",
  "electionyear": "2021",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=871#/candidates/68477/1542785",
  "website": "https://www.facebook.com/Michelle4Pasco",
  "image": "/images/candidates/michelle-andres-original.png",
  "uuid": "ANDRM--301",
  "office": "Pasco School Board Pos 5",
  "email": "coachmichelle16@gmail.com",
  "engagement": "✅ [General Election Forum 2021](https://youtu.be/ZjUR0Tqc1rs?t=2344)\n\n❌ [VOTE411 Voter Guide](https://onyourballot.vote411.org/candidate-detail.do?id=24921413)\n\n✅ [Tri-City Herald Editorial Board Interview](https://www.tri-cityherald.com/latest-news/article254281883.html/video-embed)",
  "pdc_url": ""
}