{
  "name": "Bill Jenkin",
  "slug": "bill-jenkin",
  "email": "info@electbilljenkin.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/120662/1552278",
  "image": "/images/candidates/bill-jenkin-original.png",
  "statement": "**Elected Experience:** Two-term state Representative, serving Benton county. Three years on Prosser School Board, 2 years as School Board President.\n\n**Other Professional Experience:** Owner of Prosser Vineyard & Winery and Bill’s Tasting Room, Former Edward Jones Financial Advisor and Farmers Insurance Agent. Real Estate Investor. Current New York Life Financial Services Professional.\n\n**Education:** B.A. Business Management-University of Redlands\n\n**Community Service:** Washington Complete Count Census Committee, State Tourism Marketing Authority, Rotary District Governor (2017-2018), Founding Chairman of Prosser Boys & Girls Club, past Prosser Chamber of Commerce President, Prosser Economic Development Association (2011-2016), People for People Board Member, Prosser United Good Neighbor President (2014). Historic Downtown Prosser Board Member. \n\n**Statement:**\n\nWhile representing you in the state Legislature, I fought for common sense policies that protect agriculture, keep our communities safe, and improve accountability and transparency in government. I have a proven record of pragmatic solutions based on conservative principles and am excited to put my experience to work for you as your next Benton County Commissioner.\n\nThe county’s agricultural success is critical and I will continue to support local farms which are a cornerstone of the economy. As Commissioner, I will ensure public safety taxes are spent effectively so that law enforcement has the resources they need to deter crime and increase safety in our communities.\n\nTaxpayers deserve results and the government must spend the peoples’ money wisely. As a small business owner, I understand the economic challenges facing our communities. That is why I’m dedicated to putting county government to work to support economic development while protecting family budgets from over regulation and excessive taxes.\n\nWith a broad background in economic development, housing, financial services, and relationship-building, I want to work with you to preserve our way of life and make the future even brighter for Benton County residents.\n\nVote Bill Jenkin for Benton County Commissioner, Position 2.",
  "website": "http://electbilljenkin.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=JENKW  350&election_year=2022",
  "uuid": "JENKW  350",
  "party": "Republican",
  "electionyear": "2022",
  "office": "County Commissioner"
}