{
  "name": "Rick Miller",
  "slug": "rick-miller",
  "email": "rmiller4704@charter.net",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/120751/1552295",
  "image": "/images/candidates/rick-miller-original.png",
  "statement": "**Elected Experience**  \n2007-2018 Elected Franklin County Commissioner; 1986-1997 Washington State Potato Commissioner/Legislative Committee; 1986-1999 National Potato Council Board of Directors; Franklin County Commissioner appointed to 26 boards/committees.  \n  \n**Other Professional Experience**  \nFinancial Industry Regulatory Authority (FINRA) Registered Representative, New York Life; Life & Health Insurance License; Series 6 License; Securities Industry Essentials; WA State License Property & Casualty; Richard Miller Insurance Agency LLC; small business owner; 3rd generation farmer; Vocational Teacher; Emergency Medical Technician; Washington Agricultural and Forestry Leadership Program; NPC Chairman/Leadership Development Institute.  \n  \n**Education**  \nB.S. in Agriculture, minors in Management and Business Administration, Washington State University; A.A.S., Columbia Basin College; Vocational Teaching Certificate, Central Washington University.  \n  \n**Community Service**  \nNo Information Submitted.  \n  \n**Statement**  \nAs a lifelong resident of Franklin County, I care about what happens in our county, and I want to protect what’s working in the county and improve what’s not.  Franklin County continues to grow at a rapid pace and I want to ensure priority issues are well represented on the Board of Commissioners.  The last four years there have been controversial issues that have not been dealt with effectively. I have the experience and qualifications in county government, successful board, committee and project assignments that have included county, bi-county, state and national appointments, in water quality, criminal justice and public safety, environmental land use, and solid waste.  I have experience in working with individuals from diverse backgrounds, I have a collaborative leadership style, and I represented my constituents by making decisions in the best interest of the entire county.  With Franklin County being one of the fastest growing counties in the U.S., this puts a strain on our community, our schools, on our air and water. It is imperative that we develop growth over the next 20 years responsibly while protecting our agricultural land, natural resources, and our quality of life.\n\nPlease vote for Rick Miller for Franklin County Commissioner.",
  "website": "",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MILLR  301&election_year=2022",
  "uuid": "MILLR  301",
  "party": "Republican",
  "electionyear": "2022",
  "office": "County Commissioner"
}