{
  "party": "Democratic",
  "name": "Jan Corn",
  "slug": "jan-corn",
  "statement": "**Elected Experience**  \nAs a first-time candidate, I'll serve as the voice of all area constituents in the State House.  \n  \n**Other Professional Experience**  \nSmall business owner of Impress Salon for over 20 years  \n  \n**Education**  \nWalla Walla High School graduate; Mr. Charles College of Beauty in Walla Walla; Artistic Cosmetology School  \n  \n**Community Service**  \nBoard Member and Past President of Walla Walla Noon Rotary Club and co-chair of Peacebuilding Committee; Served on Boards of Walla Walla Chamber of Commerce, Community Council, Walla Walla Community College Cosmetology Advisory, Volunteer Hospice, American Cancer Society, Tour of Walla Walla  \n  \n**Statement**  \nAs a lifelong Walla Walla resident, small business owner, and active community member, I am diligently focused on the needs of Eastern Washingtonians. I will work for my constituents to improve access to healthcare, childcare, and affordable housing. My experience running a small business gives me unique perspective to the challenges of local business owners. I look forward to listening to the concerns of our community members to build an environment where we are all given the opportunity to thrive.",
  "electionyear": "2022",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/121132/1552398",
  "lettersyes": "[✅ Vote 2022 candidate forum](https://watch.nwpb.org/video/16th-legislative-district-de7mgg/)\n\n[✅ Vote 411 voters guide](http://onyourballot.vote411.org/candidate-detail.do?id=3753001)\n\n[✅ Vote For Business questionnaire](https://indd.adobe.com/view/e9edcc7c-a1e3-40ed-97b7-85e2152f0e69?startpage=1&allowFullscreen=true)",
  "website": "http://www.electjancorn.com",
  "image": "/images/candidates/jan-corn-original.png",
  "uuid": "CORNJ--706",
  "office": "State Representative",
  "email": "",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=CORNJ--706&election_year=2022"
}