{
  "name": "Lindsey Keesling",
  "slug": "lindsey-keesling",
  "email": "lindseyforthefifteenth@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/121128/1553146",
  "image": "/images/candidates/lindsey-keesling-original.png",
  "statement": "**Elected Experience  \n**As a first-time candidate, this will be my first elected office.\n\n**Other Professional Experience  \n**I have served as site supervisor for a homeless shelter; residential aide in a mental health facility; teacher at Washington Middle School in Yakima; and adjunct professor at Heritage University. \n\n**Education  \n**Bachelor of Arts in English/Language Arts, Heritage University, May 2016; Master of Multicultural English Language and Literature, Heritage University, May 2019\n\n**Community Service  \n**I have been actively volunteering my entire adult life: Strengthening Families Program facilitator, meals for the homeless, community clean-ups, mentoring at-risk youth, fundraising committees for various causes, and more.\n\n**Statement  \n**For far too long, people in this district have dealt with top-down leadership, in which decisions are made without the consent or cooperation of the people affected. It is time for community based servant leadership that is honest, transparent, and with integrity. We can’t get more functional systems of education, employment, housing, policing, infrastructure or healthcare without starting at the root cause: the lack of adequate resources within the communities themselves. \n\nI make a firm commitment to make no decisions without first learning from the people those decisions will affect. I offer to represent the people not by command or decree but by cooperation. Together, we can craft a better future for all in the 15th legislative district. As your state Senator, I will serve and represent all our communities and advocate for real and lasting change. We can shape the future with how we move towards it. Juntos logramos el cambio; together, we’ll achieve the change.",
  "website": "",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2022",
  "office": ""
}