{
  "party": "Independent",
  "name": "Ronni Batchelor",
  "slug": "ronni-batchelor",
  "statement": "**Elected Experience**  \nNo Information Submitted  \n  \n**Other Professional Experience**  \nNo Information Submitted  \n  \n**Education**  \nWashington State General Education Diploma, UW School of Medicine Certificate Community Health Worker, WSU School of Nursing Certified Peer Counselor, Mental Health 911 Emergency Response Certificate.   \n  \n**Community Service  \n**Homeless Community Outreach Navigation. Housing Advocate WA Low Income Housing Alliance WLIHA, Affordable Care Act In Person Assistor, Greater Columbia Accountable Community of Health Board member representing the consumer sector, WA State Office of Consumer/Recovery Partnerships steering committee, PRIDE Foundation Tri-Cities. WA State Oversight Committee Trueblood v DSHS General Advisory Council, Just Future collaborative work group equity and inclusion for low income and communities of color, Latino Community Outreach no cost services.   \n\n**Statement**  \nRonni is a first responder working in the capacity as a Mental Health Crisis Assistant. Ronni worked with Lourdes outreach program, embedded with the police departments across the Tri-Cities. Ronni's life work has been service to others and community. She has been the boots on the ground addressing the needs of others. \n\nRonni is an advocate for affordable housing. Rising rents and the overall cost of living is creating vulnerable populations to loose their stability and housing. Ronni also recognizes the importance of access to Mental Health and Healthcare services. Our community needs the ability to get the care needed when it's needed. Both mental health and healthcare accessibility is imperative across our region. Ronni will actively work to implement solutions for community health and the workforce shortages that plague our systems of care.  \n\nPublic Safety is a priority and Ronni believes that members of the community should be responsible to one another. Ensuring the safety of our communities starts by community engagement and collaboration, which is how we ensure the right solutions are formed and implemented to reduce crime and recidivism.  \n\nRonni will work hard to find the solutions we need implemented to thrive as a community together!",
  "electionyear": "2022",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/121112/1552615",
  "website": "",
  "image": "/images/candidates/ronni-batchelor-original.png",
  "uuid": "BATCR--004",
  "office": "State Senator",
  "email": "ronnibatchelor@gmail.com",
  "engagement": "[✅ Vote 2022 candidate forum](https://watch.nwpb.org/video/8th-legislative-district-m1eirq/)\n\n[✅ Vote 411 voters guide](http://onyourballot.vote411.org/candidate-detail.do?id=3754685)\n\n[✅ Vote For Business questionnaire](https://indd.adobe.com/view/e9edcc7c-a1e3-40ed-97b7-85e2152f0e69?startpage=1&allowFullscreen=true)\n\n[](rf.com)[](http://onyourballot.vote411.org/candidate-detail.do?id=3754685)[](https://indd.adobe.com/view/e9edcc7c-a1e3-40ed-97b7-85e2152f0e69?startpage=1&allowFullscreen=true)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BATCR--004&election_year=2022"
}