{
  "name": "Chris Turner",
  "slug": "chris-turner",
  "email": "turnerforsheriff2022@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/120754/1552822",
  "image": "/images/candidates/chris-turner-original.png",
  "statement": "**Elected Experience  \n**None.   \n**  \nOther Professional Experience  \n**City of Connell Police Officer, Deputy Sheriff Franklin County Sheriff’s Office, City of Connell Chief of Police.   \n**  \nEducation  \n**Connell High School, Certified Peace Officer, Northwest Law Enforcement Command College, FBI-LEEDA Leadership Trilogy, Washington State Criminal Justice Training Commission First Level Supervision Certification, Washington State Criminal Justice Training Commission Middle Management Certification, Washington State Criminal Justice Training Commission Executive Certification.   \n  \n**Community Service  \n**Treasurer and member of Bethany Baptist Church in Connell, Reserve Police Officer for the City of Connell, Volunteer Fireman for Franklin County Fire Protection District #1.\n\n**Statement**  \nAs a candidate for the Office of Sheriff in Franklin County, I want to make it clear that all people will have a voice and be treated with dignity and respect. We have a diverse culture that deserves to be treated equally. Agriculture is a mainstay and crimes in rural areas need to be investigated diligently with swift action taken to hold criminals accountable.\n\nThroughout my law enforcement career, I have strived to make a difference in the lives of the people I served. Through compassion and humility, I learned to humanize the badge. My desire is to bring a servant leadership model to the Franklin County Sheriff’s Office and empower the “boots on the ground” to make a positive impact on the citizens. The workplace should be a place where employee rights are honored and respected.\n\nI’m a firm advocate of the U.S. Constitution and government infringement on your rights will not be tolerated. I am a lifelong resident of Franklin County and am proud of our communities. I love America and our veterans. We must work together to fix our mental health system, offer help to our veterans, and help keep them out of the criminal justice system.",
  "website": "",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2022",
  "office": ""
}