{
  "name": "Ryan Lukson",
  "slug": "ryan-lukson",
  "email": "lukson4prosecutor@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/120659/1552823",
  "image": "/images/candidates/ryan-lukson-original.png",
  "statement": "**Elected Experience**\n\nRichland City Council 2018-Present, Richland Mayor January 2020-January 2022  \n  \n**Other Professional Experience**\n\nBenton County Prosecutor’s Office 2011-Present, Assistant Chief Deputy Prosecutor  \n  \n**Education**\n\nUniversity of Washington, Business-Finance 2004; Florida State University College of Law 2009  \n  \n**Community Service**\n\nDirector, Washington Counties Risk Pool Executive Committee; Richland Police Pension Board; Richland Fire Pension Board; Tri-Cities National Park Committee; TRIDEC Board; Benton Franklin Council of Governments Board; Richland Library Board  \n  \n**Statement**\n\nAs a current deputy prosecutor and former Mayor of Richland, I'm running for Benton County Prosecutor to hold criminal offenders accountable and give a voice to victims.  Born and raised in the Tri-Cities, I chose to raise my family in the community I love. I have the leadership skills necessary to keep our community safe and lead the Prosecutor's Office into the future. With violent crime on the rise across our state, it's more important than ever to elect a leader with proven experience and positive relationships with our existing prosecutors. \n\nOver the past ten years, I have built strong relationships with our law enforcement, mayors, and community organizations.  I am prepared to leverage those relationships in support of additional resources for the Prosecutor's Office to maintain the quality of life we all enjoy.\n\nPlease join retired Benton County Sheriffs Larry Taylor and Steve Keane, Benton County Coroner Bill Leach, retired West Richland Police Chief Ben Majetich, and Benton County Prosecutor Andy Miller in supporting my campaign. I have spent my career defending the rights of our law enforcement officers. I would be honored if you would join these members of our law enforcement community in supporting my candidacy.",
  "website": "http://www.luksonforprosecutor.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LUKSR  352&election_year=2022",
  "uuid": "LUKSR  352",
  "party": "Republican",
  "electionyear": "2022",
  "office": "County Prosecutor"
}