{
  "name": "Jim Raymond",
  "slug": "jim-raymond",
  "email": "jdraymond1208@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/120754/1552821",
  "image": "/images/candidates/jim-raymond-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=RAYMJ  301&election_year=2022",
  "uuid": "RAYMJ  301",
  "party": "Republican",
  "statement": "**Elected Experience**  \nFranklin County Sheriff 2015-Present.  \n  \n**Other Professional Experience**  \n33 years in law enforcement for City of Pasco as a reserve and uniformed patrol officer, Patrol Division Sergeant, Tri-City Metro Drug Task Force Supervisor, currently hold the rank of Captain, Field Operations Division Commander, Investigative Services Division Commander, Records Division Commander, Street Crimes Unit Commander, Property & Evidence Division Commander, Special Investigations Unit Commander, and interim Police Chief.  \n  \n**Education**  \nA.A. Degree in Criminal Justice from CBC; attended Northwest Law Enforcement Command College; certifications in Law Enforcement Executive and Middle Management.  \n  \n**Community Service**  \nS.A.R.C. Board Trustee, Tri-Tech and CBC Curriculum Boards, Department of Correction Work Release Screening Committee, Rotarian.  \n  \n**Statement**  \nOver the span of the past eight years, I and the Sheriff’s Office have made great strides in advancing our mission and vision in the community, providing law enforcement services with honor, integrity, and trust. A few milestones which we have reached since beginning this journey in 2015 include the following: implemented 21st century policing model policy and procedures for the Sheriff’s Office and Corrections Division, removed the Corrections Facility from federal decrees/lawsuits, developed law enforcement partnerships in bi-county regions, developed community partnerships in an effort to better serve our residents, acquired dual WASPC accreditation in Sheriff’s Office and Corrections Division, and developed and implemented extensive training platforms for all our employees.  \n  \nIf re-elected, I will focus my efforts on realizing the following: collaborating with community to build Behavioral Health Recovery Center with complete wrap-around services, developing a Benton-Franklin County Sheriff Posse/Search and Rescue program, aiding in the development of an E-911 Bi-County Public Facilities Organization with enhanced radio platforms for the region, reaching dual re-accreditation and certification for the Sheriff’s Office. and developing a succession-transition plan for the next incoming sheriff in 2027.",
  "electionyear": "2022",
  "office": "County Sheriff",
  "website": "http://jimraymondforsheriff.com"
}