{
  "name": "Nikki Torres",
  "slug": "nikki-torres",
  "email": "NikkiTorresforStateSenate@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/121128/1552856",
  "image": "/images/candidates/nikki-torres-original.png",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "statement": "**Elected Experience**  \nCity of Pasco Councilmember, Elected  \n  \n**Other Professional Experience**  \nPast President of Tri-Cities Hispanic Chamber of Commerce, member of Association of Washington Business Grassroots Alliance, a past Board Member of Tri-Cities Community Health, Visit Tri-Cities, and the Kennewick Police Department Foundation. Past appointment to Childcare Collaborative Task Force.  \n  \n**Education**  \nMaster’s Degree in Business Administration from University of Phoenix. Inducted into the National Society for Leadership and Success, an Honor Society.  \n  \n**Community Service**  \nI have served on numerous committees such as Latino Heritage Mural, Dia De Los Muertos Scholarship Fun Run, and classroom volunteer for Junior Achievement.  \n  \n**Statement**  \n\nI will work hard to bring solutions to challenges facing all people in my district. I will be an advocate for our rural communities on the critical issues of water rights and agriculture. I will prioritize quality education and safe schools for our children. I will support law enforcement, mental health services, and affordable housing measures to ensure our communities can thrive. I will fight for responsible state budgets, with the interests of our district in mind,  and vote against wasteful spending and unfair taxes, so our families and small businesses can keep more of their hard-earned dollars.\n\nI am incredibly honored by Sen. Honeyford’s endorsement. He has been a strong advocate for eastern Washington interests for decades in the legislature. As your Senator, I will listen closely to you and will seek to find solutions to your concerns. I would be honored to represent you as Senator for the 15th Legislative District.",
  "electionyear": "2022",
  "office": "",
  "website": "http://www.NikkiTorresforWA.com"
}