{
  "name": "Clint Didier",
  "slug": "clint-didier",
  "email": "",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/120751/1552296",
  "image": "/images/candidates/clint-didier-original.png",
  "statement": "**Elected Experience  \n**Franklin County Commissioner 2018-2022; Chairman Franklin Co. Republican Party 2019-2022.\n\n**Other Professional Experience  \n**2000 -2008 – Presidential Appt. to Federal Farm Service Agency.\n\n**Education  \n**1977 Graduate of Connell High School; AA from Columbia Basin College; BA in Administration of Justice from Portland State College.\n\n**Community Service  \n**Member of Franklin County Republican Party; Offensive Football Coach at Connell High School for ten years; Sponsor of Fighting Children’s Cancer Golf Tournaments.\n\n**Statement  \n**I was born and raised on an irrigated farm near Eltopia in Franklin County. I presently farm with my wife, Kristie, three sons and a daughter north of Pasco. Besides being a hands-on farmer, I also own and operate an excavation company. As a Franklin County Commissioner, I have worked to make Commissioner meetings more open and transparent. We now conduct all meetings virtually and have a quarterly night meeting to accommodate anyone unable to attend. I worked to create a citizen panel to help with the drawing-up of a redistricting map for Franklin County. Since becoming Commissioner, the Franklin County Emergency Fund is being replenished and previous shifting of Road Dept. funds to the General Fund has been curtailed. The Drug Needle Share was removed from Franklin County. Presently, I am concerned with Franklin County Roads and movement of people and goods; escalating property assessments; upholding your constitutional rights and your choice during any pandemic or crisis. I believe we should return to Voter/ID/Precinct voting.\n\nI would like to continue to serve Franklin County by making sure our county is fiscally responsible while being open and transparent to the public.",
  "website": "",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=DIDIC  301&election_year=2022",
  "uuid": "DIDIC  301",
  "party": "",
  "electionyear": "2022",
  "office": "County Commissioner"
}