{
  "party": "Republican",
  "name": "Michael Alvarez",
  "slug": "michael-alvarez",
  "statement": "**Elected Experience**  \nMayor, City of Richland, Review and Manage a $320 million dollar plus city budget, Council Liaison Planning Commission, Economic Development, Code Enforcement, and much more.  \n  \n**Other Professional Experience**  \nU.S. Marine Corp. Veteran, Business Owner Mortgage Company 26 years, Faculty, Master Instructor teaching Finance, Advanced Business Management, Consumer Protection and Code of Ethics to professional organizations throughout Washington. Current Finance Officer U.S. Coast Guard Auxiliary, Vice President funding development Boy Scouts of America, Past President and Treasurer TCAR.  \n  \n**Education**  \nBachelor of Business Administration, Management NMSU  \n  \n**Community Service**  \n_Community Service Award Winner_, Commissioner for Richland Parks and Recreation Commission, Fund Raiser Safe Harbor, National Child Identification Program.  \n  \n**Statement**  \nI will continue to use my Skills and Experience to improve the _Quality of Life_ for our senior citizens, youth, families, and veterans. It is written the ideal county commissioner should have experience in Finance, Budgeting, Communications, and Personnel. I am the only candidate that has the education and Extensive Financial and Business Experience needed to help ensure that your taxpayer money is being used in the best possible way, and taxes are NOT increased unnecessarily. I have a proven record of saving taxpayer’s 1000’s of dollars in taxes annually. I support our Police and Fire Fighters making sure they have the proper tools to ensure _Exceptional Public Safety_. I am heavily supported by both law enforcement and firefighters. I have fostered strong relationships with the local business community and support _Smart Economic Development_. I will continue to listen to the needs and concerns of our citizens. My pledge to you is to be Present, Accountable, and Transparent to all citizens of Benton County. I have been married 32 years to my wife Gina, have two children, both graduates of Richland High and WSU! We have called Benton County home for 30 years. Endorsed by the Benton County Republican Party.",
  "electionyear": "2022",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/120662/1552277",
  "website": "http://www.VoteMike.com",
  "image": "/images/candidates/michael-alvarez-original.png",
  "uuid": "ALVAM  352",
  "office": "County Commissioner",
  "email": "mike@votemike.com",
  "engagement": "[✅ Vote 2022 candidate forum](https://watch.nwpb.org/video/benton-co-commr-prosecuting-atty-franklin-co-commr-vhx1vw/)\n\n[✅ Vote 411 voters guide](https://onyourballot.vote411.org/candidate-detail.do?id=3750158)\n\n[✅ Vote For Business questionnaire](https://indd.adobe.com/view/e9edcc7c-a1e3-40ed-97b7-85e2152f0e69?startpage=1&allowFullscreen=true)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=ALVAM  352&election_year=2022"
}