{
  "name": "Norma Rodriguez",
  "slug": "norma-rodriguez",
  "email": "Manager@ElectJudgeNormaRodriguez.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/121229/1553030",
  "image": "/images/candidates/norma-rodriguez-original.png",
  "statement": "**Legal/Judicial Experience**  \nPresiding Criminal Superior Court Judge, Superior Court Judge's Association Board of Trustees, Past Chair Washington State Bar Association Litigation Section, Judge Pro Tempore, 29 years litigation experience.  \n  \n**Other Professional Experience**  \nEstablished her firm in 1994 which dealt with criminal law, personal injury, labor and industry, medical malpractice, family law, bankruptcy, civil liberties, and appeals.  Experience in jury trials, arbitration, mediation, and motion practice.\n\n**Education**  \nBachelors Gonzaga University, Law Degree Gonzaga Law, Pasco HS.  \n  \n**Community Service**  \nFounding team member of Adult Drug Court, former board member Benton Franklin Legal Aid, Tri-City Prep, Circle of Hope. YMCA Mock Trial Coach, Youth and Justice Forum volunteer, young lawyer mentor.  \n  \n**Statement**  \nNorma Rodriguez, Superior Court Judge and respected local attorney for over 29 years, has the extensive and well-balanced legal experience to continue serving the people of Benton and Franklin Counties. Norma, her husband Mario, and her five children are proud to call this community their home.  \n  \nNorma grew up understanding the importance of community, hard work, and respect for the law.  Upon completing her education, she opened her own private law practice in 1994.  Her experience is tailor-made for the demands of the Superior Court bench.  Unlike her opponent, Norma frequently tried cases in Superior Court.  \n  \nNorma has been a leader in the legal and local community (see biography). As a board member for Tri-City Prep, YMCA Mock Trial coach, and volunteer for the Tri-Cities Youth and Justice forum, Norma has a demonstrated commitment to students and their development.    \n  \nNorma has the experienced leadership and the committed dedication we can trust. She pledges to continue treating all people equally and impartially, and to use the rule of law to guide her decisions. She will not allow politics to interfere in the judicial process. Norma would be honored to receive your vote and continue to serve as your Superior Court Judge.",
  "website": "http://KeepJudgeNorma.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=RODRN--548&election_year=2022",
  "uuid": "RODRN--548",
  "party": "",
  "electionyear": "2022",
  "office": "Superior Court Judge"
}