{
  "party": "Republican",
  "name": "Matt Boehnke",
  "slug": "matt-boehnke",
  "statement": "**Elected Experience**  \nRepresentative Boehnke is our current State Representative, we elected him in 2018.  Previously, he served on the Kennewick City Council.  He is the ranking Republican on the Community and Economic Development Committee, and sits on the House Appropriations, and Environment and Energy committees.  \n  \n**Other Professional Experience**  \nMatt is a retired U.S. Army Lt. Colonel, small business owner, and currently heads the Cyber Security Department at Columbia Basin College.  \n  \n**Education**  \nMAS, Embry-Riddle Aeronautical University, BA, Eastern Washington University, graduated from Kamiakin HS.   \n  \n**Community Service**  \nSunrise Rotarian, American Legion, National Rifle Association, Veterans of Foreign Wars, former Arts Commissioner, and current member of the Washington Education Association.  \n  \n**Statement  \n**Representative Matt Boehnke is one of our community’s most trusted leaders, a solid conservative who brings people together to truly represent us and the values of the Tri-Cities.  He is our best choice for State Senator.\n\nMatt and his wife Dawn are lifelong residents of the Tri-Cities, and their families have lived here for generations.  They have two grown sons, Matthew and Brandon, and attend Bethlehem Lutheran Church. \n\nMatt will continue to lead on our community’s top priorities: energy, economy, and education. The Tri-Cities is a world leader in clean energy, Matt has defended this vital local industry, including being an advocate for Hanford.  Our economy is still recovering from the Covid shutdowns, Matt has fought for lower taxes and to help small businesses.  Education is vital to the future of our children and state, Matt has defended local control and fought to make sure our kids get their fair share of state education dollars.  \n\nThe extreme politics of Seattle require a leader like Matt Boehnke to stand up for Tri-City values in Olympia.  Matt’s record in the State House proves he has the skills, courage, and work ethic to be our best choice for the State Senate.",
  "electionyear": "2022",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/121112/1552616",
  "website": "http://mattforwa.org",
  "image": "/images/candidates/matt-boehnke-original.png",
  "uuid": "BOEHM2 336",
  "office": "State Senator",
  "email": "matt@mattforwa.org",
  "engagement": "[✅ Vote 2022 candidate forum](https://watch.nwpb.org/video/8th-legislative-district-m1eirq/)\n\n[✅ Vote 411 voters guide](http://onyourballot.vote411.org/candidate-detail.do?id=3754685)\n\n[✅ Vote For Business questionnaire](https://indd.adobe.com/view/e9edcc7c-a1e3-40ed-97b7-85e2152f0e69?startpage=1&allowFullscreen=true)",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BOEHM2 336&election_year=2022"
}