{
  "name": "George Cicotte",
  "slug": "george-cicotte",
  "email": "george4superiorcourt4@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=877#/candidates/121229/1553031",
  "image": "/images/candidates/george-cicotte-original.png",
  "statement": "**Legal/Judicial Experience**  \nPrivate law practice 1995-present - litigation and advice primarily representing employers in complex labor, tax, and corporate matters. Self-employed in Kennewick since 2002. Endorsements on website.  \n  \n**Other Professional Experience**  \nInvestment advisor at Petersen Hastings Investment Management 1991-1992; Consulting pension actuary 1989-1991\n\n**Education**  \nJD, Brigham Young University 1995; BA, University of Pennsylvania 1989\n\n**Community Service**  \nKennewick Police Foundation Board 2020-present; Chaplaincy Health Care Board 2021-present; BSA Blue Mountain Council President 2017-2019, Council attorney 2010-2016 and 2020-present; BSA Troop 219G Assistant Scoutmaster 2019-present; Benton Franklin United Way Board 2009-2011; Columbia Valley Daybreak Rotary 2002-present (President '09-'11); Candidate for U.S. House of Representatives 2014\n\n**Statement**  \nImpartial, Principled, Capable – George for Judge! George has practiced law for over 25 years, the past 20 years in the Tri-Cities. George and his wife Wendy, (born at KGH and raised in Richland), returned here in 2002 to raise their family. The Cicotte children have all graduated from public school in the Tri-Cities, and the youngest will graduate in 2025.  \n  \nOther attorneys and judges have formally recognized George as having achieved the highest standards of legal ability and ethical conduct, resulting in the highest-possible ratings: Distinguished AV® by Martindale and “10.0, Superb” by Avvo.com.  \n  \nGeorge will be an impartial judge and a strong supporter of the Washington and U.S. Constitutions. George will be completely dedicated to Equal Justice Under Law, with faith in our national motto, In God We Trust. He will not be influenced by any special interests. His background complements the other judges’ talents.  \n  \nIf you want to let Governor Inslee pick judges for us, then vote for the incumbent he appointed. However, if you think we, the voters of Benton and Franklin Counties, deserve to pick our own judges, then George respectfully asks for your vote for Superior Court, Position 4.",
  "website": "http://George4SuperiorCourt4.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=CICOG--108&election_year=2022",
  "uuid": "CICOG--108",
  "party": "",
  "electionyear": "2022",
  "office": "Superior Court Judge"
}