{
  "name": "Nino Kapitula",
  "slug": "nino-kapitula",
  "email": "ninoforrichland@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127237/1566830",
  "image": "/images/candidates/nino-kapitula-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=KAPIN--144&election_year=2023",
  "uuid": "KAPIN--144",
  "party": "",
  "statement": "**Elected Experience**\n\nNone\n\n**Other Professional Experience**\n\nNino is a former insurance professional at State Farm where she gained experience in sales, marketing, communications, conflict resolution, behavioral science, negotiations, and management. In 2013 Nino decided to dedicate herself to family. Nino and her husband have built successful local businesses, where she acquired experience in budgeting and financial planning. Nino serves as director for project development and design for Providence Land LLC. Together they continue to expand their vision and serve the needs of their community.\n\n**Education**\n\nPasco High School\n\n**Community Service**\n\nCo-founder/Board member for Dream Again Hope and a Future Foundation that works with orphanages in third world counties.\n\n**Statement**\n\nGrowing up in a single parent household in the socialist communist country of Moldova, the poorest country in Europe, I stood in bread lines so we could eat. My mother sought a better life for her daughters and brought us to the United States when I was 13. I now have school age children; I care about our schools. My mother showed me how a dream for a better future and hard work leads to success. I will promote schools that are willing to put in the work so our children receive the skills and academics they need for success.\n\nWashington parents are faced with fear for their children’s future. We should have the right to know what is being taught in the classroom, fully transparent about teaching and learning materials. We should have the right to speak up when we disagree. I will work to close the gap between parents and teachers to rebuild a broken trust. I know what freedom is, I know how to work hard, and I love this country in all its diversity. \n\nChildren are the future! Let us stand united in raising Bright Children for a Bright Future!  \n  \n  \n\nEndorsed by Benton County Republican Party",
  "electionyear": "2023",
  "office": "Richland School Board Pos 3",
  "website": "https://www.ninoforrichland.com/"
}