{
  "name": "Kari Williams",
  "slug": "kari-williams",
  "email": "kari4rsd@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127239/1566832",
  "image": "/images/candidates/kari-williams-original.png",
  "pdc_url": "",
  "uuid": "WILLK--352",
  "party": "",
  "statement": "**Elected Experience**\n\nCurrent Richland School Board Director #4 and Current Richland School Board President.\n\n**Other Professional Experience**\n\nElementary School Teacher, Member of the Instructional Materials Committee (IMC) for Richland School District, Co-chair for Richland Citizens for Good Schools during 2013 bond issue campaign, continuing classroom volunteer.\n\n**Education**\n\nMaster of Education (M.Ed.) in Teaching and Learning from the University of Utah, Bachelor of Science in Psychology and Bachelor of Science in Human Development and Family Studies both from the University of Utah, current Washington State Teaching Certificate.\n\n**Community Service**\n\nLeader within her church’s women and youth organizations and actively involved in service opportunities through her church.\n\n**Statement**\n\nPlease join us in reelecting Kari Williams!\n\nEducation is Kari Williams’ lifelong passion. Kari, the current Richland School Board President, earned her Master’s degree in Education while working as a public school teacher. Now a stay-at-home mom of five children who attend elementary, middle, and high schools within the Richland School District, Kari is deeply invested in the success of our schools. Kari’s first priority has been and will always be students.\n\nKari believes parents are vital for student academic success. During the frustrating COVID shutdowns, she was the only board member who gave a voice to families by fighting to open our schools to give our students an in-person learning option. Kari will continue to champion her initiative to overcome COVID learning losses by prioritizing every child reading on grade level. She will also continue to support our community’s family values as she pushes the district to keep our classrooms a place where all children feel safe to learn and where the instruction is focused on teaching our children how to think— not what to think.\n\nSupport student success by voting for Kari!",
  "electionyear": "2023",
  "office": "Richland School Board Pos 4",
  "website": "http://www.kari4rsd.com"
}
