{
  "name": "Peter Harpster",
  "slug": "peter-harpster",
  "email": "electpeterharpster@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125361/1563024",
  "image": "/images/candidates/peter-harpster-original.png",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "statement": "**Elected Experience**  \nWith your vote.  \n  \n**Other Professional Experience**  \nI have spent the last 13 years working as a planner and project manager in the U.S. Air Force, and homebuilding, agribusiness, and land development sectors. I received my Lean Six Sigma certification from the Juran Institute in 2021. In my role as a project manager with Aqtera Engineering, I get the unique opportunity of helping to build and design communities within the City of Pasco.   \n  \n**Education**\n\nPasco High School, 2009. Columbia Basin College, BA, Applied Management, 2023.  \n  \n**Community Service**  \nCommissioner, Franklin County Planning Commission. Member, Pasco School District Instructional Materials Committee. Coach, Three Rivers Soccer Club.  \n  \n**Statement**  \nI am troubled by what I see happening in our community. Drug use is becoming more commonplace, the unhoused population grows and wanders the streets of our city, mental health issues continue to increase in our community, and entire groups of our population cannot afford adequate housing. These are complex issues that require well-coordinated solutions. Our two-party system must set aside its differences to regain control of our communities and provide help to those in dire situations, protection to those who need it, accountability for criminals, and justice for victims. The same low-crime, safe community that I grew up in is the same community that I want my kids and your kids to grow up in. I'm willing to put in the work and effort to make that happen because I believe there is hope for our future yet. I humbly ask for your vote.",
  "electionyear": "2023",
  "office": "",
  "website": ""
}