{
  "name": "Irving Brown, Sr.",
  "slug": "irving-brown-sr",
  "email": "mrbrownforcitycouncil3@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125363/1563028",
  "image": "/images/candidates/irving-brown-sr-original.png",
  "statement": "**Elected Experience**  \nCurrent appointed Councilmember    \n  \n**Other Professional Experience**  \nTeam Leadership; Project Management;  Conflict Resolution; Labor Law Compliance; Training & Development; Staffing & Scheduling Benefits & Payroll; Organizational Development   \n  \n**Education**  \nBachelor of Science in Business Management, _In Progress;_ Columbia Basin College_;_ Pasco, WA; Certifications; Senior Certified Professional (SHRM, SCP), _In Progress;_ Human Resources Certification Institute (HRCI); Diversity and Inclusion in the workplace  \nEssec Business School- _Completed 2020_  \n  \n**Community Service**\n\nSupport varies youth program; Support  and encourage continued education; Support and work with correctional facilities to rebuild those that need encoragement to rise in their community. Address food deprivation in our communities  \n  \n**Statement**  \nMy name is Irving Brown, and I am running to stay on the Pasco City Council for District 3. I have lived in Pasco since 2008 and serve as Human Resources Manager at Oasis Farms in Prosser, WA.\n\n  \nPasco stands at a crossroads. With a booming population, we are facing important decisions about planning to manage this future growth wisely. Our economy remains one of the fastest growing in the state, which is attracting more people; this is an opportunity for an even brighter future for this city. I am running because I firmly believe in Pasco and the promise of that future while continuing work on our long-term plans.  \n  \n\nIf elected, I will continue strengthening our city’s economy with pro-growth policies and planning that will encourage development evenly across our city. I will promote ways to save money in our budget without compromising vital services. I want to maintain a culture of equity, inclusion, and empowerment in our local government. We can uphold that culture by restoring the Diversity, Equity, and Inclusion (DEI) Committee.\n\nLet’s build our future together. I respectfully ask for your vote. For more campaign info or to volunteer, please visit my website at: mrbrownforcitycouncil3.com.",
  "website": "http://mrbrownforcitycouncil3.com",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BROWI--307&election_year=2023",
  "uuid": "BROWI--307",
  "party": "",
  "electionyear": "2023",
  "office": "City Council Member"
}