{
  "name": "Lisa Peppard",
  "slug": "lisa-peppard",
  "email": "electlisapeppard@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127225/1564918",
  "image": "/images/candidates/lisa-peppard-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=PEPPL--906&election_year=2023",
  "uuid": "PEPPL--906",
  "party": "",
  "statement": "**Elected Experience**\n\nPTO Secretary, Cottonwood Elementary; PTO Secretary, Desert Hills Middle School\n\n**Other Professional Experience**\n\nRegistered Nurse, Kadlec Regional Medical Center; Overload Paraeducator, Cottonwood Elementary; Instructor, Kennewick Community Education; Owner of local small business, Artful Virgo\n\n**Education**\n\nBachelor of Science in Nursing, magna cum laude; Seattle University\n\n**Community Service**\n\nClassroom and PTO Volunteer, Washington Elementary, Kennewick; Classroom, Library, and PTO Volunteer; Cottonwood Elementary, Kennewick; PTO Volunteer; Desert Hills Middle School, Kennewick; Booster Club Volunteer; Academy of Children’s Theater, Richland; Speech and Debate Volunteer and Judge; Kamiakin High School, Kennewick\n\n**Statement**\n\nI’m Lisa Peppard, a resident of Kennewick for nearly 14 years. Both of my children attended Kennewick schools from the time they were in kindergarten and first grade. During that time I volunteered hundreds of hours in their schools. I have been attending school board meetings for over a decade because I care deeply about all children in my community. This makes me uniquely qualified to become the next Kennewick School Board Director in Position 5.\n\nOne thing we all agree on is that we want our children to thrive. I will work with civility to find a sensible approach to address the issues facing the students and families of the Kennewick School District. Partisanship has no place in our schools. Decisions should be made using the best data available to serve everyone.\n\nThe district has wisely prioritized making students feel safe, known, and valued. The percentage of KSD students reporting that they feel safe continues to fall short of the goal. In order to tackle issues like low graduation rates and performance scores, we must address safety first. My experience as a registered nurse will be a great asset in bringing a compassionate approach to this job.",
  "electionyear": "2023",
  "office": "School Director",
  "website": ""
}