{
  "name": "Ryan Whitten",
  "slug": "ryan-whitten",
  "email": "electryanwhitten@protonmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125227/1562871",
  "image": "/images/candidates/ryan-whitten-original.jpg",
  "pdc_url": "",
  "uuid": "WHITR--010",
  "party": "",
  "statement": "**Elected Experience**\n\nAppointed to City Council in January of 2023\n\n**Other Professional Experience**\n\nRyan Whitten served 8 years in the U.S. Navy as an Avionics Technician working on F/A-18 Hornets.  He now lives in historic Richland with his wife, where he has continued his career as an instrument tech, working for Hanford and now Energy Northwest.\n\n**Education**\n\nAssociate of Arts from CBC\n\n**Community Service**\n\nNo Information Submitted\n\n**Statement**\n\nI care deeply about our community here in Richland and as a public official my main concerns are Economy and Accountability. Richland is growing rapidly, and is very limited in terms of space for outward expansion. Revitalizing older neighborhoods and economic centers while preserving their history and charm should be a priority moving forward. Working towards innovative solutions for traffic problems and pedestrian safety, especially during commute times, is another top priority.\n\nSafety is a major concern across the country. I want Richland to continue to be a place where residents feel comfortable raising their families. I support our Police Department’s efforts to protect and serve. I do not support legislation that interferes with reasonable and necessary police procedures.\n\nI support nuclear energy and technology and hope to help Richland become the jewel of safe, affordable, and sustainable energy in the Pacific Northwest.\n\nI’d greatly appreciate your vote so I can fight for Richland, to keep our community thriving and accountable to its citizens!",
  "electionyear": "2023",
  "office": "Richland City Council Pos 7",
  "website": "http://electryanwhitten.com"
}
