{
  "name": "Fred Brink",
  "slug": "fred-brink",
  "email": "ftbrink@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125231/1562876",
  "image": "/images/candidates/fred-brink-original.png",
  "pdc_url": "",
  "uuid": "BRINF 353",
  "party": "",
  "statement": "**Elected Experience**\n\nCouncilmember and Mayor pro tem, City of West Richland; Board of Commissioners, Benton County Fire Protection District #4; Board of Directors, Association of Washington Cities\n\n**Other Professional Experience**\n\nU. S. Navy Surface Warfare Officer; Special Agent-in-Charge, Federal Bureau of Investigation (FBI); Program Manager, Pacific Northwest National Laboratory\n\n**Education**\n\nBachelor of Science, United States Naval Academy; Post-Graduate Studies in Public Administration, Rutgers University; FBI Senior Executive Education Program, Kellogg School of Management, Northwestern University\n\n**Community Service**\n\nActive member of Washington State’s Emergency Management Council and Forensic Investigations Council, Benton County Law and Justice Council and several Association of Washington Cities committees\n\n**Statement**\n\nFred Brink has more than 40 years of combined military, law enforcement and public service experience as an officer in the U. S. Navy, a senior executive with the FBI, and as an elected or an appointed official at state, county and local levels. He is actively committed to serving our nation, the State of Washington and our local community.\n\nFred possesses the background and leadership experience to responsibly manage your taxpayer funds, explore new ways to address city issues, and to help ensure the City of West Richland remains a safe, prosperous, family friendly and welcoming community. As a champion of local control, he will continue working closely with officials at the state and county levels, his fellow city councilmembers and community residents to find viable solutions to the challenges faced in housing, public safety and policing, and homelessness. With your support, Fred will be honored to continue serving as your advocate and representative on the West Richland City Council.",
  "electionyear": "2023",
  "office": "West Richland City Council Pos 6",
  "website": "http://fredbrink.org"
}