{
  "name": "Joshua Short",
  "slug": "joshua-short",
  "email": "short4richland@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125227/1562872",
  "image": "/images/candidates/joshua-short-original.png",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "statement": "**Elected Experience**  \nThis is my first time running for public office.  \n  \n**Other Professional Experience**  \nI've worked for several local employers, including PNNL, Mid-Columbia Engineering, and SIGN Fracture Care. I'm also the owner of a small business, Short Industries.  \n  \n**Education**  \nI graduated from Kennewick High in 2004 as Valedictorian with a full International Baccalaureate diploma. I studied business administration and applied technology at Illinois Institute of Technology before transferring home to finish a degree in computer science at WSU-TC.  \n  \n**Community Service**  \nHelped launch IIT Entrepreneurship Academy; former board member of Hanford Learning; assisted with Bridging the Digital Divide; volunteered for TEDxRichland; Tres Rios Community Land Trust board member.  \n  \n**Statement**  \nI was born in Richland, and I've lived other places, but this is my chosen home. I'm running because I want to be actively involved in the stewardship of this phenomenal place.  \n  \nA community is its people -- this council position entails decisions around appointments, budgets, contracts, ordinances, and policies that affect the quality of life of the entire community. It is my desire to carry out the duties of this position in accordance with the values, vision and mission of Richland. I want to ensure a \"safe and family-friendly community that welcomes diversity\". I want to sustain our \"excellence in technology, medicine, education, recreation, tourism, and citizen participation\".  \n   \nAs a resident of North Richland, I offer a voice for an an under-represented part of our community. I love our parks and public spaces, and I care deeply about the livability and ecological health of our region.  \n  \nI look forward to the opportunity to serve and to respond to the needs of the community.",
  "electionyear": "2023",
  "office": "",
  "website": ""
}