{
  "name": "Rosa Torres",
  "slug": "rosa-torres",
  "email": "rosaforpascosb@outlook.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127371/1565069",
  "image": "/images/candidates/rosa-torres-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=TORRR--291&election_year=2023",
  "uuid": "TORRR--291",
  "party": "",
  "statement": "**Elected Experience**  \nNo information submitted  \n  \n**Other Professional Experience**  \nProven and insightful leader with deep finance expertise and experience at well-known organizations including Boeing Company, Ford Motor Company, Starbucks Coffee Company, Microsoft, Elite Construction and Pacific Northwest National Laboratory.  \n  \n**Education**  \nPasco School District K-12 educated, followed by a bachelor’s degree in accounting from Gonzaga University, and a Master of Business Administration from the University of Notre Dame. Continue learning through extensive leadership, management, and self-development opportunities in my professional career and personal life.  \n  \n**Community Service**  \nCurrently serve on the Pasco School Board, Pasco Planning Commission and Washington State School Directors Association Resolutions Committee. Past mentor with Junior Achievement and Communities in Schools.  \n  \n**Statement**  \nI’m honored to run for the Pasco School Board at large position. Driven by personally experiencing the transformative power of education, I’m a passionate advocate for quality public education because it can unlock doors, empower individuals, and uplift our entire community.  \n  \nI believe a strong, vibrant community is built through active interest, engagement, and collaboration. As a board member, I’ll work alongside families, staff, fellow board members and our community to address our schools’ needs and foster a positive, safe, and inclusive learning environment for all students. I’ll use the strategic leadership, financial discipline and relationship building skills gained from my education and professional experience in service to our community.  \n  \nRepresentation matters. As someone who grew up in this community and is a product of the Pasco School District, I understand the challenges and aspirations of our students. I’m a committed and strong voice for the diverse perspectives and experiences within our community, ensuring that board actions reflect the needs and dreams of all our students and families.  \n  \nI’m ready to serve as an advocate for all our students and community. Together, let’s build a brighter future for our students and ensure that every child receives the education they deserve.",
  "electionyear": "2023",
  "office": "Pasco School Board Pos 4",
  "website": ""
}