{
  "name": "Chelsie Beck",
  "slug": "chelsie-beck",
  "email": "Beck4rsd@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127237/1566829",
  "image": "/images/candidates/chelsie-beck-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=BECKC--065&election_year=2023",
  "uuid": "BECKC--065",
  "party": "",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nChemist (2012-current)  \n  \n**Education**  \nPh.D in Chemistry from Washington State University, M.S. in Chemistry from Washington State University, B.S. in Chemistry from University of West Florida  \n  \n**Community Service**  \nDestination Imagination Coach, YMCA baseball coach, Cub Scout Pack Treasurer, White Bluffs Elementary classroom volunteer  \n  \n**Statement**  \nI am running for school board because I believe we have a responsibility to provide our youth with the skills they need to succeed in life. My goal is to return the focus back to education and help prepare our students for the future.  \n  \nMy appreciation for public education started at a young age, watching my mother work hard to move from paraeducator, to Hanford High School teacher, to Special Education administrator. I have two children attending our schools, so the quality of our schools is very important to me and my family. I live in Richland because of the reputation of our school district.  \n  \nMy goal is to work with parents, students, and school staff to understand the needs of all students and work to support them. I will approach this with an open mind and I look forward to learning from you how best to support our students. I understand that there is a limited budget. In my job I have experience managing multi-million-dollar budgets. I will do my best to listen to you, prioritize, and make fiscally responsible decisions.  \n  \nPlease join me in focusing on what is best for our kids.",
  "electionyear": "2023",
  "office": "Richland School Board Pos 3",
  "website": ""
}