{
  "name": "Leo Perales",
  "slug": "leo-perales",
  "email": "leo4council@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125363/1563029",
  "image": "/images/candidates/leo-perales-original.png",
  "pdc_url": "",
  "uuid": "PERAL  337",
  "party": "",
  "statement": "**Elected Experience**  \nLooking to restore the minds and hearts of my fellow elected officials so that we will work for you.   \n  \n**Other Professional Experience**  \nLeo is the General Manager/Code Safety Professional for Atlas Technical Consultants and has been the lead inspector on state transportation projects as well as commercial, large industrial, and agricultural projects.    \n  \n**Education**  \nHeritage University-2012-Graduated Summa Cum Laude; Columbia Basin College-2008-Associate of Arts Degree  \n  \n**Community Service**  \nChairman of the Hapo Center Advisory Board, Tri-Cities Community Work Group on Community Policing, Tri-Cities Special Investigations Unit(SIU)- Community Representative, Pasco Fiery Foods Festival Volunteer, Vice Chair-Kennewick Housing Authority; Vice Chair-Benton County Planning Commission, Kennewick Improvement Board and many more.  \n  \n**Statement**  \nI’m running for Pasco City Council because I want our kids, and your grandchildren to have the same opportunities that we’ve had here in Pasco. I want our children to be able to ride their bike outside safely. I want our city to be the safest in Washington, with well-funded police, fire, and public works services. I want our families to be able to go to downtown Pasco and feel safe and not worry about illicit and open drug use and homelessness that has invaded our public spaces. I’m running because I want to pass policies that will strengthen our Pasco families. I want us all to see progress and a building of community across our whole city so that we can live up to our city's motto of One Pasco. I’m running because we need reform at the Tri-City Animal Shelter; that we address the fees and regulations that have made housing unaffordable and that we humanize local government to create a business and developer friendly city hall that facilitates growth and not obstruct it. I’m proud to have the endorsement of many community leaders and small businesses and with a servant’s heart, I humbly ask for your vote.",
  "electionyear": "2023",
  "office": "",
  "website": "http://www.leo4pasco.com"
}