{
  "name": "Kate Moran",
  "slug": "kate-moran",
  "email": "Kateforwestrichland@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125232/1562878",
  "image": "/images/candidates/kate-moran-original.jpg",
  "pdc_url": "",
  "uuid": "MORAK  353",
  "party": "",
  "statement": "**Elected Experience**\n\nWest Richland City Council 2020-2023\n\n**Other Professional Experience**\n\nBoard member, Benton Franklin Council of Governments; Nuclear Facility Specialist, Pacific Northwest National Laboratory; Navy Combat Veteran\n\n**Education**\n\nAdvanced Certificate of Municipal Leadership, Association of Washington Cities; West Richland Police Department Citizens Academy; B.S in Nuclear Engineering Technology, Excelsior University\n\n**Community Service**\n\nPast president, West Richland Community Care Foundation; West Richland Planning Commission; Past board member, West Richland Police Department Community Advisory Board; Richland Rotary Club Member; Programming committee, Columbia Basin Badger Club\n\n**Statement**\n\nServing on council these last four years has been an honor. We've accomplished many of my goals to improve transparency and accountability: posting council meeting videos online, allowing more public comments during meetings, strengthening zoning codes, and sending out surveys for better community input. I ask for your vote so we can face the upcoming challenges together.\n\nWest Richland is rapidly expanding to a mid-sized suburban city. Our growth should help us meet our needs without losing what makes West Richland feel like home. I’ll continue to push for fiscally responsible solutions and look for alternative means to fund projects without raising taxes, so our city can meet our needs for a balanced budget, which includes maintaining and building infrastructure like streets and water lines while also preserving and improving our parks and public safety.\n\nWe must treat established neighborhoods fairly when building infrastructure. Future growth should include updating streets and sidewalks within these areas. I'll continue working to build a stronger, resilient West Richland, accountable to all who live here.\n\nWest Richland is the best place to live, work, and raise a family! Re-elect me to continue moving forward while preserving what matters. Go to [www.KateForWestRichland.com](https://urldefense.com/v3/__http:/www.KateForWestRichland.com__;!!IJPaFG-91URQ!Jjrxvieiw7esqVRZPyXFifCpJYZ7jgOullFnpwqKUsblFwT358NnJNhFqFoOoFaeN-RaKhWvsG-n_CnRF9gywVm0L73q2Nw0AamYUQ$) for more information.",
  "electionyear": "2023",
  "office": "West Richland City Council Pos 7",
  "website": ""
}