{
  "name": "Kurt Maier",
  "slug": "kurt-maier",
  "email": "khm@americanimperium.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125229/1566573",
  "image": "/images/candidates/kurt-maier-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MAIEK--354&election_year=2023",
  "uuid": "MAIEK--354",
  "party": "",
  "statement": "**Elected Experience**\n\nNone.\n\n**Other Professional Experience**\n\nI've collaborated with people from all walks of life at Google, IBM, the University of Maryland, PNNL, and other organizations, in Nashville, Indianapolis, Baltimore, Kabul, and more. I'm a veteran of the United States Army. I've worked as a telephone repairman, an auto mechanic, a roofer, a chicken farmer, a manager, and a professional cook, but mostly as a supercomputing engineer.\n\n**Education**\n\nBachelor's of Science, Middle Tennessee State University. Currently pursuing a Masters of Science in Data Analytics from Western Governors University.\n\n**Community Service**\n\nRichland Public Library Board of Trustees member from 2017 to 2022. Chair from 2020-2022.\n\n**Statement**\n\nI believe in living within my means, and I believe in the values that made America the greatest country on Earth. Richland needs a council with a problem-solving mentality. We need housing affordable enough that our families can live here. We need a city code that encourages local businesses, instead of tying them up with red tape. And we certainly don't need to turn the city into a rest stop for out-of-town commuters.\n\nIf elected to City Council, I would lead the same way as at my job -- find out directly from the source what people need to succeed, and work hard to make sure they get it. I believe that Richland deserves a city council focused on governing Richland; not on political party games, not on getting elected to higher offices, not on using the office as a platform to tell people what to think or how to run their businesses.\n\nDoes the council member you voted for have a lot of absences? If you missed that much work, would you still have a job? Whoever you vote for, hold them accountable! Let them know you expect them to show up. It's literally the least they can do.",
  "electionyear": "2023",
  "office": "City Council Member",
  "website": "http://americanimperium.com"
}