{
  "name": "Michael Connors",
  "slug": "michael-connors",
  "email": "michael.connors1@outlook.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127,226/1564916",
  "image": "/images/candidates/michael-connors-original.png",
  "pdc_url": "",
  "uuid": "CONNM--338",
  "party": "",
  "statement": "**Elected Experience**\n\n2019 - Present - Kennewick School Board, 2021-2023 - President Kennewick School Board\n\n**Other Professional Experience**\n\nFormer Chair of Fresh Solutions Network - National Sales and Marketing Organization, Former Board Member Potatoes USA, United Fresh Fruit and Vegetable Leadership Program\n\n**Education**\n\nBA Communications - Seattle University\n\n**Community Service**\n\nPast Volunteer FFA State Convention, Former Kennewick National Little League Coach\n\n**Statement**\n\nThe last four years have been exceptionally challenging for our children, parents, and staff. Our district faces complicated times, and we need to approach these times with common sense and fortitude. Fresh faces and perspectives should be welcomed and applauded, but we also need the appropriate experience to address the complexities we face. I have served as President of the Kennewick School Board for the past two years. If re-elected after this election cycle, I would be the only board member with more than two years of experience.\n\nI am a third-generation farmer; all four of my children attended school in KSD with two still enrolled at Southridge High School. I have a vested interest in the education of all our children and want to make sure our kids have the knowledge and skills necessary to find success in life after graduation.\n\nIt is imperative we stay focused on what is best for all our students and staff and keep politics and partisanship out of our district. My approach entails listening to all sides and asking thoughtful questions before making decisions. I’m asking for your vote to re-elect me to the KSD Board of Directors.\n\nInformation: [m](mailto:michael.connors1@outlook.com)[ike@connorsforKSD.com](mailto:ike@connorsforKSD.com), website: [connorsforKSD.com](https://urldefense.com/v3/__http:/connorsforksd.com/__;!!IJPaFG-91URQ!JrocLBENHkd7y2mHuvuqbg0xY4IFwHCu4F5oUEkY0d762Skjh8fNgzGwUvhe8UPGtpxwSjUkNxKWjp4qUYbWAMMfXXNv_KooLgN9fA$)",
  "electionyear": "2023",
  "office": "School Director",
  "website": ""
}