{
  "name": "Jill Oldson",
  "slug": "jill-oldson",
  "email": "Jill4RSD@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127238/1566833",
  "image": "/images/candidates/jill-oldson-original.png",
  "pdc_url": "",
  "uuid": "OLDSJ 352",
  "party": "",
  "statement": "**Elected Experience**  \nRichland School Director  June 2018 - Present  \n  \n**Other Professional Experience**\n\nWashington School Directors Association (WSSDA) Leadership Cohort 2019, WSSDA Legislative Committee, District Area 11, WSSDA Federal Relations Network Vice President, RSD Board of Directors, serving as Vice President and President, RSD substitute paraeducator, White Bluffs Elementary PTO  2008-12,  Hotel Marketing Executive , 1988-1996 (Los Angeles - Seattle), Corporate Account Manager Metropolitan Travel 1996-1998  \n  \n**Education**  \nAA - National College, Rapid City, South Dakota - 1986, BA - Psychology, California State University Fullerton, 1992  \n  \n**Community Service**\n\nCommunity in Schools Benton Franklin County Board of Directors 2018-2020, Boys and Girls Clubs of Benton Franklin County Board of Directors 2020-Present  \n  \n**Statement**\n\nI have dedicated the last 18 years of my life to our community schools.   I spend time in our schools, talking with teachers, students, and stakeholders to understand their unique needs. As a board member, I have used this information to inform my decisions for ALL students.  \n  \n  \n\nI believe the parent/guardian has the ultimate say in their child’s education. Students with good parental/guardian involvement are more academically and emotionally successful.   The board's responsibility is setting policy and direction to ensure that ALL students are represented to reach their full potential in an environment that meets their specific needs.  My core values include mental health, special education, academic success, transparency, accountability, fiscal responsibility, and local control.\n\nMy experience, willingness to listen, objectivity, and open-mindedness will help lead the district to set high standards in education for ALL kids. We have the leadership, staff, and community to give our students what they need to be happy, successful contributing members of any community.  I am asking for your support in re-electing me to share my passion and commitment to representing ALL students in Richland School District.\n\nContact:  509-546-1303 Email: Jill4RSD@gmail.com",
  "electionyear": "2023",
  "office": "Richland School Board Pos 5",
  "website": "http://jill4allstudents.com"
}