{
  "name": "Katrina Waters",
  "slug": "katrina-waters",
  "email": "waters4rsd@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127239/1566831",
  "image": "/images/candidates/katrina-waters-original.png",
  "pdc_url": "",
  "uuid": "WATEK--558",
  "party": "",
  "statement": "**Elected Experience**  \nWashington State Academy of Sciences (2021); Fellow of the American Association for the Advancement of Science (2023)  \n  \n**Other Professional Experience**  \nScientist with a large research institution in the area (2004-present); Manager of 200+ person organization (2015-2022); Joint Faculty appointments with University of Washington and Oregon State University; Service on advisory boards for several federal agencies including the Environmental Protection Agency, Food & Drug Administration, and National Institutes of Health.  \n  \n**Education**  \nBA with honors, Chemistry, Biology minor, Ripon College, WI; PhD, Biochemistry, University of Wisconsin at Madison.  \n  \n**Community Service**  \nScouts BSA leader: Webelos Den Leader, Committee member, Assistant Scoutmaster, Merit badge counselor. Team treasurer for soccer team.  \n  \n**Statement**  \nI am a mother of 3 RSD graduates, a leader in my profession, and a volunteer youth leader. I believe we can find common ground through mutual respect and understanding to increase the Board’s effectiveness and direct the district in delivering the best education for our youth. As a Board member, I will work to ensure that RSD meets the needs of all students and staff, ensure fiscal responsibility, lobby for sufficient funding and effective use of taxpayer money. My priorities are supporting our educational mandates including special education, the physical safety and mental health of students and staff, and improving communication and collaboration between stakeholders. I have found success as a leader in a large Richland-based research organization and on advisory boards for multiple federal agencies by confronting unfunded mandates, competing priorities, and mission creep through accountability and collaboration with very diverse sets of perspectives and values. My decade of service to youth programs (Scouts BSA, sports) and personal experience with the school system also prepare me to serve the community through the RSD Board. I am committed to find unity in the Board with accountability and transparency to effectively support our children, our staff and our community.",
  "electionyear": "2023",
  "office": "Richland School Board Pos 4",
  "website": "http://www.waters4rsd.com"
}