{
  "name": "Christy Rasmussen",
  "slug": "christy-rasmussen",
  "email": "Rasmussenportofbenton2@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127091/1566801",
  "image": "/images/candidates/christy-rasmussen-original.png",
  "pdc_url": "",
  "uuid": "RASMC--979",
  "party": "",
  "statement": "**Elected Experience**  \nPort of Benton Commissioner Pos. 2  Appointed November 2021  \n  \n**Other Professional Experience**  \nInstructional Technologist at Energy Northwest. Former public school administrator and educator in Pasco and Richland School Districts. Served as Principal at Christ the King Catholic School. National presenter on school innovation topics.   \n  \n**Education**  \nHeritage University, M.Ed Educational Administration, Eastern Washington University, BA Education, Central Washington University, BA Office Administration, Attended Marcus Whitman Elementary and Hanford K-12 School  \n  \n**Community Service**\n\nTri-Cities Sunrise Rotary President, Paul Harris Fellow, Board member Pacific Northwest Waterways Association, Hanford Communities and Energy Communities Alliance. Past board member Perfect Image Leadership Foundation, Safe Harbor and My Friends Place, Rural Families Farmworkers\n\n  \n**Statement**  \nThe mighty Mid-Columbia Basin has blessed me and my family with excellent educational opportunities, stable housing and comfortable family wage careers. My blended family of five children and seven grandchildren choose to reside here, and they propel my deep commitment to this community.\n\nFor me, it is vital that I listen to our community and lead with conviction to ensure decisions and actions reflect its collective values. I have over 30 years of volunteer service as I truly believe in service above self; and leading by example is my legacy for family and community. I bring this same dedication to my Port of Benton position.\n\nAs the incumbent, I champion our economic development and our daily efforts to maintain and develop our current industry-base, while actively recruiting new industries. We must remain laser-focused on retaining affordable power rates with reliable, baseload sustainable “all the above” energy generation and this demands relentless advocacy of our hydropower generating dams.\n\nAs commissioner, it’s essential that I support the hiring and retention of highly capable and dedicated staff who expertly collaborate with cities, counties, tribes and government agencies to execute the Port of Benton’s mission in our community.\n\nWe are better together!",
  "electionyear": "2023",
  "office": "",
  "website": ""
}