{
  "name": "Steve Simmons",
  "slug": "steve-simmons",
  "email": "stevesimmons4pascoschools@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127371/1565070",
  "image": "/images/candidates/steve-simmons-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=SIMMS--301&election_year=2023",
  "uuid": "SIMMS--301",
  "party": "",
  "statement": "**Elected Experience**  \n2020 to Present - Franklin County Republican Precinct Committee Officer (PCO); 2022-2023 - Pasco School Board Director\n\n**Other Professional Experience**  \nAvionics Technician; State Licensed 01 Electrician; Electrical Maintenance Planner\n\n**Education**  \nKamiakin High School Graduate; Avionics & Electronics Trade School; NECA/IBEW Local 112 Inside Electrician Apprenticeship; Pursuing a Bachelor in Project Management at Columbia Basin College\n\n**Community Service**  \nVolunteer and serve in various capacities in local religious organization; Volunteer coach on sports teams; Volunteer at Pasco Parks and Recreation events\n\n**Statement**\n\nI’m Steve Simmons. Raised in Kennewick our family has lived in Pasco for 15 years. Our children attend school in the Pasco School District, one of which is a special needs student. I have a love for our republic, state, and community. I want to serve in a fair, balanced, and ethical manner. I do not believe that our elected officials need to be perfect but that they desire to seek out common sense and truth when making crucial decisions with funds and policies that affect our lives. I will work to ensure the budget, monies, and taxpayer funds are used responsibly and not on ideological, trendy, and wasteful programs. I will work toward fiscally responsible solutions regarding the educational goals and priorities of the community. Much of what affects education in the community happens at the state level. I will be involved in the various organizations and committees as a voice for our community, parents, and students. I will help ensure district and state K-12 education policies and legislation is simple and prudent, builds individual self-reliance, prepares for the future needs of our state and communities, and provides appropriate funding. I would be honored with your vote.",
  "electionyear": "2023",
  "office": "School Director",
  "website": "http://www.stevesimmons4pascoschools.com"
}