{
  "name": "David Milne",
  "slug": "david-milne",
  "email": "milnetool@msn.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125364/1563030",
  "image": "/images/candidates/david-milne-original.jpg",
  "pdc_url": "",
  "uuid": "MILND  301",
  "party": "",
  "statement": "**Elected Experience**  \nElected to the Pasco City Council for the past 6 years, Head football coach for PYF, Boy Scout Leader, board member to Pasco Parks & Recreation and represent WA for STAFDA.  \n  \n**Other Professional Experience**  \nI started my business at 21 which has become the largest tool store in South-Eastern Washington which is Milne Nail, Power Tool and Repair. Member of Pasco Advisory Council, Copa, Leadership Tri-Cities class XXII.  \n  \n**Education**  \nAttended CBC and WSU Tri-Cities with a major in business.  \n  \n**Community Service**  \nAs a Rotarian there is always a project or need in the community. Active in the Duck Races, C3SLAM, Multi-Club International Grants and other endeavors.  \n  \n**Statement**\n\nI have been honored to live and raise my family here in Pasco for the past 23 years. I have a great wife and I've been blessed to raise our 4 kids.\n\nAmerica is a great country and I feel it is my civic duty to be involved in our community when given the chance. That is why I believe I bring a special set of skills to the Council as a small business owner and lifelong Republican. Safety for our residents and business's is my number one goal as a Pasco Councilman hence the reason I strongly support our local law enforcement. Other goals are smart growth for the Broadmoor area, oversite for the Animal shelter, keeping taxes to a minimum, a large family friendly central park, and a small government footprint for our community. I also strongly support our local trade apprenticeship programs and fire department. On another note I strongly believe Marijana stores in our downtown and in other business areas will only bring crime and other unwanted consequences to our community. I am asking for your support in this election and would be honored to represent you, the voter, in November. Thank You and God Bless!!",
  "electionyear": "2023",
  "office": "Pasco City Council Pos 5",
  "website": ""
}
