{
  "name": "Ted Owens",
  "slug": "ted-owens",
  "email": "ted4kcc@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125218/1562857",
  "image": "/images/candidates/ted-owens-original.png",
  "pdc_url": "",
  "uuid": "OWENT--666",
  "party": "",
  "statement": "**Elected Experience**\n\nEndorsed by Benton County Republican Party\n\n**Other Professional Experience**\n\nGeneral Manager of Food Marketing retail chain, responsible for budgeting, procurement, marketing-merchandising, human resources, Washington Food Industry Association Legislative Committee member\n\n**Education**\n\nHigher education in Theology\n\n**Community service**\n\nYouth Sports Coach, Precinct Committee Officer BCRP, Chaplain, Multnomah County Prison Systems, Chaplain, Tri-City Union Gospel Mission\n\n**Statement**\n\nHello, my name is Ted Owens and I am running for Kennewick City Council seat 7.\n\nMy family and I have lived in Kennewick for 20 years and want to improve the quality of living for current and future citizens. City policies should be creating an environment enabling the pursuit of happiness and prosperity.\n\nMy governing philosophy is based on Judeo-Christian principles, which is not a respecter of societal position but one of civil liberties enumerated in the Bill Of Rights, that God-given unalienable rights is the basis of our freedoms. I am a fiscal conservative and a defender of Civil Liberties and Human Agency. Governance should reflect the community, not because of a percentage or to meet a mandated quota but because of the strength that cultural diversity brings. I have worked with and learned from Latino and Black Communities and have been enriched by those experiences. As the city looks to revitalize and plan for growth I will always exercise fiscal restraint, being respectful of taxpayer dollars, measuring efficiency, effectiveness, and addressing the issues affecting our community with compassion and resolve.\n\nI ask for your support for our campaign and your vote.",
  "electionyear": "2023",
  "office": "Kennewick City Council Pos 7",
  "website": ""
}
