{
  "name": "Jim Millbauer",
  "slug": "jim-millbauer",
  "email": "millbauerforkennewick@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125218/1562858",
  "image": "/images/candidates/jim-millbauer-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MILLJ  336&election_year=2023",
  "uuid": "MILLJ  336",
  "party": "",
  "statement": "**Elected Experience:**\n\nCurrent Kennewick City Councilman, Position 7\n\n**Other Professional Experience:**\n\n43-year member of UA Local 598; Trustee: Health & Welfare Fund Trust and JATC. Former: Project Chief Steward/Business Agent for Hanford Project; HAMTC Trustee: negotiating committee and grievance chair; member of Dan Newhouse’s Labor Working Group.\n\n**Education:**\n\nRichland High School 1977; UA Local 598 Apprenticeship 1983; Columbia Basin College HVAC/R 1994.\n\n**Community Service:**\n\nUnited Way Board of Directors; UA 598 Bikes for Tikes; Youth baseball/softball coach; KSD Lunch Buddies and After School Matters programs; Benton Franklin Recovery Coalition Board; Hanford Challenge Board; President of PNW Mustang Club Board.\n\n**Statement:**\n\nI am a husband, father, grandfather, and a 36-year resident of Kennewick. I believe in giving back to my community and it would be an honor and privilege to continue to serve the citizens of Kennewick.\n\nEconomic development is key to our community and should continue as a central consideration in city council decisions. The City of Kennewick has an Apprenticeship Utilization agreement that supports the use of local apprentices on specific public works projects. Developing an infrastructure that attracts new business and sustains existing business will continue to promote job creation and employ and train our local workforce. Quality of life improvements and safety are vitally important to our community. Building a strong economic environment and strengthening community partnerships creates opportunities to thrive personally, professionally, financially, and culturally.\n\nAs a former Hanford employee and current community leader, I have spent a lifetime building relationships with people from all corners of our community, bringing diverse interests together to solve challenges through listening, collaboration, and hard work. I am “Personally Invested in Your Community” and respectfully ask for the opportunity to continue to serve you.\n\nFacebook: MillbauerforKennewick; Instagram: MillbauerforKennewick",
  "electionyear": "2023",
  "office": "Kennewick City Council Pos 7",
  "website": "http://millbauerforkennewick.com"
}