{
  "name": "J.R. Campos",
  "slug": "jr-campos",
  "email": "KeepCampos4council@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125362/1563026",
  "image": "/images/candidates/jr-campos-original.png",
  "pdc_url": "",
  "uuid": "CAMPJ--887",
  "party": "",
  "statement": "**Elected Experience**\n\nAppointed Pasco City Council District 2, Ben Franklin Transit Board of Directors, Benton Franklin Walla Walla Good Roads Association  \n  \n**Other Professional Experience**  \nWashington River Protection Solutions Work Control Planner, Stevens Middle School Assistant Wrestling Coach 2017  \n  \n**Education**  \nBachelors of Applied Science in Project Management, Pasco Senior High School Class of 2005  \n  \n**Community Service**  \nPasco's Planning Commission 2017-2021  \n  \n**Statement**\n\nI am honored to present myself as a candidate for City Council Member in the City of Pasco's District 2. I am deeply invested in the well-being and success of our community. I was born and raised in Pasco, I understand the unique challenges and opportunities we face. I will be a tireless advocate for our district, working diligently to address the issues that matter most to you.\n\nI am passionate about fostering economic growth and creating job opportunities in our district. By attracting new businesses and supporting local entrepreneurs, we can enhance our community's prosperity and improve the quality of life for all residents.  \n  \nEnvironmental sustainability is another area close to my heart. I will champion initiatives that promote clean energy and work toward utilizing our shoreline in a responsible manner. Safety and Security of our City is crucial to me. Some complex issues such as addressing the homeless crisis, will take someone like me who's capable of creative problem solving to address it.  \n  \nAbove all, I am dedicated to transparency, inclusivity, and collaboration. I will actively seek your input, engage with community organizations, and work alongside fellow council members to make informed decisions that benefit our district.",
  "electionyear": "2023",
  "office": "City Council Member",
  "website": ""
}