{
  "name": "Chuck Torelli",
  "slug": "chuck-torelli",
  "email": "Chuck4CityCouncil@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125217/1562856",
  "image": "/images/candidates/chuck-torelli-original.jpg",
  "pdc_url": "",
  "uuid": "TOREC 337",
  "party": "",
  "statement": "**Elected Experience:**\n\nKennewick City Council 2020\n\n**Other Professional Experience**:\n\nKennewick Planning Commissioner 2017-2019, City Council appointment in 2019. Thirty plus years of leadership experience at the Hanford Plutonium Finishing Plant. Served in managerial positions for Budget, Scheduling, Planning and Operations. Served in the U.S. Navy 1972-1976 – included two tours to Vietnam. \n\n**Education:**\n\nAAS Yakima Valley College, Management Certifications\n\n**Community Service:**\n\nPast service includes Benton Franklin Council of Governments, Visit Tri-Cities, Hanford Advisory Board. Current service includes Community Action Connections, Hanford Governing Board (Chair), Interview Committee, Hanford Area Economic Investment Fund Advisory Committee (Vice-Chair). Member of Benton-Franklin League of Women Voters, Historic Museum, Badgers Club, and Tri-Cities Civility Caucus.\n\n**Statement:**\n\nAs one of four generations who served in the Armed Forces (parents, son and grandson), service has always been a part of Chuck’s life. For the past seven years, he has been deeply engaged in Kennewick City governance. He has expertise and institutional knowledge of how government and city council works. This makes him uniquely qualified to continue with the responsibilities of councilmember. \n\nPolice and fire protection are of utmost importance for the safety of our community. He supported the upgrading of emergency response infrastructure including KFD stations, KPD use of body cams, and the addition of School Resource Officers to our middle schools. Chuck supports visionary projects such as Vista Field and Columbia Gardens because they will add to the vitality of Kennewick. Chuck believes quality of life and economic growth results from the willingness to collaborate with other community entities.\n\nChuck is dedicated to service and is willing to spend the time, energy and attention to detail in order to benefit all. His ongoing support of partnerships ensures that Kennewick and the surrounding region will continue to prosper. \n\nChuck Torelli asks for your vote to ensure that Kennewick governance remains open, transparent and fiscally responsible.",
  "electionyear": "2023",
  "office": "City Council Member",
  "website": ""
}