{
  "name": "Kim Lehrman",
  "slug": "kim-lehrman",
  "email": "electkimlehrman@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125361/1563025",
  "image": "/images/candidates/kim-lehrman-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=LEHRK--302&election_year=2023",
  "uuid": "LEHRK--302",
  "party": "",
  "statement": "**Elected Experience**  \nNo information submitted  \n  \n**Other Professional Experience**  \nServes on the City of Pasco Planning Commission. Financial Literacy, Welding and Agriculture Science Teacher.  \n  \n**Education**  \nKamiakin High graduate. Minor in Public Relations Washington State University. Bachelors of Science Agriculture WSU. Masters in Educational Leadership WSU.  \n  \n**Community Service**  \nVolunteered on Pasco School District Long-Term Facility Management Plan. Action Team for Partnership Parent-Chair, PTO; a decade of volunteer coaching for the Pasco Parks and Recreation youth sports programs. Committee member of Pasco Citizens for Better Schools levy and bond campaigns. Food drives organizer and volunteer at Second Harvest. Trained to mentor mothers by iMPACT! Compassion Center. Vacation Bible School volunteer. Voter registration drive volunteer.  \n  \n**Statement**  \nPasco has been my home for over 20 years. I am a mother of four school-aged children, a Pasco Planning Commissioner, Pasco School District Teacher, and a youth volunteer coach. Serving in these roles gives me the opportunity to see and hear the diverse needs of our community. Pasco needs a council member who understands the scope of the position and listens to all residents.\n\nPasco invests in our children, but will they have the option of establishing their own roots in Pasco? How do we not lose our local talent and keep our town’s charm? City staff predict 40,000 new residents in the next 20 years, who will need 15,000 additional housing units. The opportunities this will create requires innovative thinking and partnership, a leadership style I can provide.\n\nI will prioritize continued safety improvements, removal of barriers to the affordable housing crisis, and attracting new businesses while implementing responsible growth planning. I will work to improve community engagement, streamline permitting processes, and collaborate with local, state and federal elected officials. Most importantly, I will listen to and serve all residents.\n\nMaking Pasco work for you, with real results, now and into the future. Vote Lehrman!",
  "electionyear": "2023",
  "office": "City Council Member",
  "website": "http://www.ElectKimLehrman.com"
}