{
  "name": "Gene Nemeth",
  "slug": "gene-nemeth",
  "email": "nemeth4rsd@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127238/1566834",
  "image": "/images/candidates/gene-nemeth-original.png",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "statement": "**Elected Experience**\n\nHomeowners Association Board Member\n\n**Other Professional Experience**\n\nGene is a retired 26-year Navy Captain who enlisted and went on to command both a ballistic missile submarine and a submarine support organization. For the past 7 years, Gene has successfully led nuclear facility operations and readiness for a Hanford site contractor. Gene has experience leading change, developing a continuous improvement culture, and understands the impact public education has on a student’s future success and the local community.\n\n**Education**\n\nPenn State University, BS Electrical Engineering; Old Dominion University, MS Engineering Management\n\n**Community Service**\n\nBenton Franklin County Special Education PTA; RSD Special Education Task Force\n\n**Statement**\n\nGene and his wife of 26 years are weary of school board decisions that did not prioritize student outcomes, include parent input, or address lost learning. The district lost focus on student outcomes, resulting in _less than half of today’s students being proficient in core subjects_.\n\nGene’s vision to reverse the trend is to _Transform_ our district into an _Academic Center of Excellence_. Gene is uniquely qualified because as a parent of four children, all with disabilities, he experienced the decline yet successfully navigated general, special, and gifted programs. 33 years of successful Navy and corporate leadership, demonstrates he can lead this change. Your vote puts Gene in position to establish this vision.\n\nGene is committed to establishing high expectations for student achievement and special education, advocating for parent rights, implementing measurable goals, spending more time monitoring goals, increasing transparency and accountability by frequently communicating results, listening to educators and what they need to succeed, ensuring all stakeholders, including students, are engaged in the plan to achieve excellence, and tying budget priorities to student outcomes. Vote for Gene and help _Transform_ our district into an _Academic Center of Excellence_.\n\nEndorsed by the Benton County Republican Party.",
  "electionyear": "2023",
  "office": "",
  "website": ""
}