{
  "name": "Kent Madsen",
  "slug": "kent-madsen",
  "email": "wkmadsen@msn.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125229/1566574",
  "image": "/images/candidates/kent-madsen-original.png",
  "pdc_url": "",
  "uuid": "MADSW  352",
  "party": "",
  "statement": "**Elected Experience**  \nNo Information Submitted\n\n  \n**Other Professional Experience**  \nNo Information Submitted  \n  \n**Education**  \nNo Information Submitted  \n  \n**Community Service**\n\nI am a Richland native, devoted family man, and accomplished business leader. Happily married to an amazing wife and blessed with 4 children and 14 grandchildren. Successful career spanning top-performing roles with renowned companies like General Electric, Sara Lee Corp and Canon Solutions America. Recognized for sales excellence and business management. Dedicated years of service on the Richland Planning Commission, including four as Chairman. Appointed by City Council for vital projects like the Columbia Park West Master development plan. A committed leader, passionate about fostering growth, safety, and a vibrant community for all Richland residents.  \n  \n**Statement**\n\nI'm Kent Madsen, a principled, accessible, and honest candidate for the Richland City Council. I embrace America's core values of Life, Liberty, and the Pursuit of Happiness. During my previous 14 year tenure on the Planing Commission I diligently prioritized transparency, fairness, responsibility, and Commission excellence. It is with great honor that I present myself as a candidate, seeking your invaluable support through your vote.\n\nI believe in conservative principles, I am steadfast in my commitment to upholding our cherished values. Every decision I make will be guided by fiscal prudence, accountability, public safety for our families and children and a genuine dedication to ethical governance, ensuring the prosperous future of our beloved city.\n\nAccessibility and accountability are the cornerstones of effective representation. I firmly believe that elected officials must be readily accessible to their constituents. Your concerns, ideas, and aspirations will always be given the highest priority, and I promise to be a steadfast advocate for your needs, faithfully representing your interests.\n\nTogether, we can shape the trajectory of Richland, embracing a future defined by integrity, honesty, and a resolute commitment to our conservative ideals. I am immensely grateful for your consideration and ask for your trust and support.",
  "electionyear": "2023",
<<<<<<< HEAD
  "office": "Richland City Council Pos 6",
=======
  "office": "City Council Member",
>>>>>>> a665c5be2e8afcf4bf6453a1334b12704e78aa06
  "website": ""
}