{
  "name": "Brittany Gledhill",
  "slug": "brittany-gledhill",
  "email": "brittanygledhill@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127227/1564913",
  "image": "/images/candidates/brittany-gledhill-original.png",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "statement": "**Elected Experience**  \nNo elected experience  \n  \n**Other Professional Experience**  \nCommunity Representative, Community Engagement Board, Kennewick School District; Board Member, Tri City Youth Choir; Sub Committee Chair, Capital Campaign Board, B5 Learning Center; Financial Manager, Gledhill Dental  \n  \n**Education**  \nBachelor of Science, Brigham Young University, Majoring in Psychology and Spanish; Master of Public Administration, Marriott School of Management, Brigham Young University  \n  \n**Community Service**  \nClassroom Volunteer, Kennewick School District; Adult English Language Learner Teacher, Family Learning Center; Volunteer, Soul Soup; Camp Administrator, Camp Zarahemla; Church youth mentor  \n  \n**Statement**  \nI believe the school board should represent the community it serves. I am a mother of five Kennewick School District students, a local business owner, a community volunteer, and a conscientious taxpayer.  \n  \nThe state serves to provide public schools with necessary funding and academic standards but should avoid controlling school districts in a manner that diminishes parental rights. It is not the place of schools to present social or political beliefs where academics should be the primary objective.  \n  \nI will advocate for local control and will ensure that KSD focuses on core curricula like math, science, and civics. I will ensure resources are used to enhance educational opportunities for students and will fight to protect the rights of parents to be fully informed.  \n  \nI have held volunteer administrative positions on four local community boards in the span of twelve years evaluating the effectiveness of different programs, setting funding priorities, and making important decisions regarding costs, proposed benefits, and scope. I will provide beneficial oversight to Kennewick School District.  \n  \nIf you seek an experienced voice of reason that can understand all viewpoints and offer a balanced perspective that leads to effective results, vote for me.",
  "electionyear": "2023",
  "office": "",
  "website": "http://www.brittanygledhill.us"
}