{
  "name": "Jhoanna Jones",
  "slug": "jhoanna-jones",
  "email": "votejhoanna@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125225/1562867",
  "image": "/images/candidates/jhoanna-jones-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=JONEJH 352&election_year=2023",
  "uuid": "JONEJH 352",
  "party": "",
  "statement": "**Elected Experience**\n\nI seek your support for a 2nd term as your City Council representative.\n\n**Other Professional Experience**\n\nI have actively served our community by volunteering with various organizations like Score, Red Cross, Hispanic Chamber, etc., striving to impact our lives positively.\n\n**Education**\n\nMaster's in Finance, I bring a deep understanding of budgets to the council. I am unafraid to ask tough questions.\n\n**Community Service**\n\nAnimal welfare holds a special place in my heart, and I am an unwavering advocate for our animal shelter and their well-being.\n\n**Statement**\n\nI want you to know that I come from humble beginnings. My journey began in Colombia, South America, and in 2006, I made Tri-Cities my home when my husband joined the City of Pasco's Police Department. Through hard work and a commitment to education, I triumphed over poverty, abuse, and homelessness. I firmly believe in the boundless opportunities offered by our great nation, where hard work and education can transform dreams into reality. I am honored to be endorsed by the Benton County Republican Party; my dedication transcends political affiliations.\n\nAs an avid runner, I hold dear our open spaces, prioritize safety, and advocate for accessible housing options that make our community an ideal place to live. By fostering partnerships with Friends of Badger, Fuse, and other nonprofits, I aim to enhance our city services while reducing the tax burden through their expertise and volunteer support. Together, we can ensure that the voice of our community shapes our collective progress.\n\nI request your support and vote in the upcoming election. We will continue working towards a brighter future for our exceptional city.",
  "electionyear": "2023",
  "office": "City Council Member",
  "website": "http://www.votejhoanna.com"
}