{
  "name": "John Kennedy",
  "slug": "john-kennedy",
  "email": "electjohnkennedy@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127376/1565073",
  "image": "/images/candidates/john-kennedy-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=KENNJ--302&election_year=2023",
  "uuid": "KENNJ--302",
  "party": "",
  "statement": "**Elected Experience**  \nPasco School Board Director, District 2, December 2022 - present  \n  \n**Other Professional Experience**  \nAdjunct Professor of History and American Studies at Columbia Basin College, Washington State University-Tri-Cities, Indiana University, and Marian University Indianapolis. Economic Recovery Coordinator, Benton-Franklin Council of Governments, Richland, Washington.  \n  \n**Education**  \nBachelor’s of Arts, History & Political Science, Indiana University, Bloomington; Master’s of Arts, History, Purdue University, West Lafayette; Doctorate of Philosophy, History, Purdue University, West Lafayette\n\n**Community Service**  \nArchival collections, Franklin County Historical Society & Museum. Archival collections and researching exhibits, East Benton County Historical Society & Museum. Student Research Project Mentor, Clean Energy Ambassadors Network, WSU-Tri-Cities.  \n  \n**Statement**  \nPasco School Board members have an important role as champions for all of our students. I am running for re-election to the Pasco School Board to continue serving as an advocate for them and their families. Our Board can only be effective if its members work together and make decisions as one through consensus. That is my approach as a Board Director. \n\nAs a college instructor with 13 years experience, I understand the importance of ensuring our students have the educational tools necessary to thrive in a competitive economy. I will continue to partner with Board colleagues and District staff to support strong Career and Technical Education programs and advocate for equitably providing students STEM career development opportunities. Our students have clearly expressed to us their need for meaningful connections with their community and true feeling of belonging in their schools. Maintaining Board support for robust and sustainable physical, social, and emotional wellness for our students will remain a high priority of mine. \n\nI will always listen to parents, students, staff, and educators when establishing policy and equitably allocating resources for all of our students and schools in a fiscally responsible way. I humbly ask for your vote. Thank you.",
  "electionyear": "2023",
  "office": "Pasco School Board Pos 2",
  "website": ""
}