{
  "name": "Scott Keller",
  "slug": "scott-keller",
  "email": "Scottkeller4comm@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127091/1566802",
  "image": "/images/candidates/scott-keller-original.png",
  "statement": "**Elected Experience**\n\nNone\n\n**Other Professional Experience**\n\nSeventeen years Executive Director, Port of Benton, Twelve years Airport Director, Port of Benton, Banking:  Mortgage Loan Officer, Commercial Lending, Marketing Officer\n\n**Education**\n\nBachelor of Science in Economics, Professional Port Managers Certification\n\n**Community Service**\n\nBoard of Directors, Tri-Cities Visitor/Convention Bureau, Sam Volpentest Entrepreneurial Award, Rotarian of the year, Board of Directors, Washington Airport Managers Association, Chairman, Hanford Area Economic Development Committee, Board Member, Tri-Cities Chamber of Commerce, Board of Directors, Great Prosser Balloon Rally, Committee Member, Cool Desert Nights, Member, Prosser Chamber of Commerce, Member, Pacific Northwest Waterways Association, Member, American Association of Port Authorities\n\n**Statement**\n\nAs someone who has worked for the Port of Benton for 30 years, I understand the importance of the Port and its role in our local economy. The Port provides jobs, attracts businesses to our region, and helps small businesses thrive and grow to become successful contributors to our economy.\n\nOne of my top priorities as commissioner will be to get the Port’s focus back to supporting small business development. By working closely with local Government partners, we can create a business-friendly environment that encourages growth and innovation.\n\nAs commissioner I will ensure the Port operates in a transparent and accountable manner. We need to make the best decisions possible on where all our tax dollars are being spent.\n\nFinally, I believe that it is important to protect the natural resources that make our region so special. I will work to ensure that the Port operates in an environmentally responsible manner, and that we take steps to minimize our impacts wherever possible. I am committed to working collaboratively with my fellow commissioners, Port staff, and the community to achieve these goals. I am dedicated to serving our community and would be honored to have your support this November.",
  "website": "http://CommissionerKeller.com",
  "pdc_url": "",
  "uuid": "KELLS--520",
  "party": "",
  "electionyear": "2023",
  "office": ""
}