{
  "name": "Theresa Richardson",
  "slug": "theresa-richardson",
  "email": "Richardson4Richland@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125228/1562873",
  "image": "/images/candidates/theresa-richardson-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=RICHT--352&election_year=2023",
  "uuid": "RICHT--352",
  "party": "",
  "statement": "**Elected Experience**\n\nCity Council 2021; Mayor Pro Tem 2022\n\n**Other Professional Experience**\n\nHabitat for Humanity, CEO 2004-2012; 2017-2019; Development Solutions, owner 1996-2004; Liberty Christian School, Development Director 1993-1996; Washington State University, writing lab instructor 1992; Turner Broadcasting, foreign correspondent 1991.\n\n**Education**\n\nWashington State University, BA English/Business 1992, Cum laude – commencement speaker.\n\n**Community Service and Engagement** \n\nCouncil liaison: Port of Benton, Code Enforcement, Police Pension Board, Firefighter Pension Board, Hanford Economic Advisory, SWAC, Tri-City Visitors, Park & Recreation, Economic Development Council. Community Boards/Volunteer: CASA Guardian Ad Litem; Boys & Girls Club; Regional Chamber of Commerce; Tri City Pregnancy Network; Union Gospel Mission; Three Rivers Community Foundation; New Heights Church.\n\n**Statement**\n\n_In Theresa’s first term as city Councilmember and most recently as mayor pro tem_, _her professional background, leadership, and collaborative style encouraged business development and employment opportunity._ \n\nRichland is on the cusp of several exciting commercial projects. In her next term, she will continue to spotlight the need for workforce homeownership and encourage our city to be investment friendly. An additional focus will be securing high tech manufacturing jobs as the regional energy hub.\n\n_To keep our community safe, Theresa is honored to fully support our police and first responders to find solutions to protect our quality of life._\n\nTheresa knows that it is a great privilege to work alongside so many talented, diverse and innovative community leaders. With full collaboration, Richland can successfully implement common-sense fiscal policy, forge private-public partnerships, and grow enduring business relationships to benefit our citizens.\n\nMarried 47 years, Theresa and David have profound appreciation for this community. Together they raised three sons with an abundance of hometown memories. Today, all their families and grandchildren call Richland home.\n\n_Theresa is motivated to continue to work hard and make sure Richland is ready to thrive for the next generation._",
  "electionyear": "2023",
  "office": "Richland City Council Pos 2",
  "website": ""
}