{
  "name": "David Cole",
  "slug": "david-cole",
  "email": "davidcoleforwrcitycouncil@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125232/1562877",
  "image": "/images/candidates/david-cole-original.jpg",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=COLED--876&election_year=2023",
  "uuid": "COLED--876",
  "party": "",
  "statement": "**Elected Experience**\n\nPrecinct Committee Officer\n\n**Other Professional Experience**\n\nU.S Navy veteran, Deputy Sheriff (Houston, TX), WA Dept. of Corrections, Vocational Instructor (Peninsula College), Hanford employee (planning) 23 years\n\n**Education**\n\nLamar University (Criminal Justice), Texas A&M University (Criminal Justice)\n\n**Community Service**\n\nBoard President – Tri Cities Residential Services, Board Member – You Medical, Constitution Coach – Patriot Academy, Treasurer – Operation Thank You Veterans Golf, Vet Mentor – Benton County Veterans Therapeutic Court, Group Leader – ReEngage Marriage Ministry\n\n**Statement**\n\nAs a non-profit board member, my experience includes policy and budget oversight and working collaboratively to achieve desired outcomes. Our city’s vision statement says we are _“a growing city where family values and community responsiveness are important. The city should grow in a balanced way to produce a safe and inviting community having good residential and recreational alternatives and a healthy economic base.”_ I agree with that vision. Citizens value transparency in city government. I will be responsive to their concerns. We _can_ have growth and keep our small town roots. I will promote a business-friendly climate that enables local businesses to thrive. West Richland has been my home for 17 years. My children and grandchildren live here. I will advance family-friendly policies that strengthen our neighborhoods. As a former sworn law enforcement officer, I support the police officers who protect and serve us. I oppose any efforts to defund or minimize their mission. The impact of substance abuse in our community is visible. I oppose marijuana stores in West Richland. I am endorsed by the Benton County Republican party. I am the conservative choice for West Richland City Council.",
  "electionyear": "2023",
  "office": "West Richland City Council Pos 7",
  "website": ""
}