{
  "name": "D. Shayne VanDyke",
  "slug": "d-shayne-vandyke",
  "email": "shayne@shayne4richland.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125226/1562869",
  "image": "/images/candidates/d-shayne-vandyke-original.png",
  "pdc_url": "",
  "uuid": "VANDD--036",
  "party": "",
  "statement": "**Elected Experience**\n\nAppointed to Richland City Council July 2022. HOA president. \n\n**Other Professional Experience** \n\nProject Management Professional with over 20 years leadership experience working at the Hanford Vitrification Plant and PNNL. Successfully led teams of over 100 people and responsible for over $200M in work scope. Led teams in government contracts, international nuclear detection and deterrence, training, cybersecurity, and advising senior federal executives. Certifications in process improvement, team behaviors, root cause analysis, training, and financial accountability.\n\n**Education**\n\nBS Business Management/Minor in Political Science, Brigham Young University, 2001. MBA, Washington State University, 2007.\n\n**Community Service** \n\nJunior Achievement teacher, Scouting leader, church youth volunteer, and youth sports coach.\n\n**Statement**\n\nMy wife, four children, and I have made Richland home for over 20 years. I want to give back. With my education, training, and proven leadership I can represent you and continue our tradition of excellence.\n\nI am increasingly concerned about rising crime and evolving challenges confronting our fire department. My experience on city council enables me to work collaboratively with our great police and fire departments, further improving their critical services. I will work with local charities and organizations to create safe and fun places where at-risk youth can belong and be mentored. Together, we can improve our communities’ mental health and addiction rehabilitation services.\n\nI have the experience to facilitate responsible growth for our economy, leveraging small businesses.  I will work to enrich our city via expanded riverfront developments, performing arts venues, and through balanced city planning. I have represented the city council on the Planning Committee, Utility Advisory Committee, Tri-Cities Chamber of Commerce, Visit Tri-Cities, and Hanford Communities Governing Board. I feel such experiences afford me great insight and an increased ability to lead our city.\n\nI humbly ask for your vote to continue as a Richland City Councilmember.",
  "electionyear": "2023",
  "office": "",
  "website": "http://shayne4richland.com"
}