{
  "name": "Josh Miller",
  "slug": "josh-miller",
  "email": "drjoshmillerksd@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127225/1564917",
  "image": "/images/candidates/josh-miller-original.png",
  "pdc_url": "",
  "uuid": "MILLD--334",
  "party": "",
  "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nOrthopedic Surgeon at Northwest Orthopedic/Kadlec (current); Clinical Faculty for WSU School of Medicine (Current); NFL/NHL team physician; Admissions committee member, UCLA School of Medicine; Teacher and tutor at Kaplan Test Preparation; Missionary in Colombia.  \n  \n**Education**  \nBrigham Young University, BS in Microbiology and Philosophy, 2003; UCLA Geffen School of Medicine, MD, 2008; UCLA Anderson School of Management, MBA, 2008; University of Tennessee/Campbell Clinic, Orthopedic Surgery Residency, 2013; Washington University in St. Louis, Orthopedic Sports Fellowship, 2014.  \n  \n**Community Service**  \nVolunteer medical coverage at local high school sports events; youth soccer/basketball coach; leader in church adult and youth groups.  \n  \n**Statement**  \n\n     As the son of a school teacher and with 4 children currently attending KSD in elementary, middle and high schools, I am deeply passionate about education. I have had extensive involvement in education through my own schooling as well as working as a tutor, teacher, and currently as an orthopedic surgeon on WSU medical school’s clinical faculty.\n\n     I believe that it is imperative that as a school district we are focused on our primary goal of educating and preparing our children. We can do this by focusing on three key factors. First, we focus on academic excellence. Whether students are preparing for college or vocational training, they need to be given the academic tools to succeed. School should be focused on academics! Second, we focus on encouraging parental involvement and integrating them into their child’s school and education. Students are more successful when teachers and schools collaborate with parents. Third, we focus on fiscal responsibility and transparency. We can’t keep asking for more money from taxpayers in levies and taxes. We should be using the money we have more effectively and efficiently.\n\n     Join me in helping our schools better educate and prepare our children for their future.\n\nVisit: www.drjoshmiller.org",
  "electionyear": "2023",
  "office": "Kennewick School Board Pos 5",
  "website": "http://drjoshmiller.org"
}