{
  "name": "Aaron Massey",
  "slug": "aaron-massey",
  "email": "aaron@masseyforksd.org",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/127227/1564914",
  "image": "/images/candidates/aaron-massey-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=MASSA--336&election_year=2023",
  "uuid": "MASSA--336",
  "party": "",
  "statement": "**Elected Experience**\n\n No Information Submitted\n\n**Other Professional Experience**\n\nCurrent Independent Contractor Process Server \n\n**Education**\n\nGED, currently attending CBC Fire Science AAS, CBC Applied Business Management - Pre Law Classes, Past Courses IT, DHS Certifications: 101 Critical Infrastructure Protection, Introduction Threat Hunting Teams, Cyber Supply Chain Risk Management, 101 Reverse Engineering, Cyber Risk Management - Technician, Root Cause Analysis, Cyber Fundamentals Law Enforcement Investigations, Advanced PCAP Analysis Signature Development APA, Cyber Security Investigation, Additional Certifications: Cybersecurity 101 Coding, FIRST AID AED CPR, Washington, Oregon Guard Card, FEMA NIMS Certifications, IT TECH 1, OSHA 10\n\n**Community Service**\n\nMaeson's Veterans, Self-started Fire Camps in Oregon\n\n**Statement**\n\nAaron was raised in Tennessee and moved to the Tri-Cities Community five years ago to be closer to family. Before relocating to the Tri-Cities area, Massey spent her time as a military housewife and worked as a Union Member in the Nuclear Power Industry. Once Massey and her two children settled into the Tri-Cities area, she began to see her and her children calling this their home. \n\nMassey understands that when it comes to school board issues many are complicated and a “one solution, fits all”, approach is not always best for students, parents, teachers, or staff. We really need to communicate with each other and gather information, in order to come up with solutions that are best everyone. Sometimes this means finding multiple solutions, and not just one. \n\n“I really want to give back to my community. I want what is best not only for my students, but for all students. I also feel that parents, children with disabilities and minorities need a greater voice in our community. My overall goal is to listen and to be that voice for everyone.”, stated Massey \n\nThe focus should be “Putting Children First and Agendas Last.”",
  "electionyear": "2023",
  "office": "Kennewick School Board Pos 4",
  "website": "http://www.masseyforksd.org"
}