{
  "name": "Liz Vann-Clark",
  "slug": "liz-vann-clark",
  "email": "contact@vannclark4richland.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125228/1562874",
  "image": "/images/candidates/liz-vann-clark-original.png",
  "pdc_url": "https://www.pdc.wa.gov/browse/campaign-explorer/candidate?filer_id=VANNE--352&election_year=2023",
  "uuid": "VANNE--352",
  "party": "",
  "statement": "**Elected Experience**\n\nNone\n\n**Other Professional Experience**\n\nTechnical Writer and Editor, Mathematics educator\n\n**Education**\n\nMaster of Mathematics Education from Western Governors University, Bachelor of Education from Washington State University\n\n**Community Service**\n\nColumbia Basin Badger Club Board Member, Soroptimist Three Rivers Board Treasurer, SageFen Inc. President, and 20 years of volunteering and leadership roles in Pacific Northwest non-profit organizations.\n\n**Statement**\n\nLiving in Richland most of my life, I have an appreciation for our city’s history and the growth Richland has seen. As a mother, wife, and long-time community volunteer, I have a vested interest in Richland’s future. Our city benefits from great schools, beautiful parks, and a rich culture of diverse worldviews and experiences. To support our growth and build a brighter future, I advocate for innovative solutions for safer neighbors, improving local economy, and developing infrastructure.\n\nRichland’s rapid growth calls for responsible management to ensure that all of our community benefits from the improved economy. I support local small businesses, buying locally, and hiring locally. I will advocate for strategic development that will support a strong economy while decreasing potential negative impact on Richland’s way of life. \n\nWith over 20 years of experience as a volunteer and in leadership roles focused on civic duty, education, and the arts; I’m experienced in collaborating with a variety of viewpoints to find common ground for success. I believe in ethical leadership founded on transparency and accountability to the community.\n\nPlease join in supporting my campaign by voting for Liz Vann-Clark for Richland City Council, Position 2!",
  "electionyear": "2023",
  "office": "City Council Member",
  "website": "https://vannclark4richland.com/"
}