{
  "name": "James Czebotar",
  "slug": "james-czebotar",
  "email": "zeb@wsu.edu",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=883#/candidates/125364/1563031",
  "image": "/images/candidates/james-czebotar-original.png",
  "pdc_url": "",
  "uuid": "CZEBJ--076",
  "party": "",
  "statement": "**Elected Experience**\n\nJames Czebotar is a husband, father, scientist, and engineer. He and His wife of 20 years, Kendra Bell Czebotar, grew up with extended family in Pasco and Kennewick. They jointly decided to raise their three children in Pasco.  \n  \n**Other Professional Experience**  \nJames is currently a Senior Information Technology Engineer at Pacific National Northwest Laboratories. Previously he was an Information Technology Specialist for Mid Columbia Libraries & Benton County where he worked closely with elected officials, district court, and superior court judges.   \n  \n**Education**  \nWashington State University Bachelors of Arts in Business Management Information Systems  \n  \n**Community Service**  \n12+ years Kennewick School District / Tri-Tech Computer Science Advisory Committee  \n  \n**Statement**\n\nAs a long time resident, born in Pasco, I seek to serve you on the City Council. I offer my values, experience, and commitment to keep Pasco moving in a positive direction. \n\nEffective city government must be transparent and inclusive. As a past employee of Benton County and Mid-Columbia Libraries, I strived to be an effective and fair steward of public resources—your tax dollars.  I believe in using local talent and open source technologies as opposed to remote outsourcing, opaque contracts, and proprietary solutions. \n\nFor over a decade, I’ve nurtured our children’s technological skillsets by serving on the Tri-Tech & Kennewick School District Computer Science Advisory Committee.  I’ve stressed that while our kids need these skills to successfully participate in the global information economy, it is a disservice to not prepare kids to defend themselves against fraud, bullying, and online scams. \n\nThese are the same values I will bring to City Council.  The growing number of unhoused individuals, gang activity, street racing, infrastructure and job growth are all sophisticated issues with many moving parts, some of which overlap.   Our modern complex problems call for serious leaders who value science over slogans and pursue data driven outcomes. www.vote4zeb.com",
  "electionyear": "2023",
  "office": "Pasco City Council Pos 5",
  "website": ""
}