[
 {
   "Timestamp": "2020/09/14 11:16:43 PM MDT",
   "Username": "brett.borden@lpwa.org",
   "Name": "Brett Borden",
   "1": 2,
   "1a": "My concern with stimulus packages for businesses is the tendency for them to favor big businesses that don't need it while leaving independents in the rain and the people holding the check.",
   "2": 2,
   "2a": "Given the large increase in the State budget over the past decade I don't trust Olympia to ever balance the budget. They keep spending more and asking for more even with massive cannabis revenues.",
   "3": 4,
   "3a": "",
   "4": 2,
   "4a": "",
   "5": 2,
   "5a": "",
   "6": 4,
   "6a": "Reform so law enforcement is once again only tasked with investigating and responding to violent crime and theft.",
   "7": 1,
   "7a": "",
   "8": 3,
   "8a": "Public entities should consult health officials, but private entities should be able to do what is necessary for their livelihoods unencumbered by the State.",
   "9": 1,
   "9a": "",
   "10": 4,
   "10a": "I support reforms like RCV in order to better represent the will of voters, and am the only candidate running in the 9th district to be recognized by FairVote Washington for this advocacy.",
   "11": 3,
   "11a": "",
   "12": 3,
   "12a": "",
   "13": 2,
   "13a": "I am generally supportive of more local control over education and school choice, though recognize that funding this way can open the door to disparate results based on geography and wealth.",
   "14": 3,
   "14a": "",
   "15": 2,
   "15a": "",
   "16": 3,
   "16a": "I support opening up public lands to an even greater extent and devolving control to the people for common usage. After all, it is our public land.",
   "17": 2,
   "17a": "While I am running on a platform dedicated to individual liberties and will not stray from this commitment, it is important to be able to listen and discuss issues with anybody and be open to what they are saying.",
   "18": 4,
   "18a": "",
   "19": 2,
   "19a": "",
   "20": 2,
   "20a": "Transportation is one of these areas where we throw increasing gobs of money at the problem with little to show for it. While (A) is important, we have not been getting our money's worth and that must be examined.",
   "21": 3,
   "21a": "",
   "22": 4,
   "22a": "The key being that the market needs to actually be open. Heavy regulations like zoning block the construction of new housing and enables NIMBY elitism that leaves us with artificially restricted, expensive housing.",
   "23": 4,
   "23a": "",
   "24": 4,
   "24a": "",
   "25": 4,
   "25a": "Meaningful justice reform measures are my #1 priority.",
   "26": "Most areas, really. Devolving control to our people and local communities should naturally decrease spending, and undertaking broad reforms like in justice would automatically decrease areas like Corrections.",
   "27": "With spending as it is, I don't see supporting increases in many budgets. I do think it's important to make sure the social safety net is our last resort so the most vulnerable do not bear the brunt of cuts."
 },
 {
   "Timestamp": "2020/09/15 11:50:38 PM MDT",
   "Username": "stanley4washington@gmail.com",
   "Name": "Larry Stanley",
   "1": 4,
   "1a": "",
   "2": 2,
   "2a": "",
   "3": 2,
   "3a": "",
   "4": 1,
   "4a": "",
   "5": 2,
   "5a": "I really think this is a false choice.  Instead of segment I would fund and support creation of small businesses of all kinds and make sure the large businesses pay their fair share.  A diverse competitive economy best.",
   "6": 4,
   "6a": "",
   "7": 2,
   "7a": "",
   "8": 2,
   "8a": "",
   "9": 2,
   "9a": "",
   "10": 4,
   "10a": "",
   "11": 3,
   "11a": "",
   "12": 2,
   "12a": "",
   "13": 3,
   "13a": "",
   "14": 4,
   "14a": "",
   "15": 1,
   "15a": "",
   "16": 3,
   "16a": "",
   "17": 4,
   "17a": "",
   "18": 4,
   "18a": "",
   "19": 4,
   "19a": "",
   "20": 3,
   "20a": "There should be a some of each.  All infrastructure should be updated for safety and efficiency.",
   "21": 2,
   "21a": "",
   "22": 1,
   "22a": "",
   "23": 1,
   "23a": "",
   "24": 4,
   "24a": "",
   "25": 4,
   "25a": "",
   "26": "subsidies that go to large business or agriculture.  Admin for education, and admin for medical. Temporarily delay payment to pension until we are out of emergency. Public safety spending should move to social service.",
   "27": "During this emergency there should be direct cash help for both families and small businesses.  Increase pay and training for teachers; "
 },
 {
   "Timestamp": "2020/09/17 12:57:29 PM MDT",
   "Username": "coburn16ldpos2@gmail.com",
   "Name": "Carly Coburn",
   "1": 4,
   "1a": "",
   "2": 2,
   "2a": "",
   "3": 3,
   "3a": "",
   "4": 2,
   "4a": "",
   "5": 1,
   "5a": "",
   "6": 4,
   "6a": "",
   "7": 1,
   "7a": "",
   "8": 1,
   "8a": "",
   "9": 3,
   "9a": "",
   "10": 4,
   "10a": "",
   "11": 1,
   "11a": "",
   "12": 1,
   "12a": "",
   "13": 3,
   "13a": "",
   "14": 4,
   "14a": "",
   "15": 2,
   "15a": "",
   "16": 4,
   "16a": "",
   "17": 3,
   "17a": "",
   "18": 4,
   "18a": "",
   "19": 4,
   "19a": "",
   "20": 2,
   "20a": "",
   "21": 1,
   "21a": "",
   "22": 1,
   "22a": "",
   "23": 2,
   "23a": "",
   "24": 4,
   "24a": "",
   "25": 4,
   "25a": "",
   "26": "State Military, State Corporate Welfare, Toll Fares, scale back maintenance of public building (excluding national parks and historic landmarks), grants for non-essential projects.",
   "27": "Pre-Kindergarten, Affordable and accessible Healthcare, Housing Affordability, ADA Compliance, houselessness supports."
 },
 {
   "Timestamp": "2020/09/20 2:55:04 PM MDT",
   "Username": "info@garbereser.com",
   "Name": "Danielle Garbe Reser",
   "1": 3,
   "1a": "Businesses and our local economies need stimulus support to recover from an economic catastrophe of this scale.",
   "2": 2,
   "2a": "COVID-19 has resulted in significant budgetary changes.  We may need to rely partially on our reserves, but that will not be enough alone to adapt to the challenges we face in the future.",
   "3": 1,
   "3a": "I agree with Republicans that we should have a special session to start this work as soon as possible.",
   "4": 2,
   "4a": "Both ends of the education spectrum are key to our economic development and recovery.  We get such a high return on investment with our early learning programs that I want to protect and support them.",
   "5": 2,
   "5a": "We need all of these sectors to be strong for our communities to be thriving, vibrant places to live and work.",
   "6": 2,
   "6a": "Our communities value security. Everyone deserves fair and equitable treatment by law enforcement.  We need to prioritize community engagement and hold our police to high but fair standards.",
   "7": 3,
   "7a": "We can always improve training building off the standards for accredited police programs.",
   "8": 1,
   "8a": " We need to lead with the data, science, and experts, who tell us to mask up so we can open up.",
   "9": 2,
   "9a": "The state should set standards and local communities should have flexibility to respond to local needs.",
   "10": 4,
   "10a": "The Governor’s primary race was an example of the disenfranchisement that happens to voters whose candidate is not picked.  I support exploring other options like ranked choice voting.",
   "11": 2,
   "11a": "Many of our districts have increased costs from providing online learning that need to be addressed now.  I want our districts to have more flexibility with their levies in the future.",
   "12": 1,
   "12a": "We need to maintain supports in our schools, particularly for students with special education needs.",
   "13": 2,
   "13a": "Post the McCleary decision we are at better parity.  Our focus going forward needs to be on the flexibility our communities want to pass the levies that make sense for each district.",
   "14": 4,
   "14a": "Washington State has always been a leader.  We should lead in creating and attracting the clean energy jobs and businesses of the future, like Moses Lake is doing with its new solar business.",
   "15": 1,
   "15a": " I believe we use our taxpayer dollars more wisely for the long run when we keep sustainability and resiliency at the forefront of our decision making.",
   "16": 3,
   "16a": "Our region can’t grow without maintaining sustainable, clean water sources for agricultural, manufacturing, residential, and recreational use.",
   "17": 3,
   "17a": "I will bring my experience as an Eastern Washingtonian to the legislature and will keep an open mind to listen to all sides and use data, science, and experts to finalize my views.",
   "18": 4,
   "18a": "Transparency is a key value of mine and needs to be prioritized as we make decisions using taxpayer resources and affecting everyone’s lives and livelihoods.",
   "19": 3,
   "19a": "Communication must improve.  Even with funding limitations in this budget cycle, we can use free methods to connect with more residents.",
   "20": 2,
   "20a": "In the 16th LD, we have major repair and infrastructure needs that need to take priority in a tough budget environment.",
   "21": 2,
   "21a": "I am really interested in learning more about high speed rail options that include Eastern Washington.",
   "22": 2,
   "22a": "We need the state to partner in rural areas to make construction more affordable and accessible.  The state can also help support job programs in the trades that will make labor more available for construction.",
   "23": 3,
   "23a": "The state can provide guidance, but our local areas need to be the driving force behind what works for each county in partnership with our market players.",
   "24": 1,
   "24a": "",
   "25": 4,
   "25a": "",
   "26": "",
   "27": ""
 },
 {
   "Timestamp": "2020/09/22 6:50:17 PM MDT",
   "Username": "electfrances@gmail.com",
   "Name": "Frances Chvatal",
   "1": 3,
   "1a": "State and local governments should work together to assess needs and decisions must be considered in light of current revenue reports and the impact of a CARES 2 package",
   "2": 3,
   "2a": "Decisions must be considered in light of current revenue reports and the impact of a CARES 2 package",
   "3": 2,
   "3a": "Decisions must be considered in light of current revenue reports and the impact of a CARES 2 package.",
   "4": 2,
   "4a": "If at all possible, I would like to advocate against any cuts to education. Our children and young adults should not bear the burden of this pandemic and budget shortfall.",
   "5": 3,
   "5a": "",
   "6": 3,
   "6a": "",
   "7": 2,
   "7a": "",
   "8": 1,
   "8a": "",
   "9": 3,
   "9a": "I believe that decisions about public safety should be made by the Health authorities at the state and county level.  Both should strive to work together for the common good.",
   "10": null,
   "10a": "I do not have adequate information to make an informed answer. ",
   "11": 2,
   "11a": "I do not believe this is a either/ or depending on the community and their needs",
   "12": 1,
   "12a": "I would defer to precedent and the constitution to determine any decrease in educational spending.  I also, very much support emergency and public health services.",
   "13": 3,
   "13a": "",
   "14": 4,
   "14a": "",
   "15": 2,
   "15a": "",
   "16": 4,
   "16a": "",
   "17": 3,
   "17a": "",
   "18": 4,
   "18a": "",
   "19": 2,
   "19a": "",
   "20": 3,
   "20a": "",
   "21": 2,
   "21a": "This is a proposal that I would need to thoroughly review and study.  We must invest and create systems for many years into the future and view through the prism health, both humanity and the earth",
   "22": 1,
   "22a": "",
   "23": 2,
   "23a": "",
   "24": 4,
   "24a": "",
   "25": 4,
   "25a": "",
   "26": "I would take a balanced approach to the state budget. I would understand the impact of services that may be cut, seek expertise from stakeholders and consider additional funding sources to limit impact.",
   "27": "I would consider increased spending on the following.  I am well aware of our revenue and that this may not be practical at this time. \nHealthcare\nEducation\nAgriculture\nSocial safety nets\nMental health services\n"
 },
 {
   "Timestamp": "2020/09/23 1:26:59 PM MDT",
   "Username": "klippertbrad8@gmail.com",
   "Name": "Brad Klippert ",
   "1": 1,
   "1a": "",
   "2": 4,
   "2a": "",
   "3": 1,
   "3a": "",
   "4": 2,
   "4a": "",
   "5": 1,
   "5a": "",
   "6": 1,
   "6a": "",
   "7": 4,
   "7a": "",
   "8": 4,
   "8a": "",
   "9": 1,
   "9a": "",
   "10": 2,
   "10a": "",
   "11": 2,
   "11a": "",
   "12": 3,
   "12a": "",
   "13": 2,
   "13a": "",
   "14": 1,
   "14a": "",
   "15": 2,
   "15a": "",
   "16": 2,
   "16a": "",
   "17": 2,
   "17a": "",
   "18": 3,
   "18a": "",
   "19": 2,
   "19a": "",
   "20": 1,
   "20a": "",
   "21": 3,
   "21a": "",
   "22": 3,
   "22a": "",
   "23": 4,
   "23a": "",
   "24": 1,
   "24a": "",
   "25": 2,
   "25a": "",
   "26": "",
   "27": ""
 }
]