{
  "name": "Brandon Andersen",
  "slug": "brandon-andersen",
  "email": "brandonforkennewick@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61243/1534150",
  "image": "/images/candidates/brandon-andersen-original.png",
  "statement": "**Elected Experience**  \nNone yet  \n  \n**Other Professional Experience**  \nBrandon Andersen is a loving father, husband and local small business owner. Brandon, his wife Veronica, son Atlas, and kitty Juliet live in a historic 1930’s built home in Downtown Kennewick.   \nIn his spare time, Brandon works on bonsai trees, spends time with family, and eats new foods. Brandon Andersen and his family are often seen taking leisurely walks near Clover Island, Downtown Kennewick, and local parks.  \n  \n  \n**Education**  \n\nLeadership Tri-Cities graduate (Class 24)\n\nWSU Tri-Cities Bachelor's Digital Technology & Culture, Literary Studies Minor\n\n  \n  \n**Community Service**  \n\nLeadership Tri-Cities, Director of Communications.\n\nMyTri2030, Quality of Life Council \n\nArts Center Task Force, Communications Committee\n\n  \n  \n**Statement**  \nBrandon Andersen’s campaign focuses on 3 main objectives. If elected, Brandon Andersen will focus on: Further development for The Creative District, Development of multi-use spaces and performance centers, Improving the quality of life for every Kennewick resident.  \nBrandon believes in the City of Kennewick. He values the improvements being made and will continue to support developments that make sense for Kennewick citizens. We need new roads and paths built with bikers and pedestrians in mind.  \n  \nAs the city grows, support for the Kennewick Police and Fire Departments is more important than ever. Because of their service, Kennewick will continue to be a safe place to live.  \nBrandon Andersen is grateful for the opportunity and generosity of local supporters that have enabled him to get this far.  \n  \nBrandon Andersen's focus on the creative district, multi-use spaces, and improvements to our quality of life will make Kennewick a more enjoyable place to live.  \n  \nVote Brandon Andersen!",
  "website": "http://www.brandonforkennewick.com",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}