{
  "name": "Irving L. Brown Sr.",
  "slug": "irving-l-brown-sr",
  "email": "mrbrownforcitycouncil3@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/63786/1539025",
  "image": "/images/candidates/irving-l-brown-sr-original.png",
  "statement": "**Elected Experience**  \nNone.\n\n**Other Professional Experience  \n**High-achieving human resources leader and trusted advisor with extensive experience leading fast-paced, service-oriented human resources operations; Red Lion Hotel & Conference Center, Pasco; Human Resources Manager, 4/2021 to Present. Washington Potato Company, Pasco; Human Resources Supervisor, 4/2008 to 4/2019.\n\n**Education**  \nBachelor of Science in Business Management, expected 2022; Columbia Basin College, Pasco Professional in Human Resources, Expected 2021; Human Resources Certification Institute.\n\n**Community Service**  \nExecutive Director for local non-profit, Tri-Cities Diversity and Inclusion Council; Master of Ceremony for the Miss Juneteenth Scholarship Pageant; In service to low-Income Families.\n\n**Statement**   \nMy name is Irving Brown. I am running for Pasco City Council District 3 position. I have lived in Pasco since 2008 and I’m the proud father of two children. I serve as the Executive Director for the Tri-Cities Diversity and Inclusion Council; Human Resources Manager at the Red Lion Hotel and Conference Center, serve as a Deacon and Chairman of the Trustee Board at the New Hope Missionary Baptist Church in Pasco. I also own a small consulting business.\n\nPasco stands at a crossroad with a booming population. Our economy is one of the fastest growing in the state, yet entire sections of our city feel left behind. I am running because I firmly believe in Pasco and the promise of its future. If elected, I will work to strengthen our city’s economy with pro-growth policies that distribute development evenly across our city. I will find ways to save money in our budget without compromising vital services while maintaining a culture of equity, inclusion and empowerment in our local government.\n\nLet’s build our future together. I respectfully ask for your vote. For more campaign information or to volunteer, please visit my website at: www.mrbrownforcitycouncil3.com.",
  "website": "",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}