{
  "name": "John Kennedy",
  "slug": "john-kennedy",
  "email": "electjohnkennedy@gmail.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/63782/1539243",
  "image": "/images/candidates/john-kennedy-original.png",
  "statement": "**Elected Experience**  \nNo Information Submitted  \n  \n**Other Professional Experience**  \nAdjunct Instructor of History and American Studies at Columbia Basin College, Washington State University-Tri-Cities, Indiana University, and Marian University Indianapolis. Economic Recovery Coordinator, Benton-Franklin Council of Governments, Richland, Washington.  \n  \n**Education**  \nBachelor’s of Arts, History and Political Science, Indiana University, Bloomington; Master’s of Arts, History, Purdue University, West Lafayette; Doctorate of Philosophy, History, Purdue University, West Lafayette.  \n  \n**Community Service**  \nAssisted the Franklin County Historical Society and Museum in Pasco with organizing its vertical files. Assisted the East Benton County Historical Society and Museum in Kennewick with organizing archival documents and researching an exhibit on Tri-Cities restaurant history.  \n  \n**Statement**  \nThe consequences of COVID-19 will have long-lasting academic, psychological, and economic impacts on our students and their futures. Parents are wondering how our School District will navigate the recovery from the pandemic and beyond to prepare and equip students for success inside and outside of the classroom. I am running for the Pasco School Board to be a new voice and a listening ear. I will work with Board colleagues, District staff, and families to empower _all_ students to develop the educational tools needed for successful futures after graduation and thrive in a competitive economy.  \n  \nAfter 11 years of experience as a college instructor, I understand the challenges and opportunities a college education or skilled trades offers. I will work towards supporting the School District in bridging the readiness gap between K-12 and higher education or the trades. As an Economic Recovery Coordinator, I know the efficacy of partnerships and the necessity of planning. I will have a collaborative approach on the Board and will responsibly listen to stakeholders when effectively allocating resources and establishing policy. In my professional roles, I put students and local jurisdictions first and will continue to do so as a Board member for _all_ students.",
  "website": "",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}