{
  "name": "Scott Rodgers",
  "slug": "scott-rodgers",
  "email": "Scott@ScottERodgers.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61271/1538804",
  "image": "/images/candidates/scott-rodgers-original.png",
  "statement": "**Elected Experience**  \nNo Information Submitted  \n  \n**Other Professional Experience**  \nCurrent: Attorney and Counselor at Law, (Rodriguez Interiano Hanson & Rodgers); Also serve Washington State Medical Commission as Medical Commissioner.  \n  \nFormer: Health Outcomes Researcher and Biostatistician; Project Management; Senior Management; (Healthcare Insurance and Pharmaceutical Research); Adjunct Professor: Law, Sociology, Logic & Reason, (Charter College, University of Tennessee at Chattanooga).  \n  \n  \n**Education**  \nDoctor of Jurisprudence, (J.D.); Master of Business Administration, (M.B.A.); B.S. Economics; B.S. Sociology; B.A. Chemistry, Minor in Mathematics; Graduate certificates in Computer Science and Technology Management.  \n  \n**Community Service**  \nCurrent: Pro bono legal work; Board member: Mid-Columbia Mastersingers, (bass-baritone); Columbia Center Rotary. Former: Domestic violence advocacy; Volunteer debate coach and teacher.  \n  \n**Statement**  \n\nAs a lifelong student, I hold education as the most important institution in our community. Just as we inherited this great nation from our parents, we owe our children the best education and opportunity available: For themselves, and to advance the best of our values and example to the world.  \n  \nParents are crucial decision-makers in their children’s education, and they should be able to excuse their children from courses with objectionable content. We must not, however, deprive other students their opportunities to learn. Students should not become pawns of our current political environment. I will work to ensure our students have first-class academics.  \n  \nEducation not only prepares students for jobs. It prepares them for life. The social skills students learn from sports, performing arts, debate, etc., are as essential as traditional academic subjects. I will work to preserve these opportunities for our students.  \n  \nWe must prepare students for tomorrow’s challenges. I will work to ensure our students have opportunities to learn the science and technology that will shape their future.  \n  \nMy wife and I are proud that both our children graduated from KSD. I would  be honored to serve you, our students, and our community. I ask for your vote.",
  "website": "http://www.ScottERodgers.com",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}