{
  "name": "Audra Byrd",
  "slug": "audra-byrd",
  "email": "Audra_byrd@yahoo.com",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61278/1533564",
  "image": "/images/candidates/audra-byrd-original.png",
  "statement": "**Elected Experience**  \nNo Information Submitted  \n  \n**Other Professional Experience**  \nFormer certified k-12 teacher in RSD; Licensed and active foster parent since 2015; Group Fitness Instructor for 19+ years; Water aerobics supervisor at Columbia Basin Racquet Club  \n  \n**Education**  \nHanford Highschool Graduate; AA-Columbia Basin College Running Start; BA graduate in K-12 Education- Eastern Washington University; Post graduate education - WSU Tri-Cities  \n  \n**Community Service**  \nClassroom volunteer at Three Rivers Homelink and Wiley Elementary; Parent Volunteer for Project Based Learning instructional training; Youth basketball, softball, and soccer coach; Youth Sunday school teacher; Active member of the local Relief Society (largest women’s service organization in the world); Cub Scout leader   \n  \n**Statement**  \n\nAs a mother of 6+, I am invested and eager to enable the lifetime success of our students by providing leadership to the school district and a vision for valuable education. It is not enough to just get students back in the classroom without limitations, but to make the educational experience in Richland schools better than it has ever been with engaging, relevant, and diverse learning opportunities. \n\n  \n\nAfter an unprecedented year of chaos, I will help our students and staff heal from the physical, mental, and educational trials of Covid. I will also work to establish an environment where students get the services, care, and support they need to thrive by Advocating for families to have their educational preferences heard and honored; Building parent/teacher/student relationships by effectively working with the superintendent and her staff; Advocating for SpEd, English Language Learning, and mental health resources; Supporting all learning environments including Homelink, Delta, Quest, Richland Virtual School, Rivers Edge, Worksource, Behavioral (BESST) program, Early Learning Preschool, Art, Music, PE, and more.\n\n  \n\nVote for Audra Byrd to give families voice and choice!\n\n  \n  \n\n509-433-7855\n\n  \n\nAudra\\_byrd@yahoo.com\n\n  \n\nFacebook: Audra Byrd 4 Richland School Board",
  "website": "https://www.facebook.com/Audra-Byrd-4-Richland-Sch",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}