{
  "name": "Jacob Finkbeiner",
  "slug": "jacob-finkbeiner",
  "email": "",
  "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=870#/candidates/61241/1538254",
  "image": "/images/candidates/jacob-finkbeiner-original.png",
  "statement": "**Elected Experience**  \nNo direct elected experience to share. There needs to be a first time for everything and there’s no time like the present.  \n  \n**Other Professional Experience**  \nAssistant manager for a trucking company for 5+ years. Ran my own trucking company for 4 years. Owned and ran a taco truck in Pullman.  \n  \n**Education**  \nGraduated Spokane’s Mead High School 2002. Graduated with a BA in Philosophy from WSU in 2012, Dean’s List, with almost enough credits for a minor in Biology.  \n  \n**Community Service**  \nNothing to share as of yet. Ready to get my hands in and help volunteer!  \n  \n**Statement**  \nJacob Finkbeiner is a Columbia Basin local born and raised; born in Richland, raised in Othello, with some time spent away up in Spokane, but always coming back home to the basin. He has lived in Kennewick going on 6 years and is looking to put down roots within the town and hopefully give back to the community he calls home.  \nJacob believes in a strong community (re)invested in its constituents. If elected, he would work to continue Kennewick’s progress. As a citizen that tries to be nonpartisan and fairly centrist, he is interested in keeping taxes low while reinvesting in infrastructure projects that will increase community productivity and works to beautify Kennewick. Interest should be in how to best serve the community, not partisan politics or scoring cheap shots against opponents or faceless “rival” groups. A community is made up of all its members, not just the ones we agree with.  \nOur future is only as good as our current works. Government should be open and accountable as a priority, with a focus on economic development and housing to keep up with expansion. His goal is to keep levies reasonably down while trying to maximize Kennewick’s growth potential.  \n  \njacobforkennewick@gmail.com",
  "website": "",
  "pdc_url": "",
  "uuid": "",
  "party": "",
  "electionyear": "2021",
  "office": ""
}