[
  {
    "candidate_ballot_id": 42721,
    "candidate_ballot_name": "Rocky Mullen",
    "email": "rocky_mullen@aol.com",
    "website": "http://voterockymullen.com",
    "statement": "**Elected Experience**  \nPrecinct Committee Officer Republican Party.\n\n**Other Professional Experience  \n**Local business owner of Dove Financial Services and Sahara Pizza. Local Cattle Rancher and Real Estate Investor. 35 plus years of management experience working and negotiating with National and International Corporations, US Military Contracts, and the Motion Picture Industry.\n\n**Education**  \nEastern Washington University, World Wide College of Auctioneering.\n\n**Community Service**  \nVolunteer auctioneering services for local fundraising and charity events. Work closely with Benton Franklin County Fair and Farm Fair. Support local schools through various fundraising programs. _Endorsed by Franklin County Sheriff Jim Raymond, Current Franklin County 2nd District Commissioner Bob Koch, Lincoln County Sheriff Wade Majors._\n\n**Statement**  \nI am a lifelong resident of Franklin County, Local Business owner, and Cattle Rancher. I was born and raised in Pasco on our family farm which has been in operation since 1945. I want to be your voice and your representation in our local government.\n\nI have attended the weekly County Commissioners meetings for the past four years on a regular basis to I have a better understanding of the operations, duties, and responsibilities of this position and the challenges that the office brings. I am committed to representing our community in a positive and professional manner. I will be a Commissioner for the people and will work diligently for a balanced budget to ensure that spending is closely monitored, eliminating waste or misuse of county funds.\n\n_I believe in controlled limited spending to provide essential services._\n\n_I believe that our constitution rights and the traditional values that this great nation was founded on should be protected. I will work hard to protect these rights._\n\nAs a business owner, I realize the importance of small business in our community and the need for limiting government regulations to stop over-taxation.\n\nI appreciate your vote!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29028/42721",
    "image": "/images/candidates/rocky-mullen-original.png"
  },
  {
    "candidate_ballot_id": 45378,
    "candidate_ballot_name": "Cliff MacHugh",
    "email": "cliff@jackassmtranch.com",
    "website": "http://",
    "statement": "**Elected Experience**  \nNo information submitted.\n\n**Other Professional Experience**  \nFarm manager; Fresh produce packing manager; Orchardist; Heavy Equipment Technician; Truck Driver; Sales.\n\n**Education**  \nGraduate Pasco High School; Some college at CBC.\n\n**Community Service**  \nVolunteered 7 years as EMT for Franklin County Public Hospital Dist. #1 and Franklin County Fire Dist. #3; Board member Franklin County Farm Bureau; Former board member Franklin County Sherriff’s Foundation.\n\n**Statement**  \nI was born into the farm life here in Franklin County. I have two wonderful children, and come from a good family. I have worked from the bottom to the top. In 2005 I helped build the family farms commercial fruit packing facility, and have managed it every season since. Volunteering as an EMT, I’ve seen people at their worst, and people at their best. It has been rewarding to be part of a team helping people in times of emergent need.\n\nI believe my experience in farm management and medical experience will lend itself well into being part of the team that manages our county. I am fiscally conservative. I believe in a limited government that uses resources to help build up business and community. I loathe burdensome over-regulation and wasteful spending of hard earned taxpayer dollars.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29028/45378",
    "image": "/images/candidates/cliff-mac-hugh-original.png"
  },
  {
    "candidate_ballot_id": 42717,
    "candidate_ballot_name": "Ana Ruiz Peralta",
    "email": "Communications@electanaruiz.com",
    "website": "http://electanaruiz.com",
    "statement": "**Elected Experience**  \nNo information submitted.\n\n**Other Professional Experience**  \nInterpreter & QI Monitor - Pacific Interpreters 1999 -2012, New York Life Agent 2012- 2018, Tri-Cities Community Health - Current Board Chair 2012 – Present, DPDA Board Member 2014-2016, Negotiator for City of Pasco- Colima Friendship Agreement, Somos Pasco Economic Development Strategic Vision- Executive Committee member 2016, Commissioner - Washington State Commission on Hispanic Affairs 2013- 2015, Graduate of Leadership Tri-Cities Class XVIII, Tri-Cities Regional Chamber of Commerce -Young ATHENA Award Recipient 2016.\n\n**Education**  \nNo information submitted.\n\n**Community Service**  \nCo-Founder/Creator Pasco Taco Crawl, Former Mid-Columbia Mastersingers Board Member, Former Columbia Basin Badger Club Board Member, Former United Way Board Member, Former Tri-Cities Regional Chamber Board Member.\n\n**Candidate Statement**  \nI’m Ana Ruiz Peralta and I’m asking for your vote to be your next Franklin County Commissioner. Franklin County has been the fastest growing county in the State of Washington for the last 20 consecutive years. My goals are to improve our overwhelmed and underfunded bi-county public health system as well as our juvenile justice system.\n\nI’m running for Franklin County Commissioner because I believe It’s the Moment for decisive leadership that’s focused on smart growth policies that protect locally owned farms and I will work to create infrastructure for efficient internet connectivity for the county.\n\nI’m proud to be raising my three amazing children in Franklin County. It is an attractive and welcoming community to everyone. I chose to live in here because of the quality of the education system in place and the economic growth opportunities.\n\nI will be an inclusive servant-leader to Franklin County as I work on the expansion and access to Franklin County Commissioner meetings and I will advocate to provide interpretation services at said meetings. Lastly, I will work to improve relationships with the Benton County Commissioners through cooperation and collaboration on key bi-county issues that impact all residents.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29028/42717",
    "image": "/images/candidates/ana-ruiz-peralta-original.png"
  },
  {
    "candidate_ballot_id": 72042,
    "candidate_ballot_name": "Terry Ryan Cissne",
    "email": "terrycissne@gmail.com",
    "website": "http://",
    "statement": "**Elected Experience**  \nNo elected experience.\n\n**Other Professional Experience**  \nI have been self-employed my entire life with lots of ups and downs. I am a very optimistic person.\n\n**Education**  \nI attended Big Bend Community College and Washington State University.\n\n**Community Service**  \nI have volunteered as a youth football, basketball, wrestling, and baseball coach throughout the last several years. I am the father of 5 amazing children. Being a good husband and father has been my #1 priority. Thank you for your vote.\n\n**Statement**  \nMy name is Terry Cissne, and I am running for District 2 Franklin County Commissioner. I have been a resident in Franklin County for 21 years.\n\nI married my High School sweetheart, Diana, who has been working for the Pasco School District since 2000. We are blessed with 5 very active and healthy children. Our daughter Samantha 20, our sons Riley 18, Tayten 12, and Cooper 10, and daughter Paige 7.\n\nI am committed to Franklin County and have a fundamentally sound agricultural background and feel that I share similar aspirations with the people who reside within our district. I know that with my commitment and knowledge I can continue the work that best helps our district sustain its progress while continuing to grow. I am a voice for, “smart growth and lower taxes”. I will stand up for what is right. I will get results for the people I represent. I am not a politician, I just want the tax money we all pay to go to what we as voters intended. “Not robbing Peter to pay Paul.” I humbly and respectfully ask for your vote as Commissioner of Franklin County District 2. Thank you for your support!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29028/72042",
    "image": "/images/candidates/terry-ryan-cissne-original.png"
  },
  {
    "candidate_ballot_id": 69094,
    "candidate_ballot_name": "Larry Stanley",
    "email": "stanley4washington@gmail.com",
    "website": "http://stanleyforwashington.com",
    "statement": "**Elected Experience**  \nNo information submitted  \n  \n  \n**Other Professional Experience**  \nTasting Room Manager of a winery. Customer Service Trainer for Amazon. Teacher of ESL in Asia. Director of an international education program. Pastor of a Church in CA.  \n  \n**Education**  \nGraduate of Hanford High School, Richland WA  \nGraduate Bachelor of Arts from Life Pacific College, San Dimas CA  \n  \n  \n**Community Service**  \nNo information submitted  \n  \n  \n**Statement**  \nLarry will be a new kind of politician – a term limited, transparent public servant who puts state before Party and solutions before ideology.  \n  \nWe also need a new kind of informed, tolerant, discerning citizen – who is an “ally” to his or her fellow Americans. A citizen who doesn’t: vote straight party tickets; blindly adopt positions that are mandated by political tribe; vilify other Americans because of differences. Both major parties only focus on making the other side lose so that we all end up losing in the end. Not right, not left, move forward together.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57339/69094",
    "image": "/images/candidates/larry-stanley-original.png"
  },
  {
    "candidate_ballot_id": 44838,
    "candidate_ballot_name": "Matt Boehnke",
    "email": "voteboehnke4house@gmail.com",
    "website": "http://www.electmattboehnke.us",
    "statement": "**Elected Experience**  \nState Legislator 2018-Present; Assistant Ranking on the Innovation, Technology & Economic Development Committee; Kennewick City Council 2016-2018  \n  \n  \n**Other Professional Experience**  \nCollege Professor, retired US Army Senior Officer; Owner Bravocon IT Services, Energy Northwest Cyber Security PM, USACE Contracting Officer  \n  \n**Education**  \nKamiakin High School, BA, Government, Eastern Washington University; MS, Aeronautical Science, Embry-Riddle Aeronautical University, Military education through Command & General Staff College.  \n  \n**Community Service**  \nAmerican Legion, Bethlehem Lutheran Church, Columbia Basin Veterans Coalition, National Rifle Association, Sunrise Rotarian, Tri-City Americans Billet Family, Veterans of Foreign Wars, Washington Education Association  \n  \n**Statement**  \nRep. Matt Boehnke is already a leader in Olympia, recognized for his expertise in technology and cyber security by both parties. Matt’s also the sort of leader who listens, works well with others, and he has a servant’s heart. In short, Matt is the kind of leader we need more of in government.  \n  \nWith our vote, Matt can continue working to promote higher education locally and statewide, because education and research create good jobs. Matt also wants to limit the size of government, especially the bureaucracy that stifles job growth. Matt’s approach to COVID-19 is to safely reopen our economy.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57339/44838",
    "image": "/images/candidates/matt-boehnke-original.png"
  },
  {
    "candidate_ballot_id": 44823,
    "candidate_ballot_name": "Kim Lehrman",
    "email": "electkimlehrman@gmail.com",
    "website": "http://www.electkimlehrman.com",
    "statement": "**Elected Experience**  \nNo information submitted.  \n  \n**Other Professional Experience**  \n\nAgriculture Educator and FFA Advisor, 2000-2013. Taught Agriculture Science, Horticulture, Floriculture and Welding. Award recipient as Ag. Educator at building, district and state levels. Started Chiawana High School's FFA Chapter and Floral Shop 2009. Custom swathing, baling, and hay stacking 1984-2002.\n\n**Education**  \n\nKamiakin High graduate. Bachelors Degree, General Agriculture Science with a teaching certificate, Minor in Public Relations Washington State University-Pullman, 2000. Masters in Educational Leadership, Washington State University-Tri-Cities, 2006.\n\n**Community Service**  \n\nCoached youth soccer and basketball for 10 seasons, PTO member and ATP Parent Chair, Pro-bond and Levy campaign member; Title 1 School Conference representative; PSD Community Builders; iMPACT! Compassion Center mentor.\n\n**Statement**  \nIn an era of divisive politics, it’s important to focus on the cooperative spirit and common-sense values that make Franklin County a wonderful place. I’m running because my strengths are listening and building bridges over divides. I learned these values while growing up on our family’s alfalfa farm.  \n  \nAs commissioner, I’ll focus on transparency, collaboration, and innovation. Families are struggling more than ever with mental health during COVID-19. The county commission, working with the Sheriff's Office, should be offering greater crisis support services including an App where individuals can report unsafe situations and additional mental health services in partnership with Benton County. We need economic relief for small businesses and a shared smart urban growth criteria with our local city governments. This isn’t the time to rely on broken relationships between commissioners and local residents, and economic and health policy experts. We need collaboration to create innovative ideas and partnerships to save our county. This means engaging with our agriculturists, business owners, and residents about what families and businesses need to recover and thrive.  \n  \nAs a former agriculture educator/FFA Advisor, proud mother, and active community member, I’ll be a commissioner who _leads through listening_. Vote Kim Lehrman!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29027/44823",
    "image": "/images/candidates/kim-lehrman-original.png"
  },
  {
    "candidate_ballot_id": 42764,
    "candidate_ballot_name": "Brad Peck",
    "email": "lbp1958@gmail.com",
    "website": "http://",
    "statement": "**Elected Experience**  \nFranklin County Commissioner 2009 to present; elected Chairman of the Board multiple times.  \n  \n**Other Professional Experience**  \nRetired U.S. Air Force officer. Desert Storm (Gulf War) veteran. Advisor to Air Force Chief of Staff (Pentagon). Squadron Commander. Served in multiple Middle East countries, the Pentagon, and throughout the U.S.  Managed multi-million dollar budgets leading teams of nearly 400 people. Multiple military awards and decorations. Five years experience working in nuclear power generation.  \n  \n**Education**  \nMaster of Science, Eastern Washington University.  Bachelor of Arts, Central Washington University. Extensive formal management and leadership training.  \n  \n**Community Service**  \nServe on more than 20 local and state Boards of Directors, and community committees.   \n  \n**Statement**  \nAs a highly experienced County Commissioner – and the only candidate with any Commissioner experience - I want to lead us through the present pandemic and major budget challenges in the coming years. I was honored to provide that same leadership during the 2011-2012 recession that we survived without raising taxes or eliminating essential services.  \n  \nContinuing my service will also avoid a new, inexperienced Board with a mere 24 months of total combined experience; making it one of the least experienced in the state.  \n  \nMy network of professional contacts extends to all 39 counties and numerous local and state agencies. Those cooperative relationships greatly strengthen our voice with the state legislature and improve our access to state and federal funding, which reduces local taxes.  \n  \nI strongly support quality education with schools funded by the entire community, without placing an unfair share on selected people or businesses.   \n  \nI believe in limited government, low taxes, individual accountability, and the premise that government’s primary responsibility is to help citizens succeed in their chosen endeavors, not regulate and tax those endeavors!  \n  \nMy wife Debra and I love Franklin County and spent the past 16 years faithfully restoring the Moore Mansion in Pasco.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29027/42764",
    "image": "/images/candidates/brad-peck-original.png"
  },
  {
    "candidate_ballot_id": 45070,
    "candidate_ballot_name": "Matt Beaton",
    "email": "mattbeaton@msn.com",
    "website": "http://",
    "statement": "**Elected Experience**  \nFranklin County Auditor: Past 10 Years.\n\n**Other Professional Experience**  \nSage Appraisal Services Inc. Owned and operated. Completed over a billion dollars in valuation services in the Tri-Cities region appraising single family homes, mixed-use, land and small commercial properties.\n\n**Education**  \nBA in Business Administration, University of Washington: Certified Real Estate Appraiser Washington State 25 years; Real Estate Broker, Washington State Inactive 30 years.\n\n**Community Service  \n**Washington Coalition for Open Government: Board Member Pasco Kiwanis: Satellite Member, Lourdes Foundation Board: Past Member, Central Washington Catholic Foundation Board: Member, Relief Member: Pasco resident: 25 years. Married to Lisa for 22 years, 4 children, two still in Pasco Schools.\n\n**Statement**  \n“These are the times that try men’s souls” Those words were written by Thomas Paine in a pamphlet titled “Common Sense”. Its purpose was to inform and inspire the people to action during a trying time in our history when change was badly needed.\n\nI am Matt Beaton and I need your vote to deliver change in Franklin County. We need new leadership to improve county relationships, internally and with outside agencies. The past 10 years, I have been leading in Franklin County as your Elected County Auditor. In that time, the Auditor team has uncovered fraud, balanced budgets and have collaborated to improve accountability and transparency countywide.\n\nAs your County Commissioner I will listen, balance competing interest and build collaborative relationships internally and with other agencies. I am committed to the small government efficiency of Bi-County programs, desire to rebuild others and seek new ones. As local businesses work to recover from the economic shutdown, our County government will come alongside, assist and guide overwhelmed citizens that are just trying to build a home, create a business or just survive.\n\nAs your Commissioner I will continue to _earn_ your trust and work to deliver the government you deserve.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/29027/45070",
    "image": "/images/candidates/matt-beaton-original.png"
  },
  {
    "candidate_ballot_id": 78142,
    "candidate_ballot_name": "Brett Borden",
    "email": "brett.borden@lpwa.org",
    "website": "http://bordenforliberty.com",
    "statement": "**Elected Experience**  \nTreasurer, Libertarian Party of Washington  \n  \n**Other Professional Experience**  \nBrett has experience as a local business owner, bookkeeper, and bookseller. He currently works in manufacturing.  \n  \n**Education**  \nSocial Studies program, Eastern Washington University  \n  \n**Community Service**  \nAmerican Civil Liberties Union of Washington, past member of the Pullman Chamber of Commerce and Sons of Norway Sol-Land Lodge #2-086 (Kennewick). Past business supporter of events for Palouse Pride, Pullman Civic Theatre, Community Action Center of Whitman, and KRFP Radio Free Moscow.  \n  \n**Statement**  \n\nAs a liberty-loving citizen of southeastern Washington, I demand a state government that keeps its hands off the freedoms we cherish. All citizens have a natural right to be left alone and make their own choices as adults.  \n  \nI pledge to stand firmly on the side of the People against government overreach in all forms. My legislative priorities include criminal justice reform and ensuring small business owners and farmers get a fair shake. I also support electoral reforms so our elected leaders better represent the will of voters. Please join me in pursuit of a _free_ and _just_ Washington!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57292/78142",
    "image": "/images/candidates/brett-borden-original.png"
  },
  {
    "candidate_ballot_id": 46045,
    "candidate_ballot_name": "Mary Dye",
    "email": "electmarydye@gmail.com",
    "website": "http://",
    "statement": "**Elected Experience**  \nAs your elected State Representative, I serve on the House Environment Committee, Capital Budget Committee and Appropriations Committee. I’m a passionate leader in empowering our communities and reforming the way Olympia works with our citizens and local governments.  \n  \n**Other Professional Experience**  \nFrom 1987 to present, I co-manage a 3rd generation wheat farm. I previously served as an agricultural educator in the Peace Corps in Ubon Thailand.  \n  \n**Education**  \nBachelor of Science - Plant Science, Crop Management, University of Idaho, 1983.  \n  \n**Community Service**  \nI have championed causes important to Eastern Washington including \"Save Our Dams\", “Freedom to Farm” and defending our rural values.  \n  \n**Statement**  \nAs your elected State Representative, I have focused on economic development and building infrastructure that will expand opportunities for families, farms, and communities. I passed legislation that will develop broadband fiber in areas with poor access to high speed internet. I worked to secure water for our towns and farms.  \n  \nWith principle driven leadership, and talent for seeking creative solutions, I develop tools that help expand and promote economic opportunities so citizens in Eastern Washington can live successful lives in freedom. During these challenging times, I have worked to create new ways to connect food producers with people in need.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57292/46045",
    "image": "/images/candidates/mary-dye-original.png"
  },
  {
    "candidate_ballot_id": 44940,
    "candidate_ballot_name": "Joe Schmick",
    "email": "",
    "website": "http://www.joeschmick.com",
    "statement": "**Elected Experience**  \n\nServed the 9th District since December 2007\n\n**Other Professional Experience**  \nWashington Farm Bureau Board of Directors, Washington Barley Commission, Washington Agriculture and Forestry Education Foundation Class 14  \n  \n**Education**  \nBA in Accounting and minor in Economics from EWU  \n  \n**Community Service**  \nFood bank volunteer.  Coached Little League for nine years  \n  \n**Statement**  \nAs a former second-generation farmer and small business owner, Joe Schmick understands the importance of hard work, dedication, perseverance  and takes these values to Olympia.  He continues to focus on four key areas.  Jobs-small businesses need to have a pathway forward to survive Covid-19.  Healthcare-we need to protect the patient and control the increasing costs of healthcare.  Education-a good education is vital to providing a ready workforce and creating individual opportunites.  Protecting property rights-we can enhance the enviroment while respecting and protecting property rights at the same time.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57340/44940",
    "image": "/images/candidates/joe-schmick-original.png"
  },
  {
    "candidate_ballot_id": 45475,
    "candidate_ballot_name": "Skyler Rude",
    "email": "",
    "website": "http://www.skylerrude.com",
    "statement": "**Elected Experience**  \nState Representative (2019 – present); Chairman, State Committeeman, and Precinct Committee Officer for Walla Walla County Republican Party  \n  \n**Other Professional Experience**  \nLegislative Assistant serving the 16th district in the Washington State Senate (2017-18) and Washington State House of Representatives (2015-16); Insurance Agent (2009-2014); Telecommunications (2005-2009)  \n  \n**Education**  \nWalla Walla Community College, Western Governor’s University  \n  \n**Community Service**  \nWalla Walla Parks, Recreation and Urban Forestry Advisory Board; Columbia Basin College Paramedic Program Advisory Board; various voluntary legislative service including the House Bipartisan Working Group (co-founder), Joint Higher Education Committee, Community College Counselors Task Force, Legislative Nuclear Working Group, and the House Remote Testimony Task Force  \n  \n**Statement**  \nSkyler was born, raised and educated in Walla Walla County. His lifelong connection to our district, his unique experience at the Legislature, and his energy and passion for innovative ideas make him the ideal candidate to continue representing us. Skyler’s priorities include high quality educational opportunities for all Washington children, a healthy business climate that allows businesses to recover and thrive, and improved services for our most vulnerable populations. As our State Representative, Skyler’s collaborative approach has helped ensure our communities and families have a seat at the table when decisions are made in Olympia.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57300/45475",
    "image": "/images/candidates/skyler-rude-original.png"
  },
  {
    "candidate_ballot_id": 44918,
    "candidate_ballot_name": "Carly Coburn",
    "email": "coburn16ldpos2@gmail.com",
    "website": "https://www.electcarlycoburn16ld.com/",
    "statement": "**Elected Experience**  \nElected PCO, First Vice Chair of FCDCC and their State Committee Members pos. 1, First Vice Chair of the 16th LD Democrats, WSDCC First Vice Chair of the Disability Issues Caucus, WSDCC Eastern WA Vice Chair of the Stonewall Caucus.  \n  \n**Other Professional Experience**  \n2020 Census Educator and social media management.  \n  \n**Education**  \nGED, some college.  \n  \n**Community Service**  \n\nPFLAG Benton Franklin, Tri-Cities Pride Festival, Tri-Cities Mutual Aid Project, Annual Disability Day of Mourning, Annual Transgender Day of Remembrance, Annual Tri-Cities Womxn's March, 4th Congressional District Democrats Treasurer, Tri-Cities Young Democrats, Three Rivers Autism Outreach, Autism Ambassadors, and various other local events and organizations.\n\n  \n**Statement**  \nI'm a lifelong Washingtonian, raised in Camas and Vancouver, but who found 'home' in the 16th LD, specifically Pasco. Though my family didn’t speak much about politics growing up, I always felt drawn towards equity, and later an interest in policy making.  \n  \nI’m involved in both local partisan and nonpartisan politics, working on several campaigns over the last four years. I’m running on a platform dedicated to healthcare affordability and accessibility in rural communities, affordable housing, and increasing the standard of living for disabled and low income Washingtonians. Let's show Olympia the Indomitable Spirit of Eastern Washington, and the 16th!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57300/44918",
    "image": "/images/candidates/carly-coburn-original.png"
  },
  {
    "candidate_ballot_id": 68150,
    "candidate_ballot_name": "Perry Dozier",
    "email": "dozierforsenate@outlook.com",
    "website": "http://www.dozierforsenate.com",
    "statement": "**Elected Experience**  \nWalla Walla County Commissioner 2009-2016 Chairman 3 years, Budget Committee 5 years; Washington; Association of Wheat Growers, Past President; Washington State Barley Commissioner; Northwest Grain Growers Board of Directors, Past President  \n  \n**Other Professional Experience**  \nOwner/Operator dryland and irrigated farming operation ; Planning Commissioner  \nGreater Behavioral Health Board; Aging and Long Term Care Board, WorkSource Walla Walla Board, Workforce Development Council, Snake River Salmon Recovery Board, Valley Transit Board, Walla Walla Watershed Partnership Board. Walla Walla Fair Interim Manager  \n  \n**Education**  \nWhitman College BA Economics  \n  \n**Community Service**  \nWashington Association of Wheat Growers, Presbyterian Church, Walla Walla County GOP, Waitsburg Historical Society, Fort Walla Walla Museum  \n  \n**Statement**  \nPerry Dozier, a life-long resident of Legislative District 16 and married for 39 years with two grown sons, is committed to creating a better future for our communities.  \n  \nPerry’s political experience spans 20 years and includes testifying before the United States Senate regarding road, river and rail transportation as well as the United States House Agriculture Committee on farm bill policies.  \n  \nPerry’s diverse professional experiences and leadership roles, both locally and statewide, bring an in-depth perspective to representing the people of District 16. _“As a former County Commissioner responsible for preparing the county budget, I have experienced first-hand how laws from Olympia impact our local communities. I have dealt with an economy in recession. I know how to work with elected officials to reach a favorable outcome.”_ Perry’s leadership experience, communication skills, and fiscal knowledge will be beneficial in Olympia representing our ideals and way of life in Eastern Washington.  \n  \nPerry is an advocate for K-12, vocational-tech and higher education. He will work to limit taxes and regulation on businesses which will allow job creation. Perry will promote personal property and water rights including conservation of natural resources. He will work to protect your 2nd amendment rights.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57346/68150",
    "image": "/images/candidates/perry-dozier-original.png"
  },
  {
    "candidate_ballot_id": 44890,
    "candidate_ballot_name": "Danielle Garbe Reser",
    "email": "info@garbereser.com",
    "website": "http://www.garbereser.com",
    "statement": "**Elected Experience**  \nAs a first-time candidate, I’ll bring a needed bipartisan voice to the State Senate.  \n  \n**Other Professional Experience**  \n\nI proudly served our country as an American diplomat under Republican and Democratic administrations for nearly 14 years. I returned home in 2015 to serve as CEO of Sherwood Trust, one of Eastern Washington’s largest philanthropies.\n\n**Education**\n\nI graduated cum laude with honors in Politics from Whitman College and earned a Master of Public Administration from Columbia University.\n\n  \n**Community Service**  \n\nWhitman College volunteer, 1997-present, currently serving as President’s Advisory Board Vice Chair; Walla Walla’s Noon Rotary Club member and committee member for the YWCA and Community Council.\n\n  \n**Statement**  \n\nI love Eastern Washington and feel lucky to have been raised in Moses Lake and to make Walla Walla my home. Our region values hard work and serving our country and our communities. I have dedicated my life to these values and to putting people before partisan politics. \n\n  \n\nI’m running to bridge the divides between Eastern and Western Washington and our rural and urban communities. We need a government that works for us -- our farms, our businesses, our families. Our communities deserve a senator who will fight for the resources we need to thrive. On our farm, we value common sense and fiscal responsibility. Olympia needs more of both.\n\nThank you to the community leaders and organizations that have endorsed our campaign, including: State Senator Valoria Loveland (former), Megan Clubb, Walla Walla Police Chief Chuck Fulton (former), Pasco City Councilmember Rebecca Francik (former), Pasco City Councilmember Zahra Roach, College Place Mayor Norma Hernández, Columbia County Port Commissioner Fred Crowe (former), Washington State Labor Council, nurses and healthcare workers at SEIU 1199NW, our local teachers at Washington Education Association, Teamsters 839, electrical workers at IBEW 77, and many more.\n\nI ask for your vote and the honor of serving you.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57346/44890",
    "image": "/images/candidates/danielle-garbe-reser-original.png"
  },
  {
    "candidate_ballot_id": 45110,
    "candidate_ballot_name": "William \"Bill\" Jenkin",
    "email": "",
    "website": "http://www.electbilljenkin.com",
    "statement": "**Elected Experience**  \nTwo terms as 16th District Representative. Elected to Caucus leadership as Deputy Whip. Three years on Prosser School Board, 2 years as School Board President.\n\n**Other Professional Experience**  \nOwner, Prosser Vineyard & Winery and Bill’s Tasting Room, Edward Jones Financial Advisor (AAMS), former Farmers Insurance Agent, Real Estate Investor.\n\n**Education**  \nB.A. in Business Management, University of Redlands\n\n**Community Service**  \nWashington Complete Count Census Committee, State Tourism Marketing Authority, past Rotary District 5060 Governor, Founding Chairman of Prosser Boys & Girls Club, former Prosser Chamber of Commerce President, Prosser Economic Development Association, People for People Board Member, Prosser United Good Neighbor President (2014) and member.\n\n**Statement**  \nAs your state Representative, I’ve fought in Olympia to make sure our community is heard. Serving on key committees like tourism, international trade, economic development, the census and capital budget, I’ve worked hard promoting our district as a leader and securing the resources it deserves. If elected as your state Senator, I will continue to be an accessible and tireless advocate for you.\n\nThe coming years will be a challenge for state government and our district needs the experience I have as an effective representative of the people. A voice for common sense, pragmatic solutions, and conservative values in the Legislature, there's no question about what I will do for our communities because my record speaks for itself.\n\nI will prioritize state spending to reflect our values with existing tax dollars. I will protect water rights for rural communities, continue to stand up for parental rights in education, and work for economic prosperity for all.\n\nI'm proudly endorsed by prosecutors, county commissioners, mayors, sheriffs, and community leaders from across the district, in addition to senators from around the state. Vote Bill Jenkin for 16th District state Senate to ensure we have a tested and effective voice in Olympia.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57346/45110",
    "image": "/images/candidates/william-bill-jenkin-original.png"
  },
  {
    "candidate_ballot_id": 45950,
    "candidate_ballot_name": "Frances Chvatal",
    "email": "electfrances@gmail.com",
    "website": "http://electfrances.com",
    "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nA Registered Nurse for 37 years; 10 years spent providing direct patient care, 22 years in clinical leadership as the Director of Surgical Services at Providence St. Mary Medical Center and 5 years as a quality analyst.   \n  \n**Education**  \nBS Nursing, WSU, 1983.  \n  \n**Community Service**  \nCurrently serves on the Providence St. Mary Mission Board. Served as a lector at church services, a volunteer at the winter warming center and as a member of the Walla Walla Bicycle Pedestrian Advisory Council.   \n  \n**Statement**  \nProud to be from Eastern Washington, Frances was born in Walla Walla and raised on a farm in Touchet. Frances will represent the people of the 16th Legislative District with integrity and honesty.  A Registered Nurse for 37 years, Frances has listened to thousands of people, _she will listen to you_.  Frances looks to science and data to make sound decisions mindful of economic impact.  _Government derives its legitimacy from the people, to whom it must be answerable_. As your Representative she will be an advocate for family farms, a healthy environment, quality healthcare and access to education.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57252/45950",
    "image": "/images/candidates/frances-chvatal-original.png"
  },
  {
    "candidate_ballot_id": 45796,
    "candidate_ballot_name": "Mark Klicker",
    "email": "",
    "website": "http://klickerforrep.com",
    "statement": "**Elected Experience**  \nNo information submitted\n\n**Other Professional Experience  \n**_Current:_ Owner - Urban, Farm and Forest Group (forest management);  Realtor - Northwest First Realtors Farm & Ranch. _Previous:_ Founder/owner - Klicker Enterprises (asphalt sealer/repair company)  Owner/operator - AOK Klicker Cherries; Regional state director - Washington Farm Bureau.\n\n**Education  \n**Graduate Walla Walla Community College\n\n**Community Service  \n**_Past: _ President, Walla Walla County Farm Bureau, Mill Creek Watershed Fire Protection Committee, Co-Chair Walla Walla High School Track Project, Jubilee Christian Academy, Community Advisory Committee – Walla Walla Union Bulletin. _Present:_  County Chairman - Voluntary Stewardship Program, board member - Fort Walla Walla Museum, NW Blues Stewardship Admin Group\n\n**Statement  \n**With my strong experience in the agriculture and business industry I understand how to help get our economy moving again. My top priorities include small business recovery, create tax incentives (_not_ tax increases), control government spending and reduce unneeded regulation while making sure we protect our schools and essentials and maintaining a safe and healthy work place. Over the last 35 years I have worked tirelessly to build relationships and find solutions to solving difficult issues with those of different views while maintaining my stance on the values I hold. I will do the same when representing the 16th district.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57252/45796",
    "image": "/images/candidates/mark-klicker-original.png"
  },
  {
    "candidate_ballot_id": 46426,
    "candidate_ballot_name": "Talesha \"Tali\" Sams",
    "email": "electsams@gmail.com",
    "website": "http://",
    "statement": "**Legal/Judicial Experience**  \nAttorney with Adult Protective Services; Title 11 Guardian Ad Litem; District Court Judge Pro Tem; Prosecutor; Public Defender; Private practice for 20 years; County Bar Association Trustee.\n\n**Other Professional Experience**  \nNurse; Respiratory Therapist; Emergency Medical Technician; Ranger/Paratrooper; Combat Veteran; PFLAG President.\n\n**Education**  \nLaw degree from Gonzaga University; Bachelor’s degree in Arts and Social Sciences from Washington State University; Associate degree in respiratory therapy/nursing and Emergency Medical Technician from Walla Walla Community College.\n\n**Community Service**  \nYWCA Domestice Violence Shelter; Benton-Franklin County Legal Aid Society; Various County Bar Associations; Assisting youth, the LGBTQ community, and the public through PFLAG, Pride Foundation, and free legal clinics.\n\n**Statement**  \nI have always made it my priority to serve the public and advocate for the disadvantaged. I have practiced in the areas of civil, criminal and administrative law. I have worked in private practice and as a prosecutor in both District and Superior Courts. I have worked for DSHS in protecting vulnerable adults from different forms of abuse and as a Title 11 Guardian Ad Litem. I have volunteered countless hours in legal clinics in the area by assisting individuals in need of legal assistance. I have been a Judge Pro Tem for King County District Court since 2015.\n\nBecause of my diverse legal background combined with my many years of community service, I would be a well prepared and effective Judge. I would uphold the law and would not legislate any personal agenda. I feel that a Judge should be knowledgeable and experienced in all matters before them. A Judge should possess humility, a positive demeanor and temperament, and treat all those who come before the bench with respect and fairness regardless of their social or economic backgrounds. A Judge should never put their own interests before those of the court or the public for which they serve.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/46426",
    "image": "/images/candidates/talesha-tali-sams-original.png"
  },
  {
    "candidate_ballot_id": 66630,
    "candidate_ballot_name": "Shelley A. Ajax",
    "email": "AjaxforJudge@gmail.com",
    "website": "http://ajaxforjudge.com",
    "statement": "**Legal/Judicial Experience**  \nAjax Law Firm, 2005-Present; Arbitrator, 2010 – present; Litigation Manager, Allen Brecke Law Offices, 1995-2005; Founder of local Young Lawyer Division, 2006.\n\n**Other Professional Experience**  \nGuardian ad litem, Benton-Franklin County Superior Court, 2001-2007; Gerry Spence Trial Lawyers College Board Member, 2010-2013; Chief Justice, WSU Judicial Board, 2001-2002; Associate Editor, WYLD De Novo Publication, 2005-2008.\n\n**Education**  \nGonzaga School of Law, J.D., summa cum laude, 2003-2005; WSU, B.A. Social Sciences, 2001-2002, summa cum laude.\n\n**Community Service**  \nBenton-Franklin Legal Aid Society Board Member, 2006-2009; Benton-Franklin Legal Aid Society President, 2009-2013. Benton-Franklin County Arbitrator, 2010-present.\n\n**Statement**  \nShelley Ajax has spent her entire 30-year legal career in the Tri-Cities, first working in a private civil firm and then as a public servant in the criminal arena protecting the rights of citizens and upholding the constitution.\n\nShe first served on the Board, and then as the President of Benton-Franklin Legal Aid Society, and has been honored by local, regional and statewide organizations for her dedication to pro bono services. With her decades of legal experience and volunteer service to the Tri-City community, she sees the chance to become a Judge as a continuation of her community service.\n\nIn 2010, she committed to serving as a volunteer Arbitrator to provide fair and reasonable resolutions to cases to avoid congestion in the already crowded courts. She believes that a Judge’s duty is to uphold the law fairly, and not to legislate any personal agenda. She will bring experience, leadership and integrity to the bench.\n\nShe is excited and humbled to continue to serve the best interests of our community as a Benton-Franklin County Superior Court Judge.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/66630",
    "image": "/images/candidates/shelley-a-ajax-original.png"
  },
  {
    "candidate_ballot_id": 46365,
    "candidate_ballot_name": "Bronson J. Brown",
    "email": "bronsonforjudge1@gmail.com",
    "website": "http://www.bronsonforjudge.com",
    "statement": "**Legal/Judicial Experience**  \nGeneral Counsel, Kennewick School District, Grandview School District ; City Attorney, City of West Richland, City of Union Gap: City Prosecutor, Richland, Pasco and West Richland, Legal Counsel, Fluor Hanford, (2007-2008); Attorney, Bell, Brown, & Rio; Hearing Officer, Pasco School District; Hearing Examiner, Benton City (2005-2008)  \n  \n**Other Professional Experience**  \nAdjunct professor, Columbia Basin College, (2006- 2011)  \n  \n**Education**  \nKennewick High School, 1994; Central Washington University, BA Law & Justice, Spanish (2000); California Western School of Law, J.D. (2002)  \n  \n**Community Service**  \nBoard President, Benton Franklin Legal Aid; Board Member, Boys & Girls Club; Scoutmaster, Boy Scouts of America  \n  \n**Statement**  \nTri-City native Bronson Brown and Wendy, his wife of 23 years, reside in Kennewick with their 5 children. Bronson has represented clients in most levels of our judicial system. He has successfully argued all types of criminal and civil cases in district, superior and federal district courts, and the state court of appeals. He has represented cities and school districts, county agencies, and Hanford contractors. Bronson is passionate about improving access to justice including helping persons without the means for legal representation. He has represented individuals in a variety of civil matters, from domestic disputes to adoptions. Collectively this experience has given him perspective on the variety of cases experienced by a Superior Court judge.  \n  \nBronson believes a judge should serve with impeccable honesty and integrity. Judges have a duty to protect our liberties and fundamental rights afforded under the federal and state constitutions. Bronson is committed to serve by applying/interpreting the law without bias and irrespective of any personal or political views.  \n  \nBronson tries to live a balanced and healthy life. He enjoys running and cycling, escaping to the outdoors with his family, and serving in his church and community.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/46365",
    "image": "/images/candidates/bronson-j-brown-original.png"
  },
  {
    "candidate_ballot_id": 77690,
    "candidate_ballot_name": "Dave Petersen",
    "email": "daveforjudge@gmail.com",
    "website": "http://dave4judge.com",
    "statement": "**Legal/Judicial Experience**  \nMunicipal Court Judge, City of Pasco; Judge Pro Tem, Benton and Franklin County Superior and District Courts; Owner, Petersen Law Office; Former partner, Cowan, Moore, Stam, Luke, Petersen & Carrier; Former partner, Roach Law Offices; Former Deputy Prosecutor, Franklin County.  \n  \n**Other Professional Experience**  \nFormer tank mechanic/aviation support, U.S. Army and National Guard.  \n  \n**Education**  \nJuris Doctorate, Thurgood Marshall School of Law; BA Business Administration, University of Washington.  \n  \n**Community Service**  \nBoard member, Benton Franklin Legal Aid Society; Volunteer coach, Tri-City Prep Mock Trial Team; Volunteer, Local National Adoption Day; Committee member, United Methodist Church; Former Guardian ad Litem; Former instructor, Reserve Law Enforcement Academy.  \n  \n**Statement**  \n_Integrity. Fairness. Experience._  \n  \nIt is my firm belief that as your next Benton Franklin County Superior Court Judge, I am a steward of your Constitutional Rights. While holding offenders accountable for their crimes, I will ensure that dignity and respect are fundamental principles employed by the court. Regardless of the matters before me, I will bring integrity, fairness, and impartiality to the bench.  \n  \nI am the only candidate with vast experience as a municipal court judge and judge pro tem, in addition to 20+ years of experience in civil, criminal and family law matters, and over ten years of experience as a family law mediator. My extensive experience and rational temperament makes me the most qualified candidate for your next Superior Court Judge.  \n  \nBorn in Kennewick, I have called this community “home” my entire life, only moving away to serve in the U.S. Army and to attend school. My wife and I are life long residents of this community, raising our three daughters in the Tri-Cities. I would be honored to serve as your next Superior Court Judge. I will work hard to earn your support and trust.  I will work even harder to maintain it.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/77690",
    "image": "/images/candidates/dave-petersen-original.png"
  },
  {
    "candidate_ballot_id": 77250,
    "candidate_ballot_name": "Sharon Brown",
    "email": "lchilders2b@charter.net",
    "website": "http://sharonbrownforjudge.com",
    "statement": "**Legal/Judicial Experience**  \nWA State Senate since 2013. (elected) Currently Senate Deputy Republican Leader,  \nPreviously Senate Vice-President Pro Tem, Member Statute and Laws Committee, Ranking member -Ways and Means Committee; Attorney, private practice-mergers, acquisitions, small business.  \n  \n**Other Professional Experience**  \nMayor Pro-Tem, City of Kennewick 2010 (elected to City Council)  \n  \n**Education**  \nJ.D. University of New Hampshire School of Law, Franklin Pierce Center for Intellectual Property, Certificate -Straus Institute for Dispute Resolution, Pepperdine University School of Law, BA Drew University  \n  \n**Community Service**  \nBoys and Girls Club Board; WSU Tri Cities Advisory Board; Visit Tri-Cities Board;  \nVolunteer for Domestic Violence Survivors, Anti-Human Trafficking, Suicide Prevention  \n  \n**Statement**  \nAs a business lawyer, a City Council member and Mayor Pro Tem, and finally as your State Senator for the past eight years, I have developed a broad and unique skill set to make me an outstanding judge. Since 2013 I have been creating, revising and establishing policy to become law, thus I understand the true meaning of the law, and how it should be applied. Additionally, as a trained mediator, I learned to be absolutely neutral with no bias towards one side or the other. My background as a business attorney facilitated my arguments against a proposed banking tax law that would create a burden for Washington’s small businesses. The law was ultimately struck down by the ruling of a Superior Court Judge. My judicial philosophy is to follow the law as written and to give the taxpayers a good return on their investment by having a strong work ethic. Through my eight years in the Legislature I have a rare 100% attendance record and have never missed a single vote. I pledge to dedicate that same level of effort as a Superior Court Judge for Benton and Franklin counties. I would be honored to receive your vote.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/77250",
    "image": "/images/candidates/sharon-brown-original.png"
  },
  {
    "candidate_ballot_id": 44824,
    "candidate_ballot_name": "Shawn P. Sant",
    "email": "shawn@santforjudge.com",
    "website": "http://www.santforjudge.com",
    "statement": "**Legal/Judicial Experience**  \nFranklin County Prosecuting Attorney (2011-Present); President, Washington Association of Prosecuting Attorneys (2020); Associate Attorney, Mendoza Law Office (2006-2010); Public Defender in Benton, Franklin, and Grant Counties (2007-2010); Deputy Prosecuting Attorney, Franklin County (2004-2006)\n\n**Other Professional Experience**  \nVehicle Operations Specialist, US Air Force; Police Officer, Prosser PD; Reserve Police Officer, Richland PD  \n  \n**Education**  \nUniversity of Idaho, College of Law (J.D.); Chapman University (B.A. Criminal Justice); Community College of the Air Force (A.A.S. Transportation); Columbia Basin College (A.A.S. Criminal Justice)  \n  \n**Community Service**  \nPasco Kiwanis Club; Tri-Cities Hispanic Chamber of Commerce; Boy Scouts Merit Badge Counselor; Mock Interviews at local high schools  \n  \n**Statement**  \nThe criminal justice system touches each of us personally, even if we never set foot in a courtroom. Protecting the rights of all people requires judges with broad, hands-on experience who are committed to the fair and impartial application of our laws. My commitment to those principles comes from a dedicated career seeking justice for all, and spending countless hours with families of murder victims, parents who have lost children to crime, drugs, or suicide, and others impacted by various civil and criminal challenges.\n\nAs a veteran, I recognize the important role of veteran and other therapeutic courts. These courts and mental health services support people experiencing crisis and promote safer communities.\n\nAs the Franklin County Prosecuting Attorney, I lead one of the largest legal departments in our community. I have evaluated thousands of civil and criminal legal matters over my 22 years as prosecutor, public defender, and police officer. My significant trial experience, both prosecuting and defending, makes me the ideal candidate for judge.\n\nI hope I have earned your trust to do the right thing even when it may be difficult. I will continue to lead with honor and integrity as your next Superior Court Judge!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57064/44824",
    "image": "/images/candidates/shawn-p-sant-original.png"
  },
  {
    "candidate_ballot_id": 72361,
    "candidate_ballot_name": "Brad Klippert",
    "email": "brad@bradklippert.net",
    "website": "http://bradklippert.net",
    "statement": "**Elected Experience  \n**State Representative. Committees: Public Safety, Judiciary, Early Learning, Veterans Affairs/Military Operations. Caucuses: Aviation, Railroad, Heritage, Wildland Fire, Recreation.\n\n**Other Professional Experience  \n**Benton and Pierce County Sheriff's Deputy. Colonel/Commander Washington State Guard, 30 years military service, deployed 3 times, Army Helicopter Pilot. Licensed Minister, Paramedic Firefighter, and Volunteer Firefighter.\n\n**Education  \n**Bachelors’ Degree: Behavioral Science and Biblical Studies. Masters’ Degree in Teaching. Certified as a teacher in Washington State in 1997. Nationally certified Paramedic, EMT, Pierce County Fire District Firefighting Academy.\n\n**Community Service  \n**School Resource Officer/Sheriff's Deputy, Soldier, Legislator, Teacher, Minister, community service volunteer, engineer/conductor J&S Express Horse Heaven Hills Kiwanis Club Railroad.\n\n**Statement  \n**Public Safety, Constitutional Rights, Strong Military, Education, Secure Borders, Legal Immigration. \"One Nation Under God, In God We Trust!\" Free Enterprise/Free market, business and agricultural growth/prosperity, family wage jobs. Too many Governor proclamations and regulations have stifled/strangled prosperity for employers/employees. Limit Governor proclamations, bureaucracy and regulations. Fiscally responsible and accountable government. Pro-nuclear energy. Hydro-electric dams Vital, Hydro-electric power Renewable. Excellent, affordable health care balanced with public safety and fiscal responsibility: not socialized medicine.\n\nMutual goals: prosperity, security, responsibility, accountability, education, health care. Working together we can achieve/exceed our mutual goals!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57291/72361",
    "image": "/images/candidates/brad-klippert-original.png"
  },
  {
    "candidate_ballot_id": 67125,
    "candidate_ballot_name": "Shir Regev",
    "email": "shir@atthetablewithshir.com",
    "website": "http://www.atthetablewithshir.com",
    "statement": "**Elected Experience**  \nNone\n\n**Other Professional Experience**  \nSenior Health Physics Technician (Hanford, HAMTC), United States Navy (Electronics Technician Second Class/Surface Warfare, Operation Enduring Freedom), United States Peace Corps (Regional Youth Officer, Kunene North Region, Namibia).\n\n**Education**  \nKamiakin High school 1992; Washington State University 1994 BA Foreign Languages and Literature (Cum Laude)\n\n**Community Service**  \nVolunteer 2nd Harvest Tri-Cities, Volunteer/Director at various runs (Camp Patriot Fourth of July Run, Badger Mountain Challenge, and Columbia River Classic), Certified Jewish Lay Religious Leader, and Volunteer Love Army Tri-Cities.\n\n**Statement**  \nI believe that we are all Washington. This means we deserve to go through life unafraid, that it’s our right to be treated fairly, and respected. This means we believe in the value of all work, whether it’s behind the desk, behind the register, or at the packing plant. We all deserve a living wage which keeps us sheltered, fed and secure. This means we believe in affordable healthcare for all. This means we believe in science and education. We believe real progress leaves no one behind and know we are stronger together. If you agree, vote for Shir Regev.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57291/67125",
    "image": "/images/candidates/shir-regev-original.png"
  },
  {
    "candidate_ballot_id": 78297,
    "candidate_ballot_name": "Jenn Goulet",
    "email": "",
    "website": "http://www.jennforthe9th.com",
    "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience**  \nOwner of Betwixt LLC performing contract instructional design services for Microsoft; former training specialist at HAMMER Federal Training Center; former technical writer for Department of Energy environmental cleanup efforts on the Hanford site; and member of the Board of Directors, Planned Parenthood of Greater Washington and North Idaho and of Planned Parenthood Advocates of Greater Washington and North Idaho  \n  \n**Education**  \nBachelor of Applied Science in Applied Management from Columbia Basin College; Associate of Arts in General Fine Arts from College of DuPage  \n  \n**Community Service**  \nCofounder and former President, Tri-City Freethinkers; former member of the Program and Marketing Committees, Columbia Basin Badger Club  \n  \n**Statement**  \nWe continue to face hardships across the nation and around the world. While some of us have fared better in Washington State than in other states, many of us are still struggling to make ends meet; many are afraid of what the future holds. We have felt the burden in our region; unemployed individuals; businesses that are shut down; businesses that are dealing with dramatically new ways of operating to keep their doors open. I lost work during April and May. As head of household, it was frightening!  \n  \nI’ve faced many financial hardships. I know what it is to struggle. I know what it is to be the recipient of help, and I wouldn’t be where I am today without it—a strong, successful woman ready to fight for others who need assistance. People and small businesses need help now more than ever before. Small businesses are the backbone of our community. I will fight for you to get a larger slice of the pie when it comes to state aid. I will fight for the unemployed and the essential workers. We’re all in this together. Honor me with your vote; I’ll fight to ensure no one gets left behind.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57365/78297",
    "image": "/images/candidates/jenn-goulet-original.png"
  },
  {
    "candidate_ballot_id": 45234,
    "candidate_ballot_name": "Mark G. Schoesler",
    "email": "mschoesler@yahoo.com",
    "website": "http://markschoesler.com/",
    "statement": "**Elected Experience**  \nElected to the Senate in 2004, 2008, and 2016 after serving 12 years in the State House. Elected State Senate Majority Leader for 2015 Legislative Session.\n\n**Other Professional Experience**  \nSelf-employed farmer and rancher, raising cattle, wheat, hay, and canola. Member, Ways and Means; Member, Rules; Member, Labor and Commerce; Member, Select Committee on Pension Policy, Washington State Institute for Public Policy.\n\n**Education**  \nGraduate, Ritzville High School; Graduate, Spokane Community College (A.A.S., Agribusiness)\n\n**Community Service**  \nFormer director, Washington Association of Wheat Growers; Member, Zion Philadelphia Church; Former vice president, Wheatland Communities Fair; Former president, Bronco Boosters; Past President of Washington Friends of Farms and Forests.\n\n**Statement**  \nAs your senator, Mark Schoesler is dedicated to ensuring Eastern Washington’s voice is heard in Olympia and has consistently advocated to limit tax increases, prioritize spending on infrastructure, and stand against Seattle policies and politicians.\n\nAs Washingtonians grapple with COVID-19, Sen. Schoesler supported emergency measures to keep people safe. Now, he is leading the charge on safely restarting our economy. Schoesler and Republican legislators crafted restart plans to get low-risk workers and small business owners back to their livelihoods.\n\nAs Senate Minority Leader, Sen. Schoesler pushed back against extreme Seattle sex-education policies that took local control away from schools. When he was Majority Leader, the percentage of the state budget going to education increased from 46% to 51%, college tuition was cut, and safety improvements have restarted on key highways. He remains focused on agriculture which reflects his background as a fifth-generation farmer in Ritzville. Mark has worked closely with counties, schools, hospitals, universities, and public safety officials to protect the services we depend on.\n\nSen. Schoesler is a proven compassionate, thoughtful, and effective leader in Olympia, and our district would be best served to retain him in his current leadership role.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57365/45234",
    "image": "/images/candidates/mark-g-schoesler-original.png"
  },
  {
    "candidate_ballot_id": 45104,
    "candidate_ballot_name": "Jerome Delvin",
    "email": "",
    "website": "http://",
    "statement": "Jerome Delvin is running for re-election as Benton County Commissioner. He has served as a Republican member of the Washington State Senate, where he has represented Benton County as part of the 8th District since his appointment in 2004. Prior to that, Delvin served in the Washington State House of Representatives from 1994 to 2004. Delvin served for over 30 years as a police officer, first with the U.S. Army and then with the Richland Police Department. He earned his AS in Criminal Justice and an AA in Literature from Columbia Basin College. Delvin is married to his wife, Josie. \n\nRepublican Jerome Delvin believes that Benton County is a great place to live, work and play, but by working together, we can make it even better. Benton County faces many of the same challenges that Jerome Delvin has dealt with successfully at the state level – on issues such as water, agriculture, energy, and land use. As a member of the state legislature for more than 18 years, Delvin has used his experience and proven leadership abilities to find solutions to these challenges both locally and state-wide. As your county commissioner, Jerome Delvin’s priorities will be supporting county services vital to the citizens through a balanced and sustainable budget. He will also continue to develop and promote a friendly business climate, which is necessary for continued job growth. And like you, Delvin believes that it is crucial that government at all levels respect the rights of property owners and keep property taxes as low as possible. As a lifelong resident of Benton County, Delvin knows the issues important to our area. He shares our values. Working for you, he will continue to make a difference as a county commissioner. Vote Jerome Delvin for Benton County Commissioner.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/45104",
    "image": "/images/candidates/jerome-delvin-original.png"
  },
  {
    "candidate_ballot_id": 44870,
    "candidate_ballot_name": "Donnie Landsman",
    "email": "",
    "website": "http://Donnie4Commissioner.com",
    "statement": "**Elected Experience:** District 6105 Precinct Committee Officer, 2015-Present  \n**Other Professional Experience:** National Association of Parliamentarians- Present; BCRP By-Law Chairman 2017-18; BCRP Legislative District Chair 2015-16; ABATE of Washington Legislative Affairs Officer 2008-14.  Candidate for Richland City Council 2015.  Certified Airline Ramp and Operations Control Supervisor/Manager 1985-2005; Compliance Control Officer 2010-2014, Project Manager 2005-present.  \n  \n**Education:** Hanford High School 1981; International Air Academy 1985.  \n  \n**Community Service:** Bikers Collecting Coats; EPCC Teddy Bear Run; Olympia Toy Run; Food Drives; Volunteer Little League Coach; Youth Soccer Coach; 27 years Umpire  \n  \n**Statement:**  Thank you for taking time to read my statement.  Most importantly,  I am asking that you take a few extra minutes to visit Donnie4Commmisioner.com before you mark your ballot.  Especially in this election, I believe you owe it to yourself to know my latest position on issues.   \n  \nTransparency, Accountability and Leadership are all traits that we want from our elected officials.  I believe that the County Commissioner District 1 representation has grown stagnant and is not in touch with the common citizen.  As a whole, the commission no longer is representative of those that placed them in office.  Decisions are being made without feasibility studies, cost analysis or public comment.  In many cases, the issues are hidden in the agenda to be voted on openly and secretively at the same time.  Effectively, the citizen has been marginalized.   \n  \nI entered this race because I am not a politician.  I am an American Worker who believes we deserve better than career politicians running our county.  Your vote is all that is needed to break the mold of a slick operator in a nice suit, or a long time elected official that has lost touch with the people.   \nIt Is time for change!",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/44870",
    "image": "/images/candidates/donnie-landsman-original.png"
  },
  {
    "candidate_ballot_id": 45321,
    "candidate_ballot_name": "Jeff J Smart",
    "email": "jeff@2020smartvote.com",
    "website": "http://",
    "statement": "**Elected Experience:** Treasurer, Washington Association of Realtors 2020.  President, Tri City Association of Realtors 2018.   \n**  \nOther Professional Experience:** Owner and Designated Broker of Smart – Realtors (a second generation Real Estate brokerage in the Tri Cities) and HomeSmart Elite Brokers.   \nCoordinator at Washington State University Tri Cities for many years bringing needed education to place bound adults across the State through distance learning technology.   \nSenior Director for DMX Music, an international music broadcasting company.  Managing staff and budgets in 6 different continents.    \n**  \nEducation:** Graduate Kamiakin High School.  Graduate Washington State University in Pullman (BA, Broadcast Communications, Minor in Political Science).  \n  \n**Community Service:** KCHelp, TROT, Catholic Family and Child Services  \n   \n**Statement:** Jeff J Smart is running to be your Benton County Commissioner.  \n  \nThe citizens of Benton County need transparency from their elected leaders.  They deserve to know where their hard-earned tax money is being spent.  The public safety tax needs to be explained to members of the county who are funding the account.  New, elevated property tax revenue needs to be examined and explained to the property owners as to why the values on their property were substantially increased.  If possible, that decision needs to be reversed or taxes need to be lowered to an appropriate level.  Work needs to be done with the State to expand urban growth boundaries which would bring more land into the county, expanding the availability of affordable housing, thus opening up the market across in all price points. A mental health facility that can serve the needs of youth and adults needs to be brought to the community and be available to not just those who have insurance, but also those that do not and those that can pay out of pocket for services.   \n  \nAs your next county Commissioner, I promise to be accessible, transparent, and responsive to the public that I serve.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/45321",
    "image": "/images/candidates/jeff-j-smart-original.png"
  },
  {
    "candidate_ballot_id": 76373,
    "candidate_ballot_name": "Justin Raffa",
    "email": "info@justinraffa.com",
    "website": "http://www.justinraffa.com",
    "statement": "**Elected Experience**  \nChair, Richland Arts Commission, 2015-17  \nFirst Vice-Chair, Washington State Arts Commission, 2019-present   \n   \n**Other Professional Experience**  \nFormer experience: music substitute teacher with Richland School District, Minister of Music at All Saints' Episcopal Church in Richland, Orchestra Manager of the Mid-Columbia Symphony  \n  \nCurrent experience: Artistic Director of the Mid-Columbia Mastersingers, Chorusmaster of the Yakima Symphony Orchestra   \n **Education**  \nMaster of Music: The University of Arizona  \nBachelor of Music in Music Education: Westminster Choir College of Rider University, Princeton, NJ   \n  \n**Community Service**  \nFormer board service: Columbia Basin Badger Club, Richland Rotary Club, Arts Center Task Force  \nCurrent board service: Leadership Tri-Cities, Visit Tri-Cities, Northwest Region of American Choral Directors Association   \n   \n**Statement**  \nFor two decades, I've served as a leader in my industry with roles including departmental oversight, budget creation and management, and accountability to public stakeholders: all valuable experience for elected officials. With thoughtfulness, compassion, and integrity, I am ready to govern Benton County's efforts. As commissioner, I will endeavor to responsibly manage taxpayer dollars, dutifully administer the Public Safety Sales Tax while maintaining funding for our successful drug, mental health, and veterans' courts, increase public comment at meetings, employ solid governing principles in accordance with procedures, build bridges with neighboring jurisdictions for mutual development, and advocate for Hanford commuter safety.  \nJustin is a proud graduate of the Leadership Tri-Cities program Class XIX and successfully completed levels I, II, and III of the Rotary Leadership Institute. He served as a citizen participant on the Vista Vision Task Force with the Port of Kennewick regarding the redevelopment of Vista Field and on the Brand Implementation Leadership Team with Visit Tri-Cities, Tri-City Regional Chamber of Commerce, and TRIDEC. Justin has enjoyed emceeing fundraising galas for numerous local charitable organizations, including the Domestic Violence Services of Benton & Franklin Counties. He is a founding member of the Tri-City Civility Caucus.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/76373",
    "image": "/images/candidates/justin-raffa-original.png"
  },
  {
    "candidate_ballot_id": 45558,
    "candidate_ballot_name": "Michael Alvarez",
    "email": "mike@votemike.com",
    "website": "http://www.VoteMike.com",
    "statement": "**Elected Experience:**  \nRichland City Councilman, Review and approve a $250 million dollar plus city budget, Council Liaison Planning Commission, Economic Development, Code Enforcement, and much more.      \n  \n**Other Professional Experience:**  \nU.S. Marine Corp. Veteran, Business Owner mortgage company 25 years, Faculty, Master Instructor teaching Finance, Advanced Business Management, Consumer Protection and Code of Ethics to professional organizations throughout Washington.  Finance Officer U.S. Coast Guard Auxiliary Flotilla 85, VP funding development Boy Scouts of America Blue Mountain Council, Past President and Treasurer TCAR.          \n  \n**Education:**  \nBachelor of Business Administration NMSU       \n  \n**Community Service:**   \nCommissioner for Richland Parks and Recreation Commission, Fund Raiser Safe Harbor, National Child Identification Program, Community Service Award winner.      \n  \n**Statement:**  \nGovernments first duty is to protect the people, not run their lives.  Ronald Reagan      \n  \nBenton County will be facing some very difficult Economic and Financial challenges due to Covid19.  I am the only candidate that has the Education and Extensive Financial and Business Experience needed to help ensure that taxpayers money is being used and leveraged in the best possible way so that wasteful spending does not occur and taxes are not increased unnecessarily.     \n  \nA full review of the Public Safety Tax fund is critical.  I pledge to collaborate with city officials within the county to better utilize these funds to improve our public safety as the county continues to grow.  Since being elected to office I have a proven track record of saving taxpayers millions of dollars in taxes.  I’m a strong advocate for our youth, families, senior citizens, and veterans. I will continue to listen to the needs and concerns of our citizens.  My pledge is to be Present, Accountable, and Transparent to all citizens of Benton County.       \n  \nI have been married 31 years to my wife Gina, have two children, both graduates of Richland High and WSU!  We have called Benton County home for 28 years.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27186/45558",
    "image": "/images/candidates/michael-alvarez-original.png"
  },
  {
    "candidate_ballot_id": 44815,
    "candidate_ballot_name": "Will McKay",
    "email": "Will@wmckayconstruction.com",
    "website": "http://",
    "statement": "BIO:  \n  \nWill McKay moved from a dairy farm in Meridian, Idaho in 1996 and has lived in Benton County ever since. Will was heavily involved in school sports, leadership, scouting and church.   \n  \nWill graduated from BYU-Idaho in 2006 with a Bachelors in Construction Management and a Minor in Business Management. Since 2006, Will has been building and managing construction projects in the Tri-Cities, even starting his own business in 2013, W. McKay Construction.  \n  \nWill is married to his beautiful wife of 15 years, with 4 children who are students in the Kennewick school district.  \n\nStatement:  \n  \nAs a business owner and long-time Benton County resident, I offer change to constituents by prioritizing economic prosperity, safety, and transparency.  \n  \nFirst, there needs to be better budgeting and fiscal responsibility in our county. I plan to leverage my background to bring efficiency and productivity to county operations. In particular, my experience in construction management uniquely positions me to bring more housing and economic opportunities to Benton County by working with the cities to progress our urban growth development initiatives. We must run this county as a successful business so all residents benefit.   \n  \nNow more than ever, resident safety is crucial. By better allocating the public safety tax, we can refocus on the current needs in the community. Our first responders deserve our best efforts.  \n  \nFinally, I value transparency for citizens and the surrounding cities and counties. I believe you are entitled to financial clarity so you always know how your contributions improve and protect your way of life. Similarly, I promise to be a responsive and dependable Commissioner with a door wide open to residents and their concerns.   \n  \nIf elected, I will bring economic prosperity, safety, and transparency to Benton County.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27187/44815",
    "image": "/images/candidates/will-mc-kay-original.png"
  },
  {
    "candidate_ballot_id": 45116,
    "candidate_ballot_name": "James R. Beaver",
    "email": "jbeav2311@aol.com",
    "website": "http://",
    "statement": "I have resided in Kennewick since 1972, where my family and I owned and managed Beaver’s Furniture for 37 years.  I attended schools in the Kennewick School District - eventually going to Pullman, where I graduated as a “Coug” with a degree in economics.  I have a wife and 2 adult children. I am a grandpa of 4 granddaughters.  \nI would like to take this opportunity to thank the friends, neighbors, and community for helping me with my dream of “building a better community”.  My goal as a Benton County Commissioner is and has always been to search for ways to improve our County.  \nI look forward to continuing as your commissioner, and want to thank you for your support.",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27187/45116",
    "image": "/images/candidates/james-r-beaver-original.png"
  },
  {
    "candidate_ballot_id": 45360,
    "candidate_ballot_name": "Joe Lusignan",
    "email": "jlusignan@usa.com",
    "website": "http://",
    "statement": "**Elected Experience**  \nNone  \n  \n**Other Professional Experience  \n**  \nYoung Marines Deputy Director 2014-2020; Benton County Sheriff’s Department (Retired) 1992-2014; United States Marine Corps 1983-1990.  \n  \n**Education  \n**  \nBachelor of Science in Liberal Arts from Excelsior College, New York  \n  \n**Community Service  \n**  \nPasco-Kennewick Rotary; 20 years as an adult volunteer for the Young Marines; River View High School Booster Club; Riverview High School Classroom Volunteer Instructor; National Young Marines Board of Directors; Washington Council of Police & Sheriffs Executive Board of Directors; 2nd Harvest Board of Directors; Volunteer Youth Soccer Coach; American Legion; Veteran of Foreign Wars; Fraternal Order of Police.  \n  \n**Statement  \n**  \nMy entire life has been dedicated to service and volunteerism with a focus on programs that strengthen the lives of our youth, serve, and honor our veterans, and enhance public safety efforts. I will serve Benton County full-time and provide the collaborative leadership that is needed to support our fast-growing community.  \nAs your Benton County Commissioner, I will continue my focus on public safety, youth, and our veterans. Specific priority areas will be: better stewardship and accountability of your Public Safety Sales Tax dollars – revenue critical to continuing the local fight against crime and criminal gang activity; improved transparency and accountability for Commission meetings and decision processes; strengthening partnerships with community stakeholders and other local government leadership; and supporting efforts that will improve our emergency mental health and drug addiction programs.   \nBenton County deserves a full-time leader. Not only am I 100% committed to the position, I will lead with integrity, transparency, and accountability. I will be available to the community and will work hard for you and with you.  \nThank you for your support!  \n  \n**Contact  \n**  \nWebsite: www.go4joe.us; email: jlusignan@usa.com; Facebook: Joe Lusignan for Benton Co Commissioner",
    "pamphlet_url": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/27187/45360",
    "image": "/images/candidates/joe-lusignan-original.png"
  }
]