[
  {
    "candidate_ballot_id": 68053,
    "candidate_ballot_name": "Ryan Cooper",
    "email": "ryankcooper@gmail.com",
    "website": "http://www.cooper4wa.com",
    "statement_html": "<strong>Elected Experience</strong><br />\nBenton/Franklin County Libertarian Party Chair 2017-2019. Benton/Franklin County Libertarian Party Treasurer 2019-present.<br />\n<br />\n<strong>Other Professional Experience</strong><br />\n<p style=\"margin-right: 0px; margin-bottom: 0px; margin-left: 0px; font-stretch: normal; font-size: 12px; line-height: normal; font-family: 'Times New Roman'; color: #000000; -webkit-text-stroke-width: initial; -webkit-text-stroke-color: #000000;\"><span style=\"font-kerning: none;\">Owner, R Cooper Sales, 2009-present. Army National Guard, 2005-2011. Benton County Coordinator, Gary Johnson for President, 2016. Ran numerous political campaigns since 1998.&nbsp;<br />\n</span></p>\n<br />\n<strong>Education</strong><br />\n<p style=\"margin-right: 0px; margin-bottom: 0px; margin-left: 0px; font-stretch: normal; font-size: 12px; line-height: normal; font-family: 'Times New Roman'; color: #000000; -webkit-text-stroke-width: initial; -webkit-text-stroke-color: #000000;\"><span style=\"font-kerning: none;\">BS Journalism Missouri State, 2007. AA Mineral Area College, 2003. Diploma Valley R-6, 1998.&nbsp;<br />\n</span></p>\n<br />\n<strong>Community Service</strong><br />\n<p style=\"margin-right: 0px; margin-bottom: 0px; margin-left: 0px; font-stretch: normal; font-size: 12px; line-height: normal; font-family: 'Times New Roman'; color: #000000; -webkit-text-stroke-width: initial; -webkit-text-stroke-color: #000000;\"><span style=\"font-kerning: none;\">Christian missionary, 2001-2002. Won a lawsuit that eliminated free speech restrictions at Missouri State in 2003.&nbsp;<span style=\"caret-color: #000000; font-size: 12px; -webkit-text-stroke-color: #000000; font-family: 'Times New Roman'; color: #000000;\">Organized a Richland city petition effort in 2018 to allow local cannabis retail businesses to obtain city business licenses.</span><br />\n</span></p>\n<br />\n<br />\n<strong>Statement</strong><br />\n<p style=\"margin-right: 0px; margin-bottom: 6px; margin-left: 0px; font-family: system-ui, -apple-system, BlinkMacSystemFont, '.SFNSText-Regular', sans-serif; caret-color: #1c1e21; color: #1c1e21; font-size: 14px;\">People need to stand up to the elites in Washington and Washington DC to end the government shutdown of the economy. There&rsquo;s no constitutional justification for the government to take away people&rsquo;s rights and liberties during a pandemic. </p>\n<p style=\"margin-right: 0px; margin-bottom: 6px; margin-left: 0px; font-family: system-ui, -apple-system, BlinkMacSystemFont, '.SFNSText-Regular', sans-serif; caret-color: #1c1e21; color: #1c1e21; font-size: 14px;\">The reason given for these shutdowns was because of a projected lack of hospital beds and medical supplies, a problem created by government trade policies and Certificate of Need laws. We need to get the government out of health care and allow the free market to increase competition, which will result in lower prices and better care. &nbsp;</p>\n<p style=\"margin-right: 0px; margin-bottom: 6px; margin-left: 0px; font-family: system-ui, -apple-system, BlinkMacSystemFont, '.SFNSText-Regular', sans-serif; caret-color: #1c1e21; color: #1c1e21; font-size: 14px;\">With the exception of a handful of liberty minded representatives, the entire House and Senate passed a massive spending bill giving away $500 billion in taxpayer money to &nbsp;large corporations. The plan is to keep throwing more money at the problem. Enough is enough!</p>\n<p style=\"margin-right: 0px; margin-bottom: 6px; margin-left: 0px; font-family: system-ui, -apple-system, BlinkMacSystemFont, '.SFNSText-Regular', sans-serif; caret-color: #1c1e21; color: #1c1e21; font-size: 14px;\">If you are tired of never-ending debt, huge restrictions on personal liberties, never-ending foreign wars, and government on steroids, I urge you to vote differently in 2020. Voting for the same two political parties has only led to less liberty and more government control.</p>\n<p style=\"margin: 6px 0px; font-family: inherit;\">The Libertarian Party is the only nationwide party that supports 100 percent of your liberties 100 percent of the time. We are the Party of Principles. We have chapters all across the country, including here in Eastern Washington. &nbsp;You can join the Libertarian Party by visiting www.lp.com/join. The Libertarian Party of Washington can be found at ww.lpwa.org.</p>\n<p style=\"margin: 6px 0px; font-family: inherit;\"><span style=\"caret-color: #1c1e21; font-size: 14px; font-family: system-ui, -apple-system, BlinkMacSystemFont, '.SFNSText-Regular', sans-serif; color: #1c1e21;\">America needs more Libertarian members of Congress willing to stand up to Nancy Pelosi and Mitch McConnell.&nbsp;</span><span style=\"font-family: inherit;\">I&rsquo;m Ryan Cooper, Libertarian candidate for the Wa 4th Congressional District.&nbsp;</span><span style=\"font-family: inherit;\">I&rsquo;d be honored to have your vote and support August 4.</span></p>",
    "pdc": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57373/68053"
  },
  {
    "candidate_ballot_id": 71810,
    "candidate_ballot_name": "Tracy \"Justice\" Wright",
    "email": "tracyjusticewright@gmail.com",
    "website": "https://tracyjusticewright.wixsite.com/website",
    "statement_html": "<strong>Elected Experience</strong><br />\nPolitically Incorrect Outsider<br />\n<br />\n<strong>Other Professional Experience</strong><br />\nMilitary Experience:  Gulf War Operation Desert Storm Shop Floor Planner prioritizing Patriot Missile Guidance system; Black Box JustInTime; System Administrator computer networking ; Banking: Territory Advisor for Washington Oregon and Alaska for a major supplier of vaults, safes, atms, voting machines etc. Telecommunications: worked with a minority owned company  computer operations, network administrator, electronic data interchange liaison and programming inventory control/accounting. Government:  statistical programming to measure radiation levels at Hanford nuclear site and  C Section mortality.<br />\n<br />\n<strong>Education</strong><br />\nBS in CS, Certified Master Planner Manufacturing Control Systems<br />\n<br />\n<strong>Community Service</strong><br />\nClean Up Congress!&nbsp; &nbsp;Every Interest is a Special Interest!<br />\n<br />\n<strong>Statement</strong><br />\nI was raised Free Methodist and had two great grandfathers who were pastors.  Free Methodists didn&rsquo;t believe in Slavery during abolishment times and I still don&rsquo;t.  I believe every interest is a special interest.<br />\n<br />\nI am an efficiency expert and have run productivity numbers for two Fortune 500 Companies with the same result for manufacturing and service industries.  I endorse the 24 hour work week.  Four (4) - 6 hour shifts per week is the highest productivity for employees! <br />\n<br />\nThen why do we have a 40 hour work week?  This was put in place as a maximum work week and is obvious to millions of Americans who are underpaid slaves that it isn&rsquo;t enforced and most aren&rsquo;t making ends meet working the 40 maximum hours.  I wish our doctors and nurses had been working shorter hours all along so they could ramp up during an epidemic or prepare for  emergencies such as war instead of starting out exhausted from long required shifts .<br />\n<br />\nMinimum wage?  Our problem is the maximum wage.  Billionaires not paying taxes while they pay slave wages and hand out mandatory maximum hours.  Our own senator has spent his entire career trying to enable his plantation's slave labor instead of figuring out how to make his plantation environmentally sustainable and a good source of sustainable income for our citizens. <br />\n<br />\nCitizens,  What responsibility do we have?   How do we handle corrupt politicians? Vote out incumbents who voted to bail out banks and billionaires again. Every US citizen could have received $75,000 per person.  Now that is stimulating.  Instead they milked us along while bailing out their billionaire enablers again.  And again we foot the viral bills!<br />\n<br />\nI ask for your vote.  I&rsquo;m &ldquo;Justice&rdquo; from the hood and I promise to do my best to make Central Washington Good.&nbsp;&nbsp;<br />",
    "pdc": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57373/71810"
  },
  {
    "candidate_ballot_id": 66947,
    "candidate_ballot_name": "Douglas E. McKinley",
    "email": "doug@mckinleylaw.com",
    "website": "https://dougmckinley2020.com/",
    "statement_html": "<p><strong>Elected Experience</strong><br />\nBenton County Democratic Party State Committeeman, 2016<br />\n<br />\n<strong>Other Professional Experience</strong><br />\nI have been an attorney for almost 30 years, working to protect for the rights of working people in the state and federal courts.  I have taken on all kinds of cases, big and small, always putting my client's needs first. I have also spent more than 10 years teaching business law and corporate finance at Washington State University, Tri-Cities.<br />\n<br />\n<strong>Education</strong><br />\nBachelor of Science, University of Utah, 1987;  Masters of Business Administration, University of Utah, 1989;  Juris Doctorate, Willamette University, 1991.<br />\n<br />\n<strong>Community Service</strong><br />\n14 years Board Member, City of Richland, Board of Adjustment.<br />\n<br />\n<strong>Statement</strong><br />\nIn 1929 our nation was plunged into an unprecedented economic depression under a Republican president, Herbert Hoover, who did nothing to end Americans' suffering. In 1932, Americans overwhelmingly elected Franklin Roosevelt to the White House. President Roosevelt promised bold plans to put Americans back to work, and he followed through on those plans. Roosevelt put thousands to work building the dams on the Columbia River that still power Central Washington's economy. Roosevelt also put Social Security in place, providing millions of seniors a dependable income that continues to this day.<br />\n<br />\nRepublicans called those programs &ldquo;socialism,&rdquo; but the American people saw them for what they were; putting the needs of people first. Today, we face a new economic crisis that again calls for big, bold actions by the federal government. But just as they did in 1932, Dan Newhouse and Donald Trump are calling these actions &ldquo;socialism.&rdquo; They were wrong in 1932, they are wrong today.<br />\n<br />\nWe need to put Americans back to work, and we need to create the right incentives so that American workers get a bigger piece of the economic pie that they create. We need a basic level of health-care for every American that is affordable, and that isn't tied to a job. We need to make college affordable. We need immigration reform that keeps families together, with a pathway to citizenship for hard-working, tax-paying, law-abiding immigrants. We need to transition to clean energy.</p>\n<p>We have a choice. We can continue to follow Dan Newhouse and Donald Trump down the same path that, today and in 1929, led to massive unemployment and a crippled economy, or we can choose a new path. Please support me with your vote to put Americans back to work so we can build a better, more prosperous America.</p>",
    "pdc": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57373/66947"
  },
  {
    "candidate_ballot_id": 75365,
    "candidate_ballot_name": "Evan Jones",
    "email": "congress@evanjones.us",
    "website": "http://evanjones.us",
    "statement_html": "<p><strong>Elected Experience</strong><br />\nThis is my first candidacy for public office.<br />\n<br />\n<strong>Other Professional Experience</strong><br />\nCurrently a Learning Consultant &amp; Workplace Training Designer (<em>learn-thrive.com</em>) and a part-time airline crew member. Previously taught high school Civics and American Government and was a Headmaster (Principal) during 20-years as an educator. Worked as an industry issues management executive and served as Director of Communications for the national organization, Keep America Beautiful.<br />\n<br />\n<strong>Education</strong><br />\nBA-Kenyon College (Ohio) [Sociology]. Graduate Studies: London School of Economics [Policy &amp; Planning].<br />\n<br />\n<strong>Community Service</strong><br />\nFounder of Tri-Cities Beautiful (<em>tricitiesbeautiful.org</em>) a local nonprofit focused on volunteer-driven community improvement and neighborhood beautification (launching Fall 2020).<br />\n<br />\n<strong>Statement</strong><br />\nIn the post-Covid age we have learned that we need representation in Washington that functions <em>first, last and always</em> to help families and businesses thrive through both challenge and opportunity.</p>\n<p>We need leadership that is <em>shrewd, prepared, capable, communicative, and entrepreneurial.</em> We need independent thinkers who give every constituent ready access to federal resources and policy making.</p>\n<p>Can the partisan morass that is Congress in 2020 deliver this kind of leadership? Simply: If <em>&ldquo;regular Joneses&rdquo;</em> like you and I (whether you are conservative, moderate,&nbsp;or progressive) could transform Congress to make it work <em>for us</em>, what would we do?</p>\n<p>Congress must now focus intently on <em>progress</em>, without putting a premium on who gets the credit. It must be <em>service-driven</em> and <em>accomplishment-oriented</em>. Representatives must now think, act, and legislate based on how policy and programs <em>actually impact our workplaces and neighborhoods</em>, not their own political prospects. They must commit focus to <em>action over words</em>, and <em>measured progress over political gamesmanship</em>. They need to <em>use the best ideas</em> from all sources and actively build bridges toward all perspectives. Most important their chief service must now be to regularly provide constituents with&nbsp;<em>reliable facts</em> and diverse perspectives on key issues of the day, so we can make judgments and decisions to help our families and businesses thrive.</p>\n<p>I am running as an independent for Congress in the 4th District because I believe the partisan process is thoroughly and irretrievably broken; it could never produce progress-oriented leadership and constituent service like this. But I sincerely believe we can break the grip of party politics and self-promotion in Congress and make our region a catalyst for a national resurgence at this unique moment in our history.</p>\n<p>Visit my website (<em>evanjones.us</em>) to learn more about our &ldquo;independent approach&rdquo; to transforming Congress.</p>",
    "pdc": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57373/75365"
  },
  {
    "candidate_ballot_id": 76170,
    "candidate_ballot_name": "Sarena Sloot",
    "email": "",
    "website": "http://www.sarenasloot2020.com",
    "statement_html": "<strong>Elected Experience</strong><br />\nNone<br />\n<br />\n<strong>Other Professional Experience</strong><br />\n15 years of healthcare and leadership including ICU RN and Vascular Surgery ARNP.  Previous board member Kadlec leadership council and finance committee. Previous patient care/nursing supervisor Kadlec.  Small business owner and medical director.<br />\n<br />\n<strong>Education</strong><br />\nGraduate Kennewick High School 2002. Graduate Columbia Basin College 2004 Associates Degree Science Nursing. Graduate Washington State University 2011 Bachelors Science in Nursing Summa cum Laude. Graduate Washington State University 2013 Masters Science in Nursing-Family Nurse Practitioner Summa cum Laude.<br />\n<br />\n<strong>Community Service</strong><br />\nSSBAmerica volunteer. Kennewick Grid Kids player safety coordinator. Three Rivers Lacrosse team manager. Ridgeline Estates neighborhood watch participant.<br />\n<br />\n<strong>Statement</strong><br />\nSarena Sloot has protected and advocated for Washington lives entrusted to her care for over 15 years.  She considers advocation for others to be her calling. The roll of Congress is akin to advocacy by design. Representation is the voice of the constituents and guard of civil rights and freedom.  <br />\n<br />\nThe economic and health crisis of our current pandemic requires absolute transparency of data, innovative solutions, and policy that does not threaten constitutional rights or civil liberty. The path forward requires concise fact-based strategies that maintain individual safety, choice, and quality of life while minimizing economic devastation.  Her rebuilding approach reflects trust in communities to self-govern based on common sense, deep rooted values, concise data, and respect for human life, without need of governmental overreach.   <br />\n<br />\nPlatform issues: sustainable reduction of healthcare cost and maintenance of healthcare freedoms; immigration reform for valued migrant workforces, families and farmers; support of CSRIA for dams and water access to protect vital food chains, agricultural economic sustainability, and ongoing municipality; support of nuclear and hydroelectric power as clean energy alternatives and complement to fossil fuels; strong borders protecting from ongoing and future threats; protection of small business with support to both rebuild and revitalize. Sarena believes the path forward includes getting Washington safely back to work now, ongoing accurate individual county statistic transparency, and protection against tax increases to ensure a resurgence of small business economy and agriculture. <br />\n<br />\nSarena was born and raised in Eastern Washington. She spent her youth on a small farm where she enjoyed hunting pheasant and riding quarter horses.  She is married to a 4th generation veteran, mother to 3 boys, and describes her favorite family hobbies as weightlifting, hiking, camping and all competitive sports. <br />\n<br />",
    "pdc": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57373/76170"
  },
  {
    "candidate_ballot_id": 45417,
    "candidate_ballot_name": "Dan Newhouse",
    "email": "Dan@DanNewhouse.com",
    "website": "http://www.dannewhouse.com",
    "statement_html": "<p><strong>Elected Experience\n</strong><br />\nCentral Washington&rsquo;s Representative in Congress since 2015. Washington State House of Representatives 2003-2009.\n</p>\n<p><strong>Other Professional Experience\n</strong><br />\nWashington State Department of Agriculture Director, 2009-2013. Operates a 750-acre farm near Sunnyside where he grows hops, tree fruit, grapes, and alfalfa.\n</p>\n<p><strong>Education\n</strong><br />\nBachelor of Science, Agricultural Economics, Washington State University. Graduate of the AgForestry Leadership Program.</p>\n<p><strong>Community Service\n<br />\n</strong>Past President, Hop Growers of America, Hop Growers of Washington, and Yakima County Farm Bureau. Former member of the Columbia River Task Force and Central Washington Fair Board. Current NRA member.\n</p>\n<p><strong>Statement\n</strong><br />\nDan Newhouse is a champion for us in Congress. He solves problems and stands up against reckless spending. True to his word, the first bill Dan signed onto in Congress was a Constitutional Balanced Budget Amendment. Newhouse pushes government to live within its means and cuts red tape so jobs can grow. When COVID-19 hit our nation, Newhouse fought for resources for health care providers, job creators, and small businesses, while holding China accountable for its deception.\n</p>\n<p>A third-generation family farmer, Dan understands agriculture is the backbone of our economy. He recognizes the best land-use decisions come from local leaders and landowners, not federal bureaucrats.\n</p>\n<p>Newhouse knows the issues that make Central Washington unique. He's keeping the Federal government accountable to clean up Hanford. He&rsquo;s an expert on water issues and is making the Yakima and Columbia Basin Projects a reality. He's advancing forest management to reduce risk of wildfires, and he&rsquo;s protecting our clean, renewable hydropower to ensure dams and salmon can continue to coexist.\n</p>\n<p>Dan votes to ensure health care is accessible, affordable, and decisions are between a patient and doctor. Newhouse is a champion for our veterans. He wrote the law to make sure no veteran is ever denied emergency medical care.\n</p>\n<p>To seniors: Dan will protect Social Security. You paid into the system, and Newhouse will help ensure the government keeps its promise to you.\n</p>\n<p>Most candidates say the right things, but Dan Newhouse has a proven track record backing up his words. He's been commended by business groups, Second Amendment supporters, pro-life organizations, and land rights advocates for his commitment to pro-jobs policies, traditional values, and individual liberty. He brings conservative Central Washington values to Washington, DC. Please vote to keep Republican Dan Newhouse working for us in Congress.</p>",
    "pdc": "https://voter.votewa.gov/genericvoterguide.aspx?e=865#/candidates/57373/45417"
  }
]